alice_dict = {
    "start_1": {
        "text": '''В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли.\n
                Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений.\n
                Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?''',
        "tts": '''В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли.
               Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений.
               Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?''',
    },
    "start_2": {
        "text": '''На рынке, вы стали свидетелем ограбления. Вы попытались остановить преступников, но они сбежали. На следующий день к вам приходит полиция и обвиняет вас в ограблении.\n
                Проследовать за полицией или попробовать сбежать?''',
        "tts": '''На рынке, вы стали свидетелем ограбления. Вы попытались остановить преступников, но они сбежали. На следующий день к вам приходит полиция и обвиняет вас в ограблении.
               Проследовать за полицией или попробовать сбежать?'''
    },
    "start_3_1": {
        "text": '''Вас догоняет один из полицейских и заламывает руки. Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу.\n
                Вы потеряли 1 единицу здоровья\n
                Мотать срок?''',
        "tts": '''Вас догоняет один из полицейских и заламывает руки. Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу.
               Вы потеряли 1 единицу здоровья
               Мотать срок?'''
    },
    "start_3": {
        "text": '''Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу.\n
                Мотать срок?''',
        "tts": '''Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу.
               Мотать срок?'''
    },
    "chap": {
        "text": '''В тюрьме вы понимаете, что жизнь здесь не так проста, как казалось. Вы оказываетесь среди преступников, которые ненавидят вас и считают "мелким фермером". Они издеваются над вами, отбирают еду и уважают только тех, кто сильнее и жестче.\n
                Здоровье: 6/10\n
                Сила: 2\n
                Мана: 0\n
                Для того, чтобы сделать свой досуг более интересным, выберите, чем заняться: спортом или отдыхом в виде сна.''',
        "tts": '''В тюрьме вы понимаете, что жизнь здесь не так проста, как казалось. Вы оказываетесь среди преступников, которые ненавидят вас и считают "мелким фермером". Они издеваются над вами, отбирают еду и уважают только тех, кто сильнее и жестче.
               Здоровье: 6 из 10 
               Сила: 2 
               Мана: 0 
               Для того, чтобы сделать свой досуг более интересным, выберите, чем заняться: спортом или отдыхом в виде сна.'''

    },
    "chap_1": {
        "text": '''Среди различных вариантов занятий, доступных вам в тюрьме, вы решили заняться спортом. \n
                Здоровье: 6/10 \n
                Сила: 4 \n
                Мана: 0 \n
                Продолжить мотать срок? \n''',
        "tts": '''Среди различных вариантов занятий, доступных вам в тюрьме, вы решили заняться спортом.
               Здоровье: 6/10
               Сила: 4
               Мана: 0
               Продолжить мотать срок?'''
    },
    "chap_1_1": {
        "text": '''Вы были вынуждены приспосабливаться к жизни за решеткой, но вы были слишком измучены, чтобы сосредоточиться на чем-то другом, кроме как на сне. \n
                Здоровье: 10/10 \n
                Сила: 2 \n
                Мана: 0 \n
                Продолжить мотать срок?''',
        "tts": '''Вы были вынуждены приспосабливаться к жизни за решеткой, но вы были слишком измучены, чтобы сосредоточиться на чем-то другом, кроме как на сне.
               Здоровье: 10/10
               Сила: 2
               Мана: 0
               Продолжить мотать срок?'''
    },
    "chap_2": {
        "text": '''Наступает день выбора работы. Вам достается работа в мастерской.\n
                Начать работать?''',
        "tts": '''Наступает день выбора работы. Вам достается работа в мастерской.
               Начать работать?'''
    },
    "chap_3": {
        "text": '''Вас толкает начальник и грозит посадить в карцер, вы отправляетесь на работу.\n
                Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам:\n
                "Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?"\n
                Соврать или отказаться?''',
        "tts": '''Вас толкает начальник и грозит посадить в карцер, вы отправляетесь на работу.
               Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам:
               "Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?"
               Соврать или отказаться?'''
    },
    "chap_3_1": {
        "text": '''Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам:\n
                "Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?"\n
                Соврать или отказаться?''',
        "tts": '''Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам:
               "Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?"
               Соврать или отказаться?'''
    },
    "chap_4_1": {
        "text": '''Преступник: "Ты думаешь, что можешь отказаться от меня? Я сделаю твою жизнь адом, если ты не будешь слушаться меня".\n
                Преступник уходит.\n
                Вы ошеломлены произошедшим, закончить работать?''',
        "tts": '''Преступник: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/a581c2e3-4a46-44dd-9d5d-430a99dc85e1.opus">sil<7000>".
               Преступник уходит.
               Вы ошеломлены произошедшим, закончить работать?'''
    },
    "chap_4_1_1": {
        "text": '''После тяжелого дня работы в мастерской вы чувствуете сильную усталость и решаете вернуться в свою камеру для отдыха. Вы открываете дверь своей камеры и видите, что там уже находятся двое заключенных, один из которых был тот преступник, которому вы отказали в помощи.\n
                Вы понимаете, что они настроены решительно и не будут договариваться с вами. Что лучше сделать: "Ударить заключенного", "Убежать",  "Закричать".''',
        "tts": '''После тяжелого дня работы в мастерской вы чувствуете сильную усталость и решаете вернуться в свою камеру для отдыха. Вы открываете дверь своей камеры и видите, что там уже находятся двое заключенных, один из которых был тот преступник, которому вы отказали в помощи.
               Вы понимаете, что они настроены решительно и не будут договариваться с вами. Что лучше сделать: "Ударить заключенного", "Убежать",  "Закричать".'''
    },
    "chap_4_1_2": {
        "text": '''Вы резко поворачиваетесь, чтобы убежать, но один из заключенных быстро подбегает к вам и хватает за руку. Вы пытаетесь вырваться, но он удерживает вас и начинает толкать к стене. Вы чувствуете удар в голову, и все исчезает перед глазами.\n
                Минус 1 единица здоровья.\n
                Очнуться?''',
        "tts": '''Вы резко поворачиваетесь, чтобы убежать, но один из заключенных быстро подбегает к вам и хватает за руку. Вы пытаетесь вырваться, но он удерживает вас и начинает толкать к стене. Вы чувствуете удар в голову, и все исчезает перед глазами.
               Минус 1 единица здоровья.
               Очнуться?'''
    },
    "chap_4_1_4": {
        "text": '''Вы попытаетесь закричать, чтобы привлечь внимание охранников, но один из заключенных быстро закрывает вам рот. Вы начинаете чувствовать себя задыхающимся и беспомощным, пытаясь освободиться от его хватки. Другой заключенный в это время начинает обыскивать ваши карманы и забирает все ценности. Вы теряете сознание.\n
                Минус 3 единицы здоровья.\n
                Очнуться?''',
        "tts": '''Вы попытаетесь закричать, чтобы привлечь внимание охранников, но один из заключенных быстро закрывает вам рот. Вы начинаете чувствовать себя задыхающимся и беспомощным, пытаясь освободиться от его хватки. Другой заключенный в это время начинает обыскивать ваши карманы и забирает все ценности. Вы теряете сознание.
               Минус 3 единицы здоровья.
               Очнуться?'''
    },
    "chap_4_1_3": {
        "text": '''Ваши занятия спортом не прошли даром: вы бьете одного заключенного, тот сразу же теряет сознание. Другой преступник, увидев это, убегает. Вы думаете, что нужно сделать с заключенным, находящимся в отключке.\n
                Теперь что-то нужно сделать с заключенным: "Оставить в камере", "Позвать охрану", "Убрать в соседнюю камеру"''',
        "tts": '''Ваши занятия спортом не прошли даром: вы бьете одного заключенного, тот сразу же теряет сознание. Другой преступник, увидев это, убегает. Вы думаете, что нужно сделать с заключенным, находящимся в отключке.
               Теперь что-то нужно сделать с заключенным: "Оставить в камере", "Позвать охрану", "Убрать в соседнюю камеру"'''
    },
    "chap_4_1_3_1": {
        "text": '''Вы зовете охрану. Вас обвиняют в нападении на заключенного, и теперь вы находитесь в карцере.\n
                Начать сначала?''',
        "tts": '''Вы зовете охрану. Вас обвиняют в нападении на заключенного, и теперь вы находитесь в карцере.
               Начать сначала?'''
    },
    "chap_4_1_3_2": {
        "text": '''Мимо вашей камеры проходит охранник, увидев лежачего заключенного, вас обвиняют в нападении, теперь вы находитесь в карцере.\n
                Начать сначала?''',
        "tts": '''Мимо вашей камеры проходит охранник, увидев лежачего заключенного, вас обвиняют в нападении, теперь вы находитесь в карцере.
               Начать сначала?'''
    },
    "chap_4_1_3_3": {
        "text": '''Вы осматриваетесь вокруг и не замечаете охранников, решаете перенести заключенного в другую камеру. Но когда вы выходите на перекличку, надзиратели находят одного из заключенных без сознания и обвиняют владельца камеры в нападении на него.\n
                Вам нужно восстановить силы. Лечь спать?''',
        "tts": '''Вы осматриваетесь вокруг и не замечаете охранников, решаете перенести заключенного в другую камеру. Но когда вы выходите на перекличку, надзиратели находят одного из заключенных без сознания и обвиняют владельца камеры в нападении на него.
               Вам нужно восстановить силы. Лечь спать?'''
    },
    "chap_4_1_7": {
        "text": '''Вы чувствуете, что вам нужно защитить себя и быстро делаете решительный шаг, пытаясь ударить преступника, которому отказали в помощи. Однако он быстро увернулся, и вы промахнулись, потеряв при этом равновесие и ударившись головой. Вы теряете сознание.\n
                Минус 2 единицы здоровья.\n
                Очнуться?''',
        "tts": '''Вы чувствуете, что вам нужно защитить себя и быстро делаете решительный шаг, пытаясь ударить преступника, которому отказали в помощи. Однако он быстро увернулся, и вы промахнулись, потеряв при этом равновесие и ударившись головой. Вы теряете сознание.
               Минус 2 единицы здоровья.
               Очнуться?'''
    },
    "chap_4_2": {
        "text": '''Вы решаете соврать и согласиться с предложением преступника. \n
                Преступник резко поднялся со стула и подошел к вам, ухмыляясь. Вы попытались отойти назад, но он настиг вас и ударил рукой. Минус 2 единицы здоровья.\n
                Преступник: "Ты думал, что я не пойму, что ты врешь, мелкий? Я тебя здесь научу говорить правду, это первое и последнее предупреждение".\n
                Преступник уходит.\n
                Вы ошеломлены произошедшим, закончить работать?''',
        "tts": '''Вы решаете соврать и согласиться с предложением преступника. 
               Преступник резко поднялся со стула и подошел к вам, ухмыляясь. Вы попытались отойти назад, но он настиг вас и ударил рукой. Минус 2 единицы здоровья.
               Преступник: "Ты думал, что я не пойму, что ты врешь, мелкий? Я тебя здесь научу говорить правду, это первое и последнее предупреждение".
               Преступник уходит.
               Вы ошеломлены произошедшим, закончить работать?'''
    },
    "chap_4_2_1": {
        "text": '''После тяжелого дня работы в мастерской вы чувствуете сильную усталость. Вы направляетесь на перекличку, а затем решаете вернуться в свою камеру, чтобы отдохнуть.\n
                Лечь спать?''',
        "tts": '''После тяжелого дня работы в мастерской вы чувствуете сильную усталость. Вы направляетесь на перекличку, а затем решаете вернуться в свою камеру, чтобы отдохнуть.
               Лечь спать?'''
    },
    "chap_5": {
        "text": '''Когда вы приходите в сознание, вы лежите на полу в своей камере. Вам кажется, что прошло несколько часов, но вы не уверены. Вы пытаетесь подняться, но чувствуете резкую боль в голове и ощущение тошноты. Открыв глаза, вы замечаете, что на вашем лице красуется синяк, а на ваших руках видны следы ударов.\n
                Вам нужно восстановить силы. Лечь спать?''',
        "tts": '''Когда вы приходите в сознание, вы лежите на полу в своей камере. Вам кажется, что прошло несколько часов, но вы не уверены. Вы пытаетесь подняться, но чувствуете резкую боль в голове и ощущение тошноты. Открыв глаза, вы замечаете, что на вашем лице красуется синяк, а на ваших руках видны следы ударов.
               Вам нужно восстановить силы. Лечь спать?'''
    },
    "chap_5_1": {
        "text": '''В течение следующих дней вы стараетесь держаться подальше от других заключенных, опасаясь повторной атаки. Вы также продолжаете работать и складывать деньги в своей камере.\n
                Мотать срок.''',
        "tts": '''В течение следующих дней вы стараетесь держаться подальше от других заключенных, опасаясь повторной атаки. Вы также продолжаете работать и складывать деньги в своей камере.
               Мотать срок.'''
    },
    "chap_6": {
        "text": '''Однажды, работая в мастерской, вы слышите крик заключенного из соседней камеры.\n
                Что думаете, стоит ли посмотреть?''',
        "tts": '''Однажды, работая в мастерской, вы слышите крик заключенного из соседней камеры.
               Что думаете, стоит ли посмотреть?'''
    },
    "chap_6_1": {
        "text": '''Вы решили посмотреть, что происходит в соседней камере, и замечаете, что двое других заключенных избивают третьего.\n
                Помочь или продолжить работать?''',
        "tts": '''Вы решили посмотреть, что происходит в соседней камере, и замечаете, что двое других заключенных избивают третьего.
               Помочь или продолжить работать?'''
    },
    "chap_6_2": {
        "text": '''Вы продолжаете работать, но крик усиливается.\n
                Помочь или продолжить работать?''',
        "tts": '''Вы продолжаете работать, но крик усиливается.
               Помочь или продолжить работать?'''
    },
    "chap_6_0": {
        "text": '''Решив, что нельзя оставлять человека в опасности вы отправились в мастерскую и взяв тяжелый предмет вернулись в его камеру. Пригрозив нападавшим вы заставили их отойти от заключенного. Они бросаются к выходу, и вы оказываетесь наедине с заключенным, которого они избивали.\n
                Оказалось, что он был торговцем, который тайно занимался торговлей внутри тюрьмы. Он благодарит вас за помощь и говорит, что готов оказать вам любую услугу, если вы будете когда-нибудь в чем-то нуждаться.\n
                Продолжить мотать срок?''',
        "tts": '''Решив, что нельзя оставлять человека в опасности вы отправились в мастерскую и взяв тяжелый предмет вернулись в его камеру. Пригрозив нападавшим вы заставили их отойти от заключенного. Они бросаются к выходу, и вы оказываетесь наедине с заключенным, которого они избивали.
               Оказалось, что он был торговцем, который тайно занимался торговлей внутри тюрьмы. Он благодарит вас за помощь и говорит, что готов оказать вам любую услугу, если вы будете когда-нибудь в чем-то нуждаться.
               Продолжить мотать срок?'''
    },
    "chap_6_0_1": {
        "text": '''Вы решаете продолжить работу. Крик прекращается, и, оглянувшись назад, вы видите, как надзиратель уводит двух заключенных, а за ними на носилках несут третьего.\n
                Продолжить мотать срок?''',
        "tts": '''Вы решаете продолжить работу. Крик прекращается, и, оглянувшись назад, вы видите, как надзиратель уводит двух заключенных, а за ними на носилках несут третьего.
               Продолжить мотать срок?'''
    },
    "chap_7": {
        "text": '''В течение следующих месяцев ничего интересного не происходило, однако однажды во время обеда заключенные начали избивать другого заключенного.\n
                Помочь заключенному?''',
        "tts": '''В течение следующих месяцев ничего интересного не происходило, однако однажды во время обеда заключенные начали избивать другого заключенного.
               Помочь заключенному?'''
    },
    "chap_7_1": {
        "text": '''Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.\n
                Вы теряете 3 единицы здоровья.\n
                Отправиться в лазарет?''',
        "tts": '''Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.
               Вы теряете 3 единицы здоровья.
               Отправиться в лазарет?'''
    },
    "chap_7_1_1": {
        "text": '''Из-за вашего решения не обратиться в лазарет вы погибли.\n
                Начать сначала?''',
        "tts": '''Из-за вашего решения не обратиться в лазарет вы погибли.
               Начать сначала?'''
    },
    "chap_7_2": {
        "text": '''Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.\n
                Вы теряете 3 единицы здоровья и погибаете.\n
                Начать сначала?''',
        "tts": '''Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.
               Вы теряете 3 единицы здоровья и погибаете.
               Начать сначала?'''
    },
    "chap_7_3": {
        "text": '''Вы не вмешиваетесь в драку, но появились надзиратели, которые посчитали, что вы являетесь соучастником, и отправили вас в карцер.\n
                Начать сначала?''',
        "tts": '''Вы не вмешиваетесь в драку, но появились надзиратели, которые посчитали, что вы являетесь соучастником, и отправили вас в карцер.
               Начать сначала?'''
    },
    "chap_7_end":{
        "text": '''Из-за вашего решения не обратиться в лазарет вы погибли.
        Начать сначала?''',
        "tts": '''Из-за вашего решения не обратиться в лазарет вы погибли.
        Начать сначала?'''
    },
    "chap_8": {
        "text": '''После того, как заключенные начали бить вас, надзиратели немедленно вмешались и разогнали драку. Они отвели вас в лазарет, где вам была оказана необходимая медицинская помощь.\n
                Вы чувствовали себя очень плохо и были обескуражены произошедшим. Вы понимали, что вмешательство в драку было ошибкой, и теперь вам придется отвечать за  последствия своих действий.\n
                Сохранение игры... Прогресс сохранен.\n
                Желаете продолжить?''',
        "tts": '''После того, как заключенные начали бить вас, надзиратели немедленно вмешались и разогнали драку. Они отвели вас в лазарет, где вам была оказана необходимая медицинская помощь.
               Вы чувствовали себя очень плохо и были обескуражены произошедшим. Вы понимали, что вмешательство в драку было ошибкой, и теперь вам придется отвечать за  последствия своих действий.
               Сохранение игры... Прогресс сохранен.
               Желаете продолжить?'''

    },
    "chap_9": {
        "text": '''Через некоторое время вас выписывают из лазарета, и вы отправляетесь обратно в свою камеру, но замечаете, что заработанные вами деньги пропали.\n
                Опечаленный, вы садитесь на койку и не понимаете, что делать дальше. Вдруг в камеру заходит заключенный, садиться напротив вас и говорит: "Спасибо за то, что вмешался в драку. Можешь ли ты сказать мне свое имя?"''',
        "tts": '''Через некоторое время вас выписывают из лазарета, и вы отправляетесь обратно в свою камеру, но замечаете, что заработанные вами деньги пропали.
               Опечаленный, вы садитесь на койку и не понимаете, что делать дальше. Вдруг в камеру заходит заключенный, садиться напротив вас и говорит: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/10be9a65-539d-41a7-8a80-1db8f018ade4.opus">sil<5000>"'''
    },
    "chap_10": {
        "text": '''"Приятно познакомиться, ''' ,
        "text_1" : '''. Меня зовут Михаил. Я знаю, как мы можем выбраться отсюда", - говорит Михаил, глядя на вас загадочным взглядом.''',
        "tts": ''' "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/f08df250-84c3-48be-b6fd-dd838382b6fc.opus">sil<6000>", - говорит Михаил, глядя на вас загадочным взглядом.'''
    },
    "chap_10_1": {
        "text": '''"Ты помог мне, а я помогу тебе. Для начала тебе нужно принести мне рукоятку, железную заточку и веревку. С их помощью мы сможем сделать самодельную кирку. Когда найдешь все предметы, заходи ко мне в камеру. Мы начнем планировать побег".\n
                Куда стоит пойти первым делом? В столовую или на работу.''',
        "tts": '''"<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/753bceb1-d70b-4893-b408-b71be0d05218.opus">sil<13000>".
               Куда стоит пойти первым делом? В столовую или на работу.'''
    },
    "chap_10_2": {
        "text": '''"Для начала тебе нужно принести мне рукоятку, железную заточку и веревку. С их помощью мы сможем сделать самодельную кирку. Когда найдешь все предметы, заходи ко мне в камеру. Мы начнем планировать побег".''',
        "tts": '''"<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/5c020ae6-0e02-4c31-bc5f-c1e6cb85db55.opus">sil<10000>".'''
    },
    "chap_11": {
        "text": '''Вы пришли в мастерскую.\n
                Хотите осмотреться или сделать рукоятку?''',
        "tts": '''Вы пришли в мастерскую.
               Хотите осмотреться или сделать рукоятку?'''
    },
    "chap_11_1": {
        "text": '''Зайдя в столовую вы видите торговца, которому спасли жизнь.\n
                Хотите подойти к нему''',
        "tts": '''Зайдя в столовую вы видите торговца, которому спасли жизнь. Хотите подойти к нему?'''
    },
    "chap_11_2": {
        "text": '''Вы подходите к заключенному, чтобы спросить про железную заточку. Заключенный отвечает: "Да, я могу продать тебе заточку." Если вы решите купить заточку, то вы потратите все свои деньги, но у вас нет другого выбора.\n
                Вы готовы купить заточку?''',
        "tts": '''Вы подходите к заключенному, чтобы спросить про железную заточку. Заключенный отвечает: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/d4156a2f-1ba7-4f18-9f50-b1d1aac438a1.opus">sil<2000>" Если вы решите купить заточку, то вы потратите все свои деньги, но у вас нет другого выбора. Вы готовы купить заточку?'''
    },
    "chap_12": {
        "text": '''На токарном станке вы изготовили рукоять.\n
                Осмотреться?''',
        "tts": '''На токарном станке вы изготовили рукоять. Осмотреться?'''
    },
    "chap_12_1": {
        "text": '''На полу вы заметили моток веревки. Вы взяли его с собой.\n
                Начать делать рукоятку?''',
        "tts": '''На полу вы заметили моток веревки. Вы взяли его с собой. Начать делать рукоятку?'''
    },
    "chap_13": {
        "text": '''На полу вы заметили моток веревки. Вы взяли его с собой.''',
        "tts": '''На полу вы заметили моток веревки. Вы взяли его с собой.'''
    },
    "chap_13_1": {
        "text": '''На токарном станке вы изготовили рукоять.''',
        "tts": '''На токарном станке вы изготовили рукоять.'''
    },
    "chap_14": {
        "text": '''Вы спросили у торговца, сможет ли он достать железную заточку. Торговец ответил: "Конечно, это малая услуга для моего спасителя". Затем он отдал ее вам. Теперь осталось достать только веревку и рукоятку.\n
                Хотите осмотреться или пойти на работу?''',
        "tts": '''Вы спросили у торговца, сможет ли он достать железную заточку. Торговец ответил: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/a6519c26-f09c-4ea7-812b-904e3655f586.opus"> sil<[2000]>". Затем он отдал ее вам. Теперь осталось достать только веревку и рукоятку. Хотите осмотреться или пойти на работу?'''
    },
    "chap_11_2_1": {
        "text": '''Вы купили заточку. Теперь осталось достать только веревку и рукоятку.\n
                Хотите осмотреться или пойти на работу?''',
        "tts": '''Вы купили заточку. Теперь осталось достать только веревку и рукоятку. Хотите осмотреться или пойти на работу?'''
    },
    "chap_15": {
        "text": '''Вы внимательно осмотрелись, но не заметили ничего ценного.\n
                Отправиться на работу?''',
        "tts": '''Вы внимательно осмотрелись, но не заметили ничего ценного. Отправиться на работу?'''
    },
    "chap_16": {
        "text": '''Вы подходите к заключенному, чтобы спросить про железную заточку. Заключенный отвечает: "Да, я могу продать тебе заточку." Если вы решите купить заточку, то вы потратите все свои деньги, но у вас нет другого выбора.\n
                Вы готовы купить заточку?''',
        "tts": '''Вы подходите к заключенному, чтобы спросить про железную заточку. Заключенный отвечает: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/d4156a2f-1ba7-4f18-9f50-b1d1aac438a1.opus">sil<2000>" Если вы решите купить заточку, то вы потратите все свои деньги, но у вас нет другого выбора. Вы готовы купить заточку?'''
    },
    "chap_17": {
        "text": '''Вы купили заточку.\n
                Все предметы собраны. Отправляемся к Михаилу?''',
        "tts": '''Вы купили заточку. Все предметы собраны. Отправляемся к Михаилу?'''
    },
    "chap_13_3": {
        "text": '''Когда вы зашли в столовую, вы заметили торговца, которому вы спасли жизнь.\n
                Хотите подойти к нему?''',
        "tts": '''Когда вы зашли в столовую, вы заметили торговца, которому вы спасли жизнь. Хотите подойти к нему?'''
    },
    "chap_13_4": {
        "text": '''Вы спросили у торговца, сможет ли он достать железную заточку. Торговец ответил: "Конечно, это малая услуга для моего спасителя". Затем он отдал ее вам.\n
                Все предметы собраны. Отправляемся к Михаилу?''',
        "tts": '''Вы спросили у торговца, сможет ли он достать железную заточку. Торговец ответил: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/a6519c26-f09c-4ea7-812b-904e3655f586.opus"> sil <[2000]>". Затем он отдал ее вам. Все предметы собраны. Отправляемся к Михаилу?'''
    },
    "chap_18": {
        "text": '''Вы заходите в камеру к Михаилу и замечаете, что он лежит на полу без сознания.\n
                Проверить пульс или убежать?''',
        "tts": '''Вы заходите в камеру к Михаилу и замечаете, что он лежит на полу без сознания. Проверить пульс или убежать?'''
    },
    "chap_18_1": {
        "text": '''Вы решаете проверить пульс у Михаила. Однако, пульс отсутствует, и вы осознаете, что Михаил умер.\n
                Убежать или осмотреть комнату?''',
        "tts": '''Вы решаете проверить пульс у Михаила. Однако, пульс отсутствует, и вы осознаете, что Михаил умер. Убежать или осмотреть комнату?'''
    },
    "chap_18_2": {
        "text": '''Вы начинаете бежать, но спотыкаетесь и замечаете листок, лежащий под кроватью. Вы решаете взять его с собой. По прибытии в камеру вы обнаруживаете, что это план побега.\n
                Пришло время для вечерней переклички. Что лучше - спрятать предметы под одежду или оставить их в камере?''',
        "tts": '''Вы начинаете бежать, но спотыкаетесь и замечаете листок, лежащий под кроватью. Вы решаете взять его с собой. По прибытии в камеру вы обнаруживаете, что это план побега.
               Пришло время для вечерней переклички. Что лучше - спрятать предметы под одежду или оставить их в камере?'''
    },
    "chap_19": {
        "text": '''Где наилучшим образом начать искать - в тумбочке, на полу или в кровати?''',
        "tts": '''Где наилучшим образом начать искать - в тумбочке, на полу или в кровати?'''
    },
    "chap_19_1": {
        "text": '''В тумбочке вы находите кошелек Михаила.\n
                Взять его с собой или продолжить искать на полу либо в кровати?''',
        "tts": '''В тумбочке вы находите кошелек Михаила. Взять его с собой или продолжить искать на полу либо в кровати?'''
    },
    "chap_19_2": {
        "text": '''На полу вы ничего не нашли.\n
                Обыскать кровать?''',
        "tts": '''На полу вы ничего не нашли. Обыскать кровать?'''
    },
    "chap_19_3": {
        "text": '''Вы использовали железную заточку, чтобы разрезать матрас, и заметили там листок с чертежами.\n
                Желаете вернуться в камеру?''',
        "tts": '''Вы использовали железную заточку, чтобы разрезать матрас, и заметили там листок с чертежами. Желаете вернуться в камеру?'''
    },
    "chap_19_1_1": {
        "text": '''Вы берете кошелек Михаила.\n
                Где продолжить искать - на полу или в кровати?''',
        "tts": '''Вы берете кошелек Михаила. Где продолжить искать - на полу или в кровати?'''
    },
    "chap_20": {
        "text": '''После возвращения в камеру вы изучаете листок и осознаете, что это план побега.\n
                Пришло время для вечерней переклички. Что лучше - спрятать предметы под одежду или оставить их в камере?''',
        "tts": '''После возвращения в камеру вы изучаете листок и осознаете, что это план побега. Пришло время для вечерней переклички. Что лучше - спрятать предметы под одежду или оставить их в камере?'''
    },
    "chap_21": {
        "text": '''Вы направляетесь на перекличку, но надзиратель замечает отсутствие Михаила. Это приводит к объявлению об обыске, после которого всех заключенных отводят обратно в камеры.\n
                Перепрятать предметы?''',
        "tts": '''Вы направляетесь на перекличку, но надзиратель замечает отсутствие Михаила. Это приводит к объявлению об обыске, после которого всех заключенных отводят обратно в камеры. Перепрятать предметы?'''
    },
    "chap_21_1": {
        "text": '''Вы начинаете прятать предметы, но охранник замечает вас и вы отправляетесь в карцер.\n
                Загрузить последнее сохранение?''',
        "tts": '''Вы начинаете прятать предметы, но охранник замечает вас и вы отправляетесь в карцер. Загрузить последнее сохранение?'''
    },
    "chap_21_2": {
        "text": '''Охранник мчится мимо вашей камеры, и тревога заканчивается. Вы замечаете, как Михаила уносят на носилках куда-то.\n
                Вы ошеломлены произошедшим, хотите лечь спать?''',
        "tts": '''Охранник мчится мимо вашей камеры, и тревога заканчивается. Вы замечаете, как Михаила уносят на носилках куда-то. Вы ошеломлены произошедшим, хотите лечь спать?'''
    },
    "chap_22": {
        "text": '''Вы не выспались и бодрствовали всю ночь из-за кошмаров. Однако, вы понимаете, что это ваш последний день в тюрьме, и принимаете решение сбежать сегодня.\n
                Начать побег сейчас или во время обеда?''',
        "tts": '''Вы не выспались и бодрствовали всю ночь из-за кошмаров. Однако, вы понимаете, что это ваш последний день в тюрьме, и принимаете решение сбежать сегодня. Начать побег сейчас или во время обеда?'''
    },
    "chap_22_1": {
        "text": '''В обеденное время вы отправляетесь к месту, указанному на плане. К вашему удивлению, вы обнаруживаете, что тайная комната, вырытая Михаилом, находится в самом заметном месте, за картиной.\n
                Войти в комнату?''',
        "tts": '''В обеденное время вы отправляетесь к месту, указанному на плане. К вашему удивлению, вы обнаруживаете, что тайная комната, вырытая Михаилом, находится в самом заметном месте, за картиной. Войти в комнату?'''
    },
    "chap_22_2": {
        "text": '''Просматривая план побега, вы понимаете, что тайная комната, прорытая Михаилом, находится за картиной, которая выставлена на самом видном месте. Вы приходите к месту входа в комнату.\n
                Осмотреться или войти в комнату?''',
        "tts": '''Просматривая план побега, вы понимаете, что тайная комната, прорытая Михаилом, находится за картиной, которая выставлена на самом видном месте. Вы приходите к месту входа в комнату. Осмотреться или войти в комнату?'''
    },
    "chap_23": {
        "text": '''Вы осматриваетесь и не замечаете охранников.\n
                Войти в комнату или вернуться в обед?''',
        "tts": '''Вы осматриваетесь и не замечаете охранников. Войти в комнату или вернуться в обед?'''
    },
    "chap_23_1": {
        "text": '''В обеденное время вы вернулись к месту, указанному на плане.\n
                Войти в комнату?''',
        "tts": '''В обеденное время вы вернулись к месту, указанному на плане. Войти в комнату?'''
    },
    "chap_23_2": {
        "text": '''Вы решаете отодвинуть картину, но к сожалению, охранник замечает вас и сажает в карцер.\n
                Загрузить последнее сохранение?''',
        "tts": '''Вы решаете отодвинуть картину, но к сожалению, охранник замечает вас и сажает в карцер. Загрузить последнее сохранение?'''
    },
    "chap_24": {
        "text": '''Вы отодвигаете картину, осторожно пролезаете в комнату и обнаруживаете решетку, которая ведет в канализацию. Чтобы создать что-то полезное вы решаете использовать имеющиеся у вас железную заточку, веревку и рукоятку.\n
                Необходимо определить, что изготовить - самодельный топор или самодельную кирку.\n
                Список\n
                Самодельный топор\n
                Хорош для всех рубящих ударов\n
                Самодельная кирка\n
                Хорошо подходит для копания шахт''',
        "tts": '''Вы отодвигаете картину, осторожно пролезаете в комнату и обнаруживаете решетку, которая ведет в канализацию. Чтобы создать что-то полезное вы решаете использовать имеющиеся у вас железную заточку, веревку и рукоятку. Необходимо определить, что изготовить - самодельный топор или самодельную кирку.
               Список
               Самодельный топор Хорош для всех рубящих ударов
               Самодельная кирка Хорошо подходит для копания шахт'''
    },
    "chap_24_1": {
        "text": '''Вы изготовили кирку и принимаетесь ломать решетку. Однако, сразу после первого удара веревка, держащая железную затычку, рвется. Вы быстро связываете концы веревок и изготавливаете топор.\n
                Продолжить ломать решетку?''',
        "tts": '''Вы изготовили кирку и принимаетесь ломать решетку. Однако, сразу после первого удара веревка, держащая железную затычку, рвется. Вы быстро связываете концы веревок и изготавливаете топор. Продолжить ломать решетку?'''
    },
    "chap_24_2": {
        "text": '''Изготовленный топор отлично подойдет для разрушения решетки.\n
                Начать ломать решетку?''',
        "tts": '''Изготовленный топор отлично подойдет для разрушения решетки. Начать ломать решетку?'''
    },
    "chap_25": {
        "text": '''Вы начинаете бить решетку самодельным топором, звук постепенно усиливается. После нескольких ударов прутья решетки ломаются, вы их загибаете и пролезаете в канализационный тоннель.\n
                Звук ломающейся решетки привлек внимание охраны, и вы услышали звук сирены. Стоит ли бежать из города?''',
        "tts": '''Вы начинаете бить решетку самодельным топором, звук постепенно усиливается. После нескольких ударов прутья решетки ломаются, вы их загибаете и пролезаете в канализационный тоннель. Звук ломающейся решетки привлек внимание охраны, и вы услышали звук сирены. Стоит ли бежать из города?'''
    },
    "chap_25_1": {
        "text": '''Вы вылезаете из канализации и бежите к воротам города, но они оказываются тщательно запертыми.\n
                Подождать пока ворота откроют или попробовать сломать замок самодельным топором?''',
        "tts": '''Вы вылезаете из канализации и бежите к воротам города, но они оказываются тщательно запертыми. Подождать пока ворота откроют или попробовать сломать замок самодельным топором?'''
    },
    "chap_25_2": {
        "text": '''Вы решаете остаться в городе, но из-за вашей формы заключенного вас замечает житель и сообщает полиции. Вас задерживают и осуждают на казнь.\n
                Хотите ли вы загрузить последнее сохранение?''',
        "tts": '''Вы решаете остаться в городе, но из-за вашей формы заключенного вас замечает житель и сообщает полиции. Вас задерживают и осуждают на казнь. Хотите ли вы загрузить последнее сохранение?'''
    },
    "chap_25_1_1": {
        "text": '''Вы начинаете ломать замок своим самодельным топором, но вас замечает полиция и приговаривает к казни.\n
                Загрузить последнее сохранение?''',
        "tts": '''Вы начинаете ломать замок своим самодельным топором, но вас замечает полиция и приговаривает к казни. Загрузить последнее сохранение?'''
    },
    "chap_25_1_2": {
        "text": '''Вы прячетесь в кустах. Внезапно ворота открываются и в город заезжает какой-то разбойник. Это ваш шанс сбежать. Вы быстро выходите из кустов и убегаете из города в неизвестном направлении.\n
                Сохранить игру?''',
        "tts": '''Вы прячетесь в кустах. Внезапно ворота открываются и в город заезжает какой-то разбойник. Это ваш шанс сбежать. Вы быстро выходите из кустов и убегаете из города в неизвестном направлении. Сохранить игру?'''
    }
}
