from config import *
from dialogs import message_sent, d_start_0
from help_dialogs import message_help, confirm_reject_handler

version = "1.0"


def start(event, context):
    command = event['request']['command']
    intent = event["request"]['nlu']["intents"]
    user_id = event["session"]["user"]["user_id"]
    if command == "":
        if COLLECTION.count_documents({"id": user_id}) == 0:
            user = {
                "id": user_id,
                "name": "default",
                "save": "",
                "health": 6,
                "power": 2,
                "mana": 0,
                "inventory": {},
                "other": {"trader": False, }
            }
            COLLECTION.insert_one(user)
            text = 'Добро пожаловать в Сагу Битв и Приключений. Чтобы пройти обучение скажи "Пройти обучение", если ты готов скажи "Начать"'
            tts = 'Добро пожаловать в Сагу Битв и Приключений. Чтобы пройти обучение скажи "Пройти обучение", если ты готов скажи "Начать"'
            return d_start_0(text, tts, version)
        elif COLLECTION.find_one({"id": user_id})["save"] == "":
            text = "Добро пожаловать в Сагу Битв и Приключений. Ты готов начать?"
            tts = "Добро пожаловать в Сагу Битв и Приключений. Ты готов начать?"
            return d_start_0(text, tts, version)
        else:
            text = "Рады тебя снова видеть в Саге Битв и Приключений. Ты готов продолжить?"
            tts = "Рады тебя снова видеть в Саге Битв и Приключений. Ты готов продолжить?"
            save = COLLECTION.find_one({"id": user_id})["save"]
            return message_sent(text=text, tts=tts, version=version, save=save)
    elif command == "выход":
        text = 'Удачи!!'
        tts = 'Удачи!!'
        save = ""
        return message_sent(text, tts, version, save, end_session=True)
    else:
        req_save = {
            "save": event["state"]["session"]["save"],
            "name": event["state"]["session"]["name"],
            "health": event["state"]["session"]["health"],
            "power": event["state"]["session"]["power"],
            "mana": event["state"]["session"]["mana"],
            "score": event["state"]["session"]["score"],
            "inventory": event["state"]["session"]["inventory"],
            "other": event["state"]["session"]["other"],
        }
        if req_save["save"] == "start":
            return start_1(req_save, command, intent)

        elif req_save["save"] == "start_1":
            return start_2(req_save, command, intent)

        elif req_save["save"] == "start_2":
            return start_3(req_save, command, intent)

        elif req_save["save"] == "start_3" or req_save["save"] == "start_3_1":
            return chap(req_save, command, intent)

        elif req_save["save"] == "chap":
            return chap_1(req_save, command, intent)

        elif req_save["save"] == "chap_1" or req_save["save"] == "chap_1_1":
            return chap_2(req_save, command, intent)

        elif req_save["save"] == "chap_2":
            return chap_3(req_save, command, intent)

        elif req_save["save"] == "chap_3":
            return chap_4(req_save, command, intent)

        elif req_save["save"] == "chap_4_1":
            return chap_4_1_1(req_save, command, intent)

        elif req_save["save"] == "chap_4_1_1":
            return chap_4_1_x(req_save, command, intent)

        elif req_save["save"] == "chap_4_1_2" or req_save["save"] == "chap_4_1_4" or req_save["save"] == "chap_4_1_7":
            return chap_5(req_save, command, intent)

        elif req_save["save"] == "chap_4_1_3":
            return chap_4_1_3_x(req_save, command, intent)

        elif req_save["save"] == "chap_4_2":
            return chap_4_2_1(req_save, command, intent)

        elif req_save["save"] == "chap_5" or req_save == "chap_4_2_1":
            return chap_5_1(req_save, command, intent)

        else:
            return message_sent(text="чо", tts="чо", version=version, save=req_save)


def start_1(req_save, command, intent):
    COMMANDS = ['начать', 'вперед']
    text = 'В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли. Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений. Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?'
    tts = 'В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли. Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений. Сегодня вам нужно пойти торговать на рынке.'
    new_save = {'accept': 'start_1', 'reject': ''}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save)


def start_2(req_save, command, intent):
    COMMANDS = ['пойти на рынок', 'отправиться на рынок', 'рынок', 'пошли']
    text = 'Но однажды, когда вы были на рынке, чтобы продать свой урожай, вы стали свидетелем ограбления. Вы попытались остановить преступников, но они сбежали. На следующий день к вам приходит полиция и обвиняет вас в ограблении. Проследовать за полицией или попробовать сбежать?'
    tts = 'Но однажды, когда вы были на рынке, чтобы продать свой урожай, вы стали свидетелем ограбления. Вы попытались остановить преступников, но они сбежали. На следующий день к вам приходит полиция и обвиняет вас в ограблении. Проследовать за полицией или попробовать сбежать?'
    new_save = {'accept': 'start_2', 'reject': ''}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save)


def start_3(req_save, command, intent):
    COMMANDS = ['пойти с полицией', 'полиция', 'пойти', 'проследовать', 'полицией', 'пройти', 'пошли', 'иду']
    COMMANDS_REJECT = ['сбежать', 'убежать', 'бег', 'побег']

    text = 'Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу. Мотать срок?'
    tts = 'Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу. Мотать срок?'
    text_REJECT = 'Вас догоняет один из полицейских и заламывает руки. Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу. Вы потеряли 1 единицу здоровья Мотать срок?'
    tts_REJECT = "Вас догоняет один из полицейских и заламывает руки. Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу. Вы потеряли 1 единицу здоровья Мотать срок?"
    new_save = {'accept': 'start_3', 'reject': 'start_3_1'}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save, reject_enable=True, reject_commands=COMMANDS_REJECT,
                                  text_reject=text_REJECT, tts_reject=tts_REJECT)


def chap(req_save, command, intent):
    COMMANDS = ['мотать срок', 'мотать', 'срок', 'продолжи']
    text = 'В тюрьме вы понимаете, что жизнь здесь не так проста, как казалась. Вы оказываетесь среди преступников, которые ненавидят вас и считают "мелким фермером". Они издеваются над вами, отбирают еду и уважают только тех, кто сильнее и жестче. Здоровье: 6/10 Сила: 2 Мана: 0 Для того, чтобы сделать свой досуг более интересным, выберите, чем заняться: спортом или отдыхом в виде сна.'
    tts = 'В тюрьме вы понимаете, что жизнь здесь не так проста, как казалась. Вы оказываетесь среди преступников, которые ненавидят вас и считают "мелким фермером". Они издеваются над вами, отбирают еду и уважают только тех, кто сильнее и жестче. Здоровье: 6 из 10 sil <[200]> Сила: 2 sil <[200]> Мана: 0 sil <[200]> Для того, чтобы сделать свой досуг более интересным, выберите, чем заняться: спортом или отдыхом в виде сна.'
    new_save = {'accept': 'chap', 'reject': ''}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save)


def chap_1(req_save, command, intent):
    COMMANDS = ['спорт']
    COMMANDS_1 = ['спать']

    text = 'Среди различных вариантов занятий, доступных вам в тюрьме, вы решили заняться спортом. Здоровье: 6/10 Сила: 4 Мана: 0 Продолжить мотать срок?'
    tts = 'Среди различных вариантов занятий, доступных вам в тюрьме, вы решили заняться спортом. Здоровье: 6/10 Сила: 4 Мана: 0 Продолжить мотать срок?'

    text_1 = 'Вы были вынуждены приспосабливаться к жизни за решеткой, но вы были слишком измучены, чтобы сосредоточиться на чем-то другом, кроме как на сне. Здоровье: 10/10 Сила: 2 Мана: 0 Продолжить мотать срок?'
    tts_1 = 'Вы были вынуждены приспосабливаться к жизни за решеткой, но вы были слишком измучены, чтобы сосредоточиться на чем-то другом, кроме как на сне. Здоровье: 10/10 Сила: 2 Мана: 0 Продолжить мотать срок?'
    if command in COMMANDS:
        req_save["power"] = 4
        req_save["save"] = "chap_1"
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_1:
        req_save["health"] = 10
        req_save["save"] = "chap_1_1"
        return message_sent(text=text_1, tts=tts_1, save=req_save, version=version)
    else:
        return message_help(req_save, version)


def chap_2(req_save, command, intent):
    COMMANDS = ['мотать срок', 'мотать', 'срок', 'продолжи']
    text = 'Наступает день выбора работы. Вам достается работа в мастерской. Начать работать?'
    tts = 'Наступает день выбора работы. Вам достается работа в мастерской. Начать работать?'
    new_save = {'accept': 'chap_2', 'reject': ''}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save)


def chap_3(req_save, command, intent):
    COMMANDS = ['']
    COMMANDS_REJECT = ['']

    text = 'Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам: "Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?" Соврать или отказаться?'
    tts = 'Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам: "Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?" Соврать или отказаться?'
    text_REJECT = 'Вас толкает начальник и грозит посадить в карцер, вы отправляетесь на работу Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам: "Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?" Соврать или отказаться?'
    tts_REJECT = 'Вас толкает начальник и грозит посадить в карцер, вы отправляетесь на работу Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам: "Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?" Соврать или отказаться?'
    new_save = {'accept': 'chap_3', 'reject': 'chap_3'}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save, reject_enable=True, reject_commands=COMMANDS_REJECT,
                                  text_reject=text_REJECT, tts_reject=tts_REJECT)


def chap_4(req_save, command, intent):
    COMMANDS_TRUE = ['отказаться']
    COMMANDS_LIE = ['солгать']
    if command in COMMANDS_TRUE:
        req_save["save"] = "chap_4_1"
        text = 'Преступник: "Ты думаешь, что можешь отказаться от меня? Я сделаю твою жизнь адом, если ты не будешь слушаться меня". Преступник уходит. Вы ошеломлены произошедшим, закончить работать?'
        tts = 'Преступник: "Ты думаешь, что можешь отказаться от меня? Я сделаю твою жизнь адом, если ты не будешь слушаться меня". Преступник уходит. Вы ошеломлены произошедшим, закончить работать?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_LIE:
        req_save["health"] -= 2
        req_save["save"] = "chap_4_2"
        text = 'Вы решаете соврать и согласиться с предложением преступника. Преступник резко поднялся со стула и подошел к вам, ухмыляясь. Вы попытались отойти назад, но он настиг вас и ударил рукой. Минус 2 единицы здоровья. Преступник: "Ты думал, что я не пойму, что ты врешь, мелкий? Я тебя здесь научу говорить правду, это первое и последнее предупреждение". Преступник уходит. Вы ошеломлены произошедшим, закончить работать?'
        tts = 'Вы решаете соврать и согласиться с предложением преступника. Преступник резко поднялся со стула и подошел к вам, ухмыляясь. Вы попытались отойти назад, но он настиг вас и ударил рукой. Минус 2 единицы здоровья. Преступник: "Ты думал, что я не пойму, что ты врешь, мелкий? Я тебя здесь научу говорить правду, это первое и последнее предупреждение". Преступник уходит. Вы ошеломлены произошедшим, закончить работать?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help(req_save, version)


def chap_4_1_1(req_save, command, intent):
    COMMANDS = ['']
    text = 'После тяжелого дня работы в мастерской вы чувствуете сильную усталость и решаете вернуться в свою камеру для отдыха. Вы открываете дверь своей камеры и видите, что там уже находятся двое заключенных, один из которых был тот преступник, которому вы отказали в помощи. Вы понимаете, что они настроены решительно и не будут договариваться с вами. Что лучше сделать: "Ударить заключенного", "Убежать", "Закричать"'
    tts = 'После тяжелого дня работы в мастерской вы чувствуете сильную усталость и решаете вернуться в свою камеру для отдыха. Вы открываете дверь своей камеры и видите, что там уже находятся двое заключенных, один из которых был тот преступник, которому вы отказали в помощи. Вы понимаете, что они настроены решительно и не будут договариваться с вами. Что лучше сделать: "Ударить заключенного", "Убежать", "Закричать"'
    new_save = {'accept': 'chap_4_1_1', 'reject': ''}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save)


def chap_4_1_x(req_save, command, intent):
    COMMANDS_RUN = ['убежать']
    COMMANDS_HIT = ['ударить']
    COMMANDS_SHOUT = ['закричать']
    if command in COMMANDS_RUN:
        req_save["save"] = "chap_4_1_2"
        req_save["health"] -= 1
        text = 'Вы резко поворачиваетесь, чтобы убежать, но один из заключенных быстро подбегает к вам и хватает за руку. Вы пытаетесь вырваться, но он удерживает вас и начинает толкать к стене. Вы чувствуете удар в голову, и все исчезает перед глазами. Минус 1 единица здоровья. Очнуться?'
        tts = 'Вы резко поворачиваетесь, чтобы убежать, но один из заключенных быстро подбегает к вам и хватает за руку. Вы пытаетесь вырваться, но он удерживает вас и начинает толкать к стене. Вы чувствуете удар в голову, и все исчезает перед глазами. Минус 1 единица здоровья. Очнуться?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_SHOUT:
        req_save["save"] = "chap_4_1_4"
        req_save["health"] -= 3
        text = 'Вы попытаетесь закричать, чтобы привлечь внимание охранников, но один из заключенных быстро закрывает вам рот. Вы начинаете чувствовать себя задыхающимся и беспомощным, пытаясь освободиться от его хватки. Другой заключенный в это время начинает обыскивать ваши карманы и забирает все ценности. Вы теряете сознание. Минус 3 единицы здоровья. Очнуться?'
        tts = 'Вы попытаетесь закричать, чтобы привлечь внимание охранников, но один из заключенных быстро закрывает вам рот. Вы начинаете чувствовать себя задыхающимся и беспомощным, пытаясь освободиться от его хватки. Другой заключенный в это время начинает обыскивать ваши карманы и забирает все ценности. Вы теряете сознание. Минус 3 единицы здоровья. Очнуться?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_HIT:
        if req_save["power"] == 4:  # Поменять на показатель здоровья / силы
            req_save["save"] = "chap_4_1_3"
            text = 'Ваши занятия спортом не прошли даром: вы бьете одного заключенного, тот сразу же теряет сознание. Другой преступник, увидев это, убегает. Вы думаете, что нужно сделать с заключенным, находящимся в отключке. Теперь что-то нужно сделать с заключенным: "Оставить в камере", "Позвать охрану", "Убрать в соседнюю камеру"'
            tts = 'Ваши занятия спортом не прошли даром: вы бьете одного заключенного, тот сразу же теряет сознание. Другой преступник, увидев это, убегает. Вы думаете, что нужно сделать с заключенным, находящимся в отключке. Теперь что-то нужно сделать с заключенным: "Оставить в камере", "Позвать охрану", "Убрать в соседнюю камеру"'
            return message_sent(text=text, tts=tts, save=req_save, version=version)
        else:
            req_save["save"] = "chap_4_1_7"
            req_save["health"] -= 2
            text = '''
            Вы чувствуете, что вам нужно защитить себя и быстро делаете решительный шаг, пытаясь ударить преступника, 
            которому отказали в помощи. Однако он быстро увернулся, и вы промахнулись, 
            потеряв при этом равновесие и ударившись головой. Вы теряете сознание. 
            Минус 2 единицы здоровья. Очнуться?
            '''
            tts = "Вы чувствуете, что вам нужно защитить себя и быстро делаете решительный шаг, пытаясь ударить преступника, которому отказали в помощи. Однако он быстро увернулся, и вы промахнулись, потеряв при этом равновесие и ударившись головой. Вы теряете сознание. Минус 2 единицы здоровья. Очнуться?"
            return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help(req_save, version)


def chap_4_2_1(req_save, command, intent):
    COMMANDS = ['']
    text = 'После тяжелого дня работы в мастерской вы чувствуете сильную усталость. Вы направляетесь на перекличку, а затем решаете вернуться в свою камеру, чтобы отдохнуть. Лечь спать?'
    tts = 'После тяжелого дня работы в мастерской вы чувствуете сильную усталость. Вы направляетесь на перекличку, а затем решаете вернуться в свою камеру, чтобы отдохнуть. Лечь спать?'
    new_save = {'accept': 'chap_5_1', 'reject': 'chap_5_1'}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save)


def chap_4_1_3_x(req_save, command, intent):
    COMMANDS_1 = ['охрана']
    COMMANDS_2 = ['оставить']
    COMMANDS_3 = ['убрать']
    if command in COMMANDS_1:
        req_save["save"] = "chap_4_1_3_1"
        text = 'Вы зовете охрану. Вас обвиняют в нападении на заключенного, и теперь вы находитесь в карцере. Начать сначала?'
        tts = 'Вы зовете охрану. Вас обвиняют в нападении на заключенного, и теперь вы находитесь в карцере. Начать сначала?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_2:
        req_save["save"] = "chap_4_1_3_2"
        text = 'Мимо вашей камеры проходит охранник, увидев лежачего заключенного, вас обвиняют в нападении, теперь вы находитесь в карцере. Начать сначала?'
        tts = 'Мимо вашей камеры проходит охранник, увидев лежачего заключенного, вас обвиняют в нападении, теперь вы находитесь в карцере. Начать сначала?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_3:
        req_save["save"] = "chap_4_1_3_3"
        text = 'Вы осматриваетесь вокруг и не замечаете охранников, решаете перенести заключенного в другую камеру. Но когда вы выходите на перекличку, надзиратели находят одного из заключенных без сознания и обвиняют владельца камеры в нападении на него. Вам нужно восстановить силы. Лечь спать?'
        tts = 'Вы осматриваетесь вокруг и не замечаете охранников, решаете перенести заключенного в другую камеру. Но когда вы выходите на перекличку, надзиратели находят одного из заключенных без сознания и обвиняют владельца камеры в нападении на него. Вам нужно восстановить силы. Лечь спать?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help(req_save, version)


def chap_5(req_save, command, intent):
    COMMANDS = ['очнуться']
    if command in COMMANDS:
        req_save["save"] = "chap_5"
        text = 'Когда вы приходите в сознание, вы лежите на полу в своей камере. Вам кажется, что прошло несколько часов, но вы не уверены. Вы пытаетесь подняться, но чувствуете резкую боль в голове и ощущение тошноты. Открыв глаза, вы замечаете, что на вашем лице красуется синяк, а на ваших руках видны следы ударов. Вам нужно восстановить силы. Лечь спать?'
        tts = 'Когда вы приходите в сознание, вы лежите на полу в своей камере. Вам кажется, что прошло несколько часов, но вы не уверены. Вы пытаетесь подняться, но чувствуете резкую боль в голове и ощущение тошноты. Открыв глаза, вы замечаете, что на вашем лице красуется синяк, а на ваших руках видны следы ударов. Вам нужно восстановить силы. Лечь спать?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help("chap_4_1_0", version)


def chap_5_1(req_save, command, intent):
    COMMANDS = ['спать']
    if command in COMMANDS:
        req_save["save"] = "chap_5_1"
        text = 'В течение следующих дней вы стараетесь держаться подальше от других заключенных, опасаясь повторной атаки. Вы также продолжаете работать и складывать деньги в своей камере. Мотать срок.'
        tts = 'В течение следующих дней вы стараетесь держаться подальше от других заключенных, опасаясь повторной атаки. Вы также продолжаете работать и складывать деньги в своей камере. Мотать срок.'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help(req_save, version)


def chap_6(req_save, command, intent):  # Без сохранения
    COMMANDS = ['']
    text = 'Однажды, работая в мастерской, вы слышите крик заключенного из соседней камеры. Что думаете, стоит ли посмотреть?'
    tts = 'Однажды, работая в мастерской, вы слышите крик заключенного из соседней камеры. Что думаете, стоит ли посмотреть?'
    new_save = {'accept': 'chap_6', 'reject': ''}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save)


def chap_6_x(req_save, command, intent):  # Без сохранения
    COMMANDS_1 = ['посмотреть']
    COMMANDS_2 = ['продолжить']
    if command in COMMANDS_1:
        req_save["save"] = "chap_6_1"
        text = 'Вы решили посмотреть, что происходит в соседней камере, и замечаете, что двое других заключенных избивают третьего. Помочь или продолжить работать?'
        tts = 'Вы решили посмотреть, что происходит в соседней камере, и замечаете, что двое других заключенных избивают третьего. Помочь или продолжить работать?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_2:
        req_save["save"] = "chap_6_2"
        text = 'Вы продолжаете работать, но крик усиливается. Помочь или продолжить работать?'
        tts = 'Вы продолжаете работать, но крик усиливается. Помочь или продолжить работать?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help(req_save, version)


def chap_6_0_x(req_save, command, intent):  # Без сохранения
    COMMANDS_1 = ['помочь']
    COMMANDS_2 = ['продолжить работать', 'работать']
    if command in COMMANDS_1:
        req_save["save"] = 'chap_6_0'
        req_save["other"]["trader"] = True
        text = "Решив, что нельзя оставлять человека в опасности вы отправились в мастерскую и взяв тяжелый предмет вернулись в его камеру. Пригрозив нападавшим вы заставили их отойти от заключенного. Они бросаются к выходу, и вы оказываетесь наедине с заключенным, которого они избивали." \
               "Оказалось, что он был торговцем, который тайно занимался торговлей внутри тюрьмы. Он благодарит вас за помощь и говорит, что готов оказать вам любую услугу, если вы будете когда-нибудь в чем-то нуждаться." \
               "Продолжить мотать срок?"
        tts = "Решив, что нельзя оставлять человека в опасности вы отправились в мастерскую и взяв тяжелый предмет вернулись в его камеру. Пригрозив нападавшим вы заставили их отойти от заключенного. Они бросаются к выходу, и вы оказываетесь наедине с заключенным, которого они избивали." \
              "Оказалось, что он был торговцем, который тайно занимался торговлей внутри тюрьмы. Он благодарит вас за помощь и говорит, что готов оказать вам любую услугу, если вы будете когда-нибудь в чем-то нуждаться." \
              "Продолжить мотать срок?"
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_2:
        req_save["save"] = 'chap_6_0_1'
        text = "Вы решаете продолжить работу. Крик прекращается, и, оглянувшись назад, вы видите, как надзиратель уводит двух заключенных, а за ними на носилках несут третьего." \
               "Продолжить мотать срок?"
        tts = "Вы решаете продолжить работу. Крик прекращается, и, оглянувшись назад, вы видите, как надзиратель уводит двух заключенных, а за ними на носилках несут третьего." \
              "Продолжить мотать срок?"
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help(req_save, version)


def chap_7(req_save, command, intent):
    COMMANDS = ['продолжить мотать']
    text = 'В течение следующих месяцев ничего интересного не происходило, однако однажды во время обеда заключенные начали избивать другого заключенного.' \
           'Помочь заключенному?'
    tts = 'В течение следующих месяцев ничего интересного не происходило, однако однажды во время обеда заключенные начали избивать другого заключенного.' \
          'Помочь заключенному?'
    new_save = {'accept': 'chap_7', 'reject': ''}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save)


def chap_7_x(req_save, command, intent):
    COMMANDS_TRUE = ['помочь']
    COMMANDS_FALSE = ['продолжить смотреть']
    if command in COMMANDS_TRUE:
        if req_save["health"] > 3:
            req_save["save"] = "chap_7_1"
            text = 'Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.' \
                   'Вы теряете 3 единицы здоровья.' \
                   'Отправиться в лазарет?'
            tts = 'Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.' \
                  'Вы теряете 3 единицы здоровья.' \
                  'Отправиться в лазарет?'
            return message_sent(text=text, tts=tts, save=req_save, version=version)
        else:
            req_save["save"] = "chap_7_2"
            text = "Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас." \
                   "Вы теряете 3 единицы здоровья и погибаете." \
                   "Начать сначала?"
            tts = "Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас." \
                  "Вы теряете 3 единицы здоровья и погибаете." \
                  "Начать сначала?"
            return message_sent(text=text, tts=tts, save=req_save, version=version)
    elif command in COMMANDS_FALSE:
        req_save["save"] = "chap_7_3"
        text = "Вы не вмешиваетесь в драку, но появились надзиратели, которые посчитали, что вы являетесь соучастником, и отправили вас в карцер." \
               "Начать сначала?"
        tts = "Вы не вмешиваетесь в драку, но появились надзиратели, которые посчитали, что вы являетесь соучастником, и отправили вас в карцер." \
              "Начать сначала?"
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help(req_save, version)


def chap_7_end(req_save, command, intent):
    COMMANDS_TRUE = ['начать сначала']
    if command in COMMANDS_TRUE:
        req_save["save"] = 'start_1'
        text = 'В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли.' \
               'Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений.' \
               'Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?'
        tts = 'В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли.' \
              'Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений.' \
              'Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?'
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help("chap_7_0", version)


def chap_8(req_save, command, intent):
    # СОХРАНЕНИЕ
    COMMANDS = ['отправиться в лазарет']
    COMMANDS_REJECT = ['']
    text = 'После того, как заключенные начали бить вас, надзиратели немедленно вмешались и разогнали драку. Они отвели вас в лазарет, где вам была оказана необходимая медицинская помощь.' \
           'Вы чувствовали себя очень плохо и были обескуражены произошедшим. Вы понимали, что вмешательство в драку было ошибкой, и теперь вам придется отвечать за последствия своих действий.' \
           'Сохранение игры... Прогресс сохранен.' \
           'Желаете продолжить?'
    tts = 'После того, как заключенные начали бить вас, надзиратели немедленно вмешались и разогнали драку. Они отвели вас в лазарет, где вам была оказана необходимая медицинская помощь.' \
          'Вы чувствовали себя очень плохо и были обескуражены произошедшим. Вы понимали, что вмешательство в драку было ошибкой, и теперь вам придется отвечать за последствия своих действий.' \
          'Сохранение игры... Прогресс сохранен.' \
          'Желаете продолжить?'
    text_REJECT = 'В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли.' \
                  'Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений.' \
                  'Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?'
    tts_REJECT = 'В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли.' \
                 'Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений.' \
                 'Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?'
    new_save = {'accept': 'chap_8', 'reject': 'start_1'}
    return confirm_reject_handler(req_save, command, intent, text_commands=COMMANDS, text=text, tts=tts,
                                  new_save=new_save, reject_enable=True, reject_commands=COMMANDS_REJECT,
                                  text_reject=text_REJECT, tts_reject=tts_REJECT)

def chap_9(req_save,command,intent):
    COMMANDS_TRUE=['продолжить']
    if command in COMMANDS_TRUE:
        req_save["save"] = 'chap_9'
        text = "Через некоторое время вас выписывают из лазарета, и вы отправляетесь обратно в свою камеру, но замечаете, что заработанные вами деньги пропали." \
               "Опечаленный, вы садитесь на койку и не понимаете, что делать дальше. Вдруг в камеру заходит заключенный, садиться напротив вас и говорит: 'Спасибо за то, что вмешался в драку. Можешь ли ты сказать мне свое имя?'"
        tts = "Через некоторое время вас выписывают из лазарета, и вы отправляетесь обратно в свою камеру, но замечаете, что заработанные вами деньги пропали." \
               "Опечаленный, вы садитесь на койку и не понимаете, что делать дальше. Вдруг в камеру заходит заключенный, садиться напротив вас и говорит: 'Спасибо за то, что вмешался в драку. Можешь ли ты сказать мне свое имя?'"
        return message_sent(text=text, tts=tts, save=req_save, version=version)
    else:
        return message_help(req_save, version)
