Quest_tips = {
    "quest": {
        "text": '''Вы жаждите новых приключений и отправляетесь в темный лес рядом с убежищем. Начать квест?''',
        "tts": '''Вы жаждите новых приключений и отправляетесь в темный лес рядом с убежищем. Начать квест?''',
        "buttons": [
            {
                "title": 'Да',
                "hide": True
            },
            {
                "title": 'Нет',
                "hide": True
            }
        ]
    },
    "quest_2": {
        "text": '''Вы замечаете следы животных и слышите какие-то звуки. Для продолжения вы можете сбавить темп, сказав "Сбавить темп" или продолжить идти.''',
        "tts": '''Вы замечаете следы животных и слышите какие-то звуки. Для продолжения вы можете сбавить темп, сказав "Сбавить темп" или продолжить идти.''',
        "buttons": [
            {
                "title": 'Сбавить темп',
                "hide": True
            },
            {
                "title": 'Продолжить идти',
                "hide": True
            }
        ]
    },
    "quest_3": {
        "text": '''Вы натыкаетесь на ловушку и осознаёте, что в этом лесу вы не одни. Продолжить идти или деактивировать ловушку?''',
        "tts": '''Вы натыкаетесь на ловушку и осознаёте, что в этом лесу вы не одни. Продолжить идти или деактивировать ловушку?''',
        "buttons": [
            {
                "title": 'Деактивировать ловушку',
                "hide": True
            },
            {
                "title": 'Продолжить идти',
                "hide": True
            }
        ]
    },
    "quest_4_1x": {
        "text": '''Вы попали в ловушку. Звать на помощь или попытаться выбраться?''',
        "tts": '''Вы попали в ловушку. Звать на помощь или попытаться выбраться?''',
        "buttons": [
            {
                "title": 'Звать на помощь',
                "hide": True
            },
            {
                "title": 'Попытаться выбраться',
                "hide": True
            }
        ]
    },
    "quest_4_x": {
        "text": '''Вы попали в ловушку. Звать на помощь или попытаться выбраться?''',
        "tts": '''Вы попали в ловушку. Звать на помощь или попытаться выбраться?''',
        "buttons": [
            {
                "title": 'Звать на помощь',
                "hide": True
            },
            {
                "title": 'Попытаться выбраться',
                "hide": True
            }
        ]
    },
    "quest_5_x": {
        "text": '''Вас тащат по земле, как мешок, и в один момент веревка рвется. Для продолжения скажите "Выбраться".''',
        "tts": '''Вас тащат по земле, как мешок, и в один момент веревка рвется. Для продолжения скажите "Выбраться".''',
        "buttons": [
            {
                "title": 'Выбраться',
                "hide": True
            }
        ]
    },
    "quest_5_1x": {
        "text": 'Вас тащат по земле, как мешок, и в один момент  веревка рвется. Для продолжения скажите "Выбраться".',
        "tts": 'Вас тащат по земле, как мешок, и в один момент  веревка рвется. Для продолжения скажите "Выбраться".',
        "buttons": [
            {
                "title": 'Выбраться',
                "hide": True
            }
        ]
    },
    "quest_6_x": {
        "text": 'Вы сумели распутаться. Для продолжения выберите куда нанести удар разбойнику: "По голове", "По ногам" или "По плечу"?',
        "tts": 'Вы сумели распутаться. Для продолжения выберите куда нанести удар разбойнику: "По голове", "По ногам" или "По плечу"?',
        "buttons": [
            {
                "title": 'По голове',
                "hide": True
            },
            {
                "title": 'По ногам',
                "hide": True
            },
            {
                "title": 'По плечу',
                "hide": True
            }
        ]
    },
    "quest_6_1x": {
        "text": 'Вы погибли. Для продолжения скажите "Загрузить последнее сохранение".',
        "tts": 'Вы погибли. Для продолжения скажите "Загрузить последнее сохранение".',
        "buttons": [
            {
                "title": 'Загрузить последнее сохранение',
                "hide": True
            }
        ]
    },
    "quest_7_x": {
        "text": 'Вы ликвидировали разбойника. Для продолжения вы можете просто обыскать разбойника, сказав "Обыскать разбойника" или "Обыскать и связать разбойника".',
        "tts": 'Вы ликвидировали разбойника. Для продолжения вы можете просто обыскать разбойника, сказав "Обыскать разбойника" или "Обыскать и связать разбойника".',
        "buttons": [
            {
                "title": 'Обыскать и связать разбойника',
                "hide": True
            },
            {
                "title": 'Обыскать разбойника',
                "hide": True
            }
        ]
    },
    "quest_7_1x": {
        "text": 'Вы не смогли ликвидировать разбойника. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts": 'Вы не смогли ликвидировать разбойника. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons": [
            {
                "title": 'Загрузить последнее сохранение',
                "hide": True
            }
        ]
    },
    "quest_8_1x": {
        "text": '''Вы туго связываете оставшуюся веревкой разбойника. Затем обыскиваете его и находите ржавый меч и карту.\n
                  Чтобы продолжить скажите: "Продолжить".''',
        "tts": '''Вы туго связываете оставшуюся веревкой разбойника. Затем обыскиваете его и находите ржавый меч и карту.\n
                 Чтобы продолжить скажите: "Продолжить".''',
        "buttons": [
            {
                "title": 'Продолжить',
                "hide": True
            }
        ]
    },
    "quest_8_x": {
        "text": 'Вы обыскиваете разбойника и находите ржавый меч и карту.  Чтобы продолжить скажите: "Продолжить".',
        "tts": 'Вы обыскиваете разбойника и находите ржавый меч и карту.  Чтобы продолжить скажите: "Продолжить".',
        "buttons": [
            {
                "title": 'Продолжить',
                "hide": True
            }
        ]
    },
    "quest_9": {
        "text": 'Вы успешно завершили квест. Для продолжения вернитесь в убежище, сказав "Вернуться в убежище".',
        "tts": 'Вы успешно завершили квест. Для продолжения вернитесь в убежище, сказав "Вернуться в убежище".',
        "buttons": [
            {
                "title": 'Вернуться в убежище',
                "hide": True
            }
        ]
    },

    "quest2": {
        "text": '''Чтобы развить магические способности, Гаврила посоветовал вам медитировать.\n
                  Начать квест?''',
        "tts": '''Чтобы развить магические способности, Гаврила посоветовал вам медитировать.
                 Начать квест?''',
        "buttons": [
            {
                "title": 'Начать квест',
                "hide": True
            }
        ]
    },
    "quest2_1": {
        "text": 'Вы помедитировали, но ничего не произошло. Чтобы продолжить скажите "Продолжить".',
        "tts": 'Вы помедитировали, но ничего не произошло. Чтобы продолжить скажите "Продолжить".',
        "buttons": [
            {
                "title": 'Продолжить',
                "hide": True
            }
        ]
    },
    "quest2_1_1": {
        "text": 'После медитации магические силы так и не появились. Для продолжения скажите "Вернуться в убежище".',
        "tts": 'После медитации магические силы так и не появились. Для продолжения скажите "Вернуться в убежище".',
        "buttons": [
            {
                "title": 'Вернуться в убежище',
                "hide": True
            }
        ]
    },
    "quest2_2": {
        "text": 'Гаврила рассказал вам о магической башне, которая, возможно, поможет вам получить магическую силу. Для продолжения скажите "Отправиться в Башню Магов".',
        "tts": 'Гаврила рассказал вам о магической башне, которая, возможно, поможет вам получить магическую силу. Для продолжения скажите "Отправиться в Башню Магов".',
        "buttons": [
            {
                "title": 'Отправиться в Башню Магов',
                "hide": True
            }
        ]
    },
    "quest2_3": {
        "text": 'Вы находитесь около Башни Магов, там вы видите Нечестивого. Для продолжения ответьте на вопрос: "Сразиться с Нечестивым?".',
        "tts": 'Вы находитесь около Башни Магов, там вы видите Нечестивого. Для продолжения ответьте на вопрос: "Сразиться с Нечестивым?".',
        "buttons": [
            {
                "title": 'Да',
                "hide": True
            },
            {
                "title": 'Нет',
                "hide": True
            }
        ]
    },
    "quest2_4_x": {
        "text": 'Пытаясь уйти вы привлекли внимания Нечестивого, который уже готовиться к бою. Для продолжения скажите "Начать битву".',
        "tts": 'Пытаясь уйти вы привлекли внимания Нечестивого, который уже готовиться к бою. Для продолжения скажите "Начать битву".',
        "buttons": [
            {
                "title": 'Начать битву',
                "hide": True
            }
        ]
    },
    "quest2_4_1x": {
        "text": 'Чтобы атаковать Нечестивого, скажите "Легкая атака" или "Тяжелая атака". Внимательно следите за своей выносливостью!',
        "tts": 'Чтобы атаковать Нечестивого, скажите "Легкая атака" или "Тяжелая атака". Внимательно следите за своей выносливостью!',
        "buttons": [
            {
                "title": 'Тяжелая атака',
                "hide": True
            },
            {
                "title": 'Легкая атака',
                "hide": True
            }
        ]
    },
    "quest2_5_x": {
        "text": 'Вы открываете дверь башни. Для продолжения скажите "Подняться по лестнице".',
        "tts": 'Вы открываете дверь башни. Для продолжения скажите "Подняться по лестнице".',
        "buttons": [
            {
                "title": 'Подняться по лестнице',
                "hide": True
            }
        ]
    },
    "quest2_5_1x": {
        "text": 'Нечестивый оказался сильнее вас, может в следующий раз повезет. Чтобы продолжить скажите "Загрузить последнее сохранение".',
        "tts": 'Нечестивый оказался сильнее вас, может в следующий раз повезет. Чтобы продолжить скажите "Загрузить последнее сохранение".',
        "buttons": [
            {
                "title": 'Загрузить последнее сохранение',
                "hide": True
            }
        ]
    },
    "quest2_6": {
        "text": 'Через несколько десятков минут подъема по башне, спотыкаясь и падая, вы добираетесь до вершины. Для продолжения скажите "Начать медитировать".',
        "tts": 'Через несколько десятков минут подъема по башне, спотыкаясь и падая, вы добираетесь до вершины. Для продолжения скажите "Начать медитировать".',
        "buttons": [
            {
                "title": 'Начать медитировать',
                "hide": True
            }
        ]
    },
    "quest2_7": {
        "text": 'Вы чувствуете магическую силу, пронизывающую ваше тело и осознаете, что она стала частью вас.  Чтобы продолжить, скажите "Продолжить".',
        "tts": 'Вы чувствуете магическую силу, пронизывающую ваше тело и осознаете, что она стала частью вас.  Чтобы продолжить, скажите "Продолжить".',
        "buttons": [
            {
                "title": 'Продолжить',
                "hide": True
            }
        ]
    },
    "quest2_8": {
        "text": 'Теперь в ваших венах течет магическая энергия, которую можно использовать для произнесения заклинаний. Для продолжения вернитесь в убежище, сказав "Вернуться в убежище".',
        "tts": 'Теперь в ваших венах течет магическая энергия, которую можно использовать для произнесения заклинаний. Для продолжения вернитесь в убежище, сказав "Вернуться в убежище".',
        "buttons": [
            {
                "title": 'Вернуться в убежище',
                "hide": True
            }
        ]
    }
}
