alice_dict = {
    "start_1": {
        "text": '''В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли.
Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений.
Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?''',
        "tts": '''В магическом мире, который окутан злом, люди выживают только за огромными стенами замков. Вокруг них бродят опасные монстры, готовые напасть на любого, кто попадется у них на пути. Однако, несмотря на опасности, внутри замков процветает жизнь, и люди делают все, чтобы защитить свои земли.
               Вы, герой нашего рассказа, жили на ферме, которую наследовали от своих предков. Ваша семья занималась земледелием и животноводством уже несколько поколений.
               Сегодня вам нужно пойти торговать на рынке. Пойти на рынок?''',
    },
    "start_2": {
        "text": '''На рынке, вы стали свидетелем ограбления. Вы попытались остановить преступников, но они сбежали. На следующий день к вам приходит полиция и обвиняет вас в ограблении.
Проследовать за полицией или попробовать сбежать?''',
        "tts": '''На рынке, вы стали свидетелем ограбления. Вы попытались остановить преступников, но они сбежали. На следующий день к вам приходит полиция и обвиняет вас в ограблении.
               Проследовать за полицией или попробовать сбежать?'''
    },
    "start_3_1": {
        "text": '''Вас догоняет один из полицейских и заламывает руки. Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу.
Вы потеряли 1 единицу здоровья
Мотать срок?''',
        "tts": '''Вас догоняет один из полицейских и заламывает руки. Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу.
               Вы потеряли 1 единицу здоровья
               Мотать срок?'''
    },
    "start_3": {
        "text": '''Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу.
Мотать срок?''',
        "tts": '''Вы были арестованы и обвинены в ограблении, хотя вы ничего не делали. Вас посадили в тюрьму, и началась ваша борьба за справедливость и свободу.
               Мотать срок?'''
    },
    "chap": {
        "text": '''В тюрьме вы оказываетесь среди преступников, которые презирают вас. Они унижают вас и уважают тех, кто унижает их.''',
        "text_footer": '''Для того, чтобы сделать свой досуг более интересным, выберите, чем заняться: спортом или отдыхом в виде сна.''',
        "tts": '''В тюрьме вы оказываетесь среди преступников, которые презирают вас. Они унижают вас и уважают тех, кто унижает их.
               Здоровье: 6
               Сила: 2
               Мана: 0
               Для того, чтобы сделать свой досуг более интересным, выберите, чем заняться: спортом или отдыхом в виде сна.'''

    },
    "chap_1": {
        "text": '''Среди различных вариантов занятий, доступных вам в тюрьме, вы решили заняться спортом.''',
        "text_footer": '''Продолжить мотать срок? ''',
        "tts": '''Среди различных вариантов занятий, доступных вам в тюрьме, вы решили заняться спортом.
               Здоровье: 6
               Сила: 4
               Мана: 0
               Продолжить мотать срок?''',

        "text_2": '''Среди разнообразных видов досуга, которые доступны вам в тюрьме, вы решили заняться спортом.''',
        "text_2_footer": '''Продолжить мотать срок?''',
        "tts_2": '''Среди разнообразных видов досуга, которые доступны вам в тюрьме, вы решили заняться спортом.
                Здоровье: 6
                Сила: 4
                Мана: 0
                Продолжить мотать срок?'''
    },
    "chap_1_1": {
        "text": '''Вы приспособились к тюремным условиям, но вы были слишком измучены, чтобы сосредоточиться на чем-то другом, кроме как на сне.  ''',
        "text_footer": '''Продолжить мотать срок?''',
        "tts": '''Вы приспособились к тюремным условиям, но вы были слишком измучены, чтобы сосредоточиться на чем-то другом, кроме как на сне.
               Здоровье: 10
               Сила: 2
               Мана: 0
               Продолжить мотать срок?''',

        "text_2": '''Вы приспособились к тюремным условиям, но вы были слишком измучены, чтобы сосредоточиться на чем-то другом, кроме как на сне. ''',
        "text_2_footer": '''Продолжить мотать срок?''',
        "tts_2": '''
        Вы приспособились к тюремным условиям, но вы были слишком измучены, чтобы сосредоточиться на чем-то другом, кроме как на сне.
        Здоровье: 10
        Сила: 2
        Мана: 0
        Продолжить мотать срок?
        '''
    },
    "chap_2": {
        "text": '''Наступает день выбора работы. Вам достается работа в мастерской.
Начать работать?''',
        "tts": '''Наступает день выбора работы. Вам достается работа в мастерской.
               Начать работать?'''
    },
    "chap_3": {
        "text": '''Вас толкает начальник и грозит посадить в карцер, вы отправляетесь на работу.
Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам:
"Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?"
Соврать или отказаться?''',
        "tts": '''Вас толкает начальник и грозит посадить в карцер, вы отправляетесь на работу.
               Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам:
               "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/970e3524-e45e-4211-bbd4-68bc6058a8a6.opus">"
               Соврать или отказаться?'''
    },
    "chap_3_1": {
        "text": '''Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам:
"Эй, ты, мелкий фермер! Ты здесь, чтобы работать и зарабатывать, или быть нашим рабом? Посмотри на этот нож. У меня есть свои способы получить, что я хочу, и ты можешь лишь повиноваться мне. Так что, будешь слушаться или тебе придется пожалеть о своем решении?"
Соврать или отказаться?''',
        "tts": '''Вы начинаете работу и слышите, как открывается дверь мастерской. Там оказывается какой-то заключенный, который обращается к вам:
               "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/970e3524-e45e-4211-bbd4-68bc6058a8a6.opus">"
               Соврать или отказаться?'''
    },
    "chap_4_1": {
        "text": '''Преступник: "Ты думаешь, что можешь отказаться от меня? Я сделаю твою жизнь адом, если ты не будешь слушаться меня".
Преступник уходит.
Вы ошеломлены произошедшим, закончить работать?''',
        "tts": '''Преступник: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/a581c2e3-4a46-44dd-9d5d-430a99dc85e1.opus">".
               Преступник уходит.
               Вы ошеломлены произошедшим, закончить работать?'''
    },
    "chap_4_1_1": {
        "text": '''После тяжелого дня работы в мастерской вы чувствуете сильную усталость и решаете вернуться в свою камеру для отдыха. Вы открываете дверь своей камеры и видите, что там уже находятся двое заключенных, один из которых был тот преступник, которому вы отказали в помощи.
Вы понимаете, что они настроены решительно и не будут договариваться с вами. Что лучше сделать: "Ударить заключенного", "Убежать",  "Закричать".''',
        "tts": '''После тяжелого дня работы в мастерской вы чувствуете сильную усталость и решаете вернуться в свою камеру для отдыха. Вы открываете дверь своей камеры и видите, что там уже находятся двое заключенных, один из которых был тот преступник, которому вы отказали в помощи.
               Вы понимаете, что они настроены решительно и не будут договариваться с вами. Что лучше сделать: "Ударить заключенного", "Убежать",  "Закричать".'''
    },
    "chap_4_1_2": {
        "text": '''Вы резко поворачиваетесь, чтобы убежать, но один из заключенных быстро подбегает к вам и хватает за руку. Вы пытаетесь вырваться, но он удерживает вас и начинает толкать к стене. Вы чувствуете удар в голову, и все исчезает перед глазами.
Минус 1 единица здоровья.
Очнуться?''',
        "tts": '''Вы резко поворачиваетесь, чтобы убежать, но один из заключенных быстро подбегает к вам и хватает за руку. Вы пытаетесь вырваться, но он удерживает вас и начинает толкать к стене. Вы чувствуете удар в голову, и все исчезает перед глазами.
               Минус 1 единица здоровья.
               Очнуться?'''
    },
    "chap_4_1_4": {
        "text": '''Вы попытаетесь закричать, чтобы привлечь внимание охранников, но один из заключенных быстро закрывает вам рот. Вы начинаете чувствовать себя задыхающимся и беспомощным, пытаясь освободиться от его хватки. Другой заключенный в это время начинает обыскивать ваши карманы и забирает все ценности. Вы теряете сознание.
Минус 3 единицы здоровья.
Очнуться?''',
        "tts": '''Вы попытаетесь закричать, чтобы привлечь внимание охранников, но один из заключенных быстро закрывает вам рот. Вы начинаете чувствовать себя задыхающимся и беспомощным, пытаясь освободиться от его хватки. Другой заключенный в это время начинает обыскивать ваши карманы и забирает все ценности. Вы теряете сознание.
               Минус 3 единицы здоровья.
               Очнуться?'''
    },
    "chap_4_1_3": {
        "text": '''Ваши занятия спортом не прошли даром: вы бьете одного заключенного, тот сразу же теряет сознание. Другой преступник, увидев это, убегает. Вы думаете, что нужно сделать с заключенным, находящимся в отключке.
Теперь что-то нужно сделать с заключенным: "Оставить в камере", "Позвать охрану", "Убрать в соседнюю камеру"''',
        "tts": '''Ваши занятия спортом не прошли даром: вы бьете одного заключенного, тот сразу же теряет сознание. Другой преступник, увидев это, убегает. Вы думаете, что нужно сделать с заключенным, находящимся в отключке.
               Теперь что-то нужно сделать с заключенным: "Оставить в камере", "Позвать охрану", "Убрать в соседнюю камеру"'''
    },
    "chap_4_1_3_1": {
        "text": '''Вы зовете охрану. Вас обвиняют в нападении на заключенного, и теперь вы находитесь в карцере.
Начать сначала?''',
        "tts": '''Вы зовете охрану. Вас обвиняют в нападении на заключенного, и теперь вы находитесь в карцере.
               Начать сначала?'''
    },
    "chap_4_1_3_2": {
        "text": '''Мимо вашей камеры проходит охранник, увидев лежачего заключенного, вас обвиняют в нападении, теперь вы находитесь в карцере.
Начать сначала?''',
        "tts": '''Мимо вашей камеры проходит охранник, увидев лежачего заключенного, вас обвиняют в нападении, теперь вы находитесь в карцере.
               Начать сначала?'''
    },
    "chap_4_1_3_3": {
        "text": '''Вы осматриваетесь вокруг и не замечаете охранников, решаете перенести заключенного в другую камеру. Но когда вы выходите на перекличку, надзиратели находят одного из заключенных без сознания и обвиняют владельца камеры в нападении на него.
Вам нужно восстановить силы. Лечь спать?''',
        "tts": '''Вы осматриваетесь вокруг и не замечаете охранников, решаете перенести заключенного в другую камеру. Но когда вы выходите на перекличку, надзиратели находят одного из заключенных без сознания и обвиняют владельца камеры в нападении на него.
               Вам нужно восстановить силы. Лечь спать?'''
    },
    "chap_4_1_7": {
        "text": '''Вы чувствуете, что вам нужно защитить себя и быстро делаете решительный шаг, пытаясь ударить преступника, которому отказали в помощи. Однако он быстро увернулся, и вы промахнулись, потеряв при этом равновесие и ударившись головой. Вы теряете сознание.
Минус 2 единицы здоровья.
Очнуться?''',
        "tts": '''Вы чувствуете, что вам нужно защитить себя и быстро делаете решительный шаг, пытаясь ударить преступника, которому отказали в помощи. Однако он быстро увернулся, и вы промахнулись, потеряв при этом равновесие и ударившись головой. Вы теряете сознание.
               Минус 2 единицы здоровья.
               Очнуться?'''
    },
    "chap_4_2": {
        "text": '''Вы решаете соврать и согласиться с предложением преступника.
Преступник резко поднялся со стула и подошел к вам, ухмыляясь. Вы попытались отойти назад, но он настиг вас и ударил рукой. Минус 2 единицы здоровья.
Преступник: "Ты думал, что я не пойму, что ты врешь, мелкий? Я тебя здесь научу говорить правду, это первое и последнее предупреждение".
Преступник уходит.
Вы ошеломлены произошедшим, закончить работать?''',
        "tts": '''Вы решаете соврать и согласиться с предложением преступника.
               Преступник резко поднялся со стула и подошел к вам, ухмыляясь. Вы попытались отойти назад, но он настиг вас и ударил рукой. Минус 2 единицы здоровья.
               Преступник: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/85ba63e6-7998-40f6-95f5-b6e60d7ab7ac.opus">".
               Преступник уходит.
               Вы ошеломлены произошедшим, закончить работать?'''
    },
    "chap_4_2_1": {
        "text": '''После тяжелого дня работы в мастерской вы чувствуете сильную усталость. Вы направляетесь на перекличку, а затем решаете вернуться в свою камеру, чтобы отдохнуть.
Лечь спать?''',
        "tts": '''После тяжелого дня работы в мастерской вы чувствуете сильную усталость. Вы направляетесь на перекличку, а затем решаете вернуться в свою камеру, чтобы отдохнуть.
               Лечь спать?'''
    },
    "chap_5": {
        "text": '''Когда вы приходите в сознание, вы лежите на полу в своей камере. Вам кажется, что прошло несколько часов, но вы не уверены. Вы пытаетесь подняться, но чувствуете резкую боль в голове и ощущение тошноты. Открыв глаза, вы замечаете, что на вашем лице красуется синяк, а на ваших руках видны следы ударов.
Вам нужно восстановить силы. Лечь спать?''',
        "tts": '''Когда вы приходите в сознание, вы лежите на полу в своей камере. Вам кажется, что прошло несколько часов, но вы не уверены. Вы пытаетесь подняться, но чувствуете резкую боль в голове и ощущение тошноты. Открыв глаза, вы замечаете, что на вашем лице красуется синяк, а на ваших руках видны следы ударов.
               Вам нужно восстановить силы. Лечь спать?'''
    },
    "chap_5_1": {
        "text": '''В течение следующих дней вы стараетесь держаться подальше от других заключенных, опасаясь повторной атаки. Вы также продолжаете работать и складывать деньги в своей камере.
Мотать срок.''',
        "tts": '''В течение следующих дней вы стараетесь держаться подальше от других заключенных, опасаясь повторной атаки. Вы также продолжаете работать и складывать деньги в своей камере.
               Мотать срок.'''
    },
    "chap_6": {
        "text": '''Однажды, работая в мастерской, вы слышите крик заключенного из соседней камеры.
Что думаете, стоит ли посмотреть?''',
        "tts": '''Однажды, работая в мастерской, вы слышите крик заключенного из соседней камеры.
               Что думаете, стоит ли посмотреть?'''
    },
    "chap_6_1": {
        "text": '''Вы решили посмотреть, что происходит в соседней камере, и замечаете, что двое других заключенных избивают третьего.
Помочь или продолжить работать?''',
        "tts": '''Вы решили посмотреть, что происходит в соседней камере, и замечаете, что двое других заключенных избивают третьего.
               Помочь или продолжить работать?'''
    },
    "chap_6_2": {
        "text": '''Вы продолжаете работать, но крик усиливается.
Помочь или продолжить работать?''',
        "tts": '''Вы продолжаете работать, но крик усиливается.
               Помочь или продолжить работать?'''
    },
    "chap_6_0": {
        "text": '''Решив, что нельзя оставлять человека в опасности вы отправились в мастерскую и взяв тяжелый предмет вернулись в его камеру. Пригрозив нападавшим вы заставили их отойти от заключенного. Они бросаются к выходу, и вы оказываетесь наедине с заключенным, которого они избивали.
Оказалось, что он был торговцем, который тайно занимался торговлей внутри тюрьмы. Он благодарит вас за помощь и говорит, что готов оказать вам любую услугу, если вы будете когда-нибудь в чем-то нуждаться.
Продолжить мотать срок?''',
        "tts": '''Решив, что нельзя оставлять человека в опасности вы отправились в мастерскую и взяв тяжелый предмет вернулись в его камеру. Пригрозив нападавшим вы заставили их отойти от заключенного. Они бросаются к выходу, и вы оказываетесь наедине с заключенным, которого они избивали.
               Оказалось, что он был торговцем, который тайно занимался торговлей внутри тюрьмы. Он благодарит вас за помощь и говорит, что готов оказать вам любую услугу, если вы будете когда-нибудь в чем-то нуждаться.
               Продолжить мотать срок?'''
    },
    "chap_6_0_1": {
        "text": '''Вы решаете продолжить работу. Крик прекращается, и, оглянувшись назад, вы видите, как надзиратель уводит двух заключенных, а за ними на носилках несут третьего.
Продолжить мотать срок?''',
        "tts": '''Вы решаете продолжить работу. Крик прекращается, и, оглянувшись назад, вы видите, как надзиратель уводит двух заключенных, а за ними на носилках несут третьего.
               Продолжить мотать срок?'''
    },
    "chap_7": {
        "text": '''В течение следующих месяцев ничего интересного не происходило, однако однажды во время обеда заключенные начали избивать другого заключенного.
Помочь заключенному?''',
        "tts": '''В течение следующих месяцев ничего интересного не происходило, однако однажды во время обеда заключенные начали избивать другого заключенного.
               Помочь заключенному?'''
    },
    "chap_7_1": {
        "text": '''Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.
Вы теряете 3 единицы здоровья.
Отправиться в лазарет?''',
        "tts": '''Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.
               Вы теряете 3 единицы здоровья.
               Отправиться в лазарет?'''
    },
    "chap_7_1_1": {
        "text": '''Из-за вашего решения не обратиться в лазарет вы погибли.
Начать сначала?''',
        "tts": '''Из-за вашего решения не обратиться в лазарет вы погибли.
               Начать сначала?'''
    },
    "chap_7_2": {
        "text": '''Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.
Вы теряете 3 единицы здоровья и погибаете.
Начать сначала?''',
        "tts": '''Вы вмешались в драку, но это не привело к ничему хорошему, в результате заключенные начали бить и вас.
               Вы теряете 3 единицы здоровья и погибаете.
               Начать сначала?'''
    },
    "chap_7_3": {
        "text": '''Вы не вмешиваетесь в драку, но появились надзиратели, которые посчитали, что вы являетесь соучастником, и отправили вас в карцер.
Начать сначала?''',
        "tts": '''Вы не вмешиваетесь в драку, но появились надзиратели, которые посчитали, что вы являетесь соучастником, и отправили вас в карцер.
               Начать сначала?'''
    },
    "chap_7_end":{
        "text": '''Из-за вашего решения не обратиться в лазарет вы погибли.
Начать сначала?''',
        "tts": '''Из-за вашего решения не обратиться в лазарет вы погибли.
        Начать сначала?'''
    },
    "chap_8": {
        "text": '''После того, как заключенные начали бить вас, надзиратели немедленно вмешались и разогнали драку. Они отвели вас в лазарет, где вам была оказана необходимая медицинская помощь.
Вы чувствовали себя очень плохо и были обескуражены произошедшим. Вы понимали, что вмешательство в драку было ошибкой, и теперь вам придется отвечать за  последствия своих действий.
Сохранение игры... Прогресс сохранен.
Желаете продолжить?''',
        "tts": '''После того, как заключенные начали бить вас, надзиратели немедленно вмешались и разогнали драку. Они отвели вас в лазарет, где вам была оказана необходимая медицинская помощь.
               Вы чувствовали себя очень плохо и были обескуражены произошедшим. Вы понимали, что вмешательство в драку было ошибкой, и теперь вам придется отвечать за  последствия своих действий.
               Сохранение игры... Прогресс сохранен.
               Желаете продолжить?'''

    },
    "chap_9": {
        "text": '''Через некоторое время вас выписывают из лазарета, и вы отправляетесь обратно в свою камеру, но замечаете, что заработанные вами деньги пропали.
Опечаленный, вы садитесь на койку и не понимаете, что делать дальше. Вдруг в камеру заходит заключенный, садиться напротив вас и говорит: "Спасибо за то, что вмешался в драку. Можешь ли ты сказать мне свое имя?"''',
        "tts": '''Через некоторое время вас выписывают из лазарета, и вы отправляетесь обратно в свою камеру, но замечаете, что заработанные вами деньги пропали.
               Опечаленный, вы садитесь на койку и не понимаете, что делать дальше. Вдруг в камеру заходит заключенный, садиться напротив вас и говорит: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/10be9a65-539d-41a7-8a80-1db8f018ade4.opus">sil<5000>"'''
    },
    "chap_10": {
        "text": '''"Приятно познакомиться, ''' ,
        "text_1" : '''. Меня зовут Михаил. Я знаю, как мы можем выбраться отсюда", - говорит Михаил, глядя на вас загадочным взглядом.''',
        "tts": ''' "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/f08df250-84c3-48be-b6fd-dd838382b6fc.opus">", - говорит Михаил, глядя на вас загадочным взглядом.'''
    },
    "chap_10_1": {
        "text": '''"Ты помог мне, а я помогу тебе. Для начала тебе нужно принести мне рукоятку, железную заточку и веревку. С их помощью мы сможем сделать самодельную кирку. Когда найдешь все предметы, заходи ко мне в камеру. Мы начнем планировать побег".
Куда стоит пойти первым делом? В столовую или на работу.''',
        "tts": '''"<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/753bceb1-d70b-4893-b408-b71be0d05218.opus">".
               Куда стоит пойти первым делом? В столовую или на работу.'''
    },
    "chap_10_2": {
        "text": '''"Для начала тебе нужно принести мне рукоятку, железную заточку и веревку. С их помощью мы сможем сделать самодельную кирку. Когда найдешь все предметы, заходи ко мне в камеру. Мы начнем планировать побег".''',
        "tts": '''"<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/5c020ae6-0e02-4c31-bc5f-c1e6cb85db55.opus">".'''
    },
    "chap_11": {
        "text": '''Вы пришли в мастерскую.
Хотите осмотреться или сделать рукоятку?''',
        "tts": '''Вы пришли в мастерскую.
               Хотите осмотреться или сделать рукоятку?'''
    },
    "chap_11_1": {
        "text": '''Зайдя в столовую вы видите торговца, которому спасли жизнь.
Хотите подойти к нему''',
        "tts": '''Зайдя в столовую вы видите торговца, которому спасли жизнь. Хотите подойти к нему?'''
    },
    "chap_11_2": {
        "text": '''Вы подходите к заключенному, чтобы спросить про железную заточку. Заключенный отвечает: "Да, я могу продать тебе заточку." Если вы решите купить заточку, то вы потратите все свои деньги, но у вас нет другого выбора.
Вы готовы купить заточку?''',
        "tts": '''Вы подходите к заключенному, чтобы спросить про железную заточку. Заключенный отвечает: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/d4156a2f-1ba7-4f18-9f50-b1d1aac438a1.opus">" Если вы решите купить заточку, то вы потратите все свои деньги, но у вас нет другого выбора. Вы готовы купить заточку?'''
    },
    "chap_12": {
        "text": '''На токарном станке вы изготовили рукоять.
Осмотреться?''',
        "tts": '''На токарном станке вы изготовили рукоять. Осмотреться?'''
    },
    "chap_12_1": {
        "text": '''На полу вы заметили моток веревки. Вы взяли его с собой.
Начать делать рукоятку?''',
        "tts": '''На полу вы заметили моток веревки. Вы взяли его с собой. Начать делать рукоятку?'''
    },
    "chap_13": {
        "text": '''На полу вы заметили моток веревки. Вы взяли его с собой.''',
        "tts": '''На полу вы заметили моток веревки. Вы взяли его с собой.'''
    },
    "chap_13_1": {
        "text": '''На токарном станке вы изготовили рукоять.''',
        "tts": '''На токарном станке вы изготовили рукоять.'''
    },
    "chap_14": {
        "text": '''Вы спросили у торговца, сможет ли он достать железную заточку. Торговец ответил: "Конечно, это малая услуга для моего спасителя". Затем он отдал ее вам. Теперь осталось достать только веревку и рукоятку.
Хотите осмотреться или пойти на работу?''',
        "tts": '''Вы спросили у торговца, сможет ли он достать железную заточку. Торговец ответил: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/a6519c26-f09c-4ea7-812b-904e3655f586.opus">". Затем он отдал ее вам. Теперь осталось достать только веревку и рукоятку. Хотите осмотреться или пойти на работу?'''
    },
    "chap_11_2_1": {
        "text": '''Вы купили заточку. Теперь осталось достать только веревку и рукоятку.
Хотите осмотреться или пойти на работу?''',
        "tts": '''Вы купили заточку. Теперь осталось достать только веревку и рукоятку. Хотите осмотреться или пойти на работу?'''
    },
    "chap_15": {
        "text": '''Вы внимательно осмотрелись, но не заметили ничего ценного.
Отправиться на работу?''',
        "tts": '''Вы внимательно осмотрелись, но не заметили ничего ценного. Отправиться на работу?'''
    },
    "chap_16": {
        "text": '''Вы подходите к заключенному, чтобы спросить про железную заточку. Заключенный отвечает: "Да, я могу продать тебе заточку." Если вы решите купить заточку, то вы потратите все свои деньги, но у вас нет другого выбора.
Вы готовы купить заточку?''',
        "tts": '''Вы подходите к заключенному, чтобы спросить про железную заточку. Заключенный отвечает: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/d4156a2f-1ba7-4f18-9f50-b1d1aac438a1.opus">" Если вы решите купить заточку, то вы потратите все свои деньги, но у вас нет другого выбора. Вы готовы купить заточку?'''
    },
    "chap_17": {
        "text": '''Вы купили заточку.
Все предметы собраны. Отправляемся к Михаилу?''',
        "tts": '''Вы купили заточку. Все предметы собраны. Отправляемся к Михаилу?'''
    },
    "chap_13_3": {
        "text": '''Когда вы зашли в столовую, вы заметили торговца, которому вы спасли жизнь.
Хотите подойти к нему?''',
        "tts": '''Когда вы зашли в столовую, вы заметили торговца, которому вы спасли жизнь. Хотите подойти к нему?'''
    },
    "chap_13_4": {
        "text": '''Вы спросили у торговца, сможет ли он достать железную заточку. Торговец ответил: "Конечно, это малая услуга для моего спасителя". Затем он отдал ее вам.
Все предметы собраны. Отправляемся к Михаилу?''',
        "tts": '''Вы спросили у торговца, сможет ли он достать железную заточку. Торговец ответил: "<speaker audio="dialogs-upload/2207eea5-a6ce-4191-8eaa-57efd7095c19/a6519c26-f09c-4ea7-812b-904e3655f586.opus"> ". Затем он отдал ее вам. Все предметы собраны. Отправляемся к Михаилу?'''
    },
    "chap_18": {
        "text": '''Вы заходите в камеру к Михаилу и замечаете, что он лежит на полу без сознания.
Проверить пульс или убежать?''',
        "tts": '''Вы заходите в камеру к Михаилу и замечаете, что он лежит на полу без сознания. Проверить пульс или убежать?'''
    },
    "chap_18_1": {
        "text": '''Вы решаете проверить пульс у Михаила. Однако, пульс отсутствует, и вы осознаете, что Михаил умер.
Убежать или осмотреть комнату?''',
        "tts": '''Вы решаете проверить пульс у Михаила. Однако, пульс отсутствует, и вы осознаете, что Михаил умер. Убежать или осмотреть комнату?'''
    },
    "chap_18_2": {
        "text": '''Вы начинаете бежать, но спотыкаетесь и замечаете листок, лежащий под кроватью. Вы решаете взять его с собой. По прибытии в камеру вы обнаруживаете, что это план побега.
Пришло время для вечерней переклички. Что лучше - спрятать предметы под одежду или оставить их в камере?''',
        "tts": '''Вы начинаете бежать, но спотыкаетесь и замечаете листок, лежащий под кроватью. Вы решаете взять его с собой. По прибытии в камеру вы обнаруживаете, что это план побега.
               Пришло время для вечерней переклички. Что лучше - спрятать предметы под одежду или оставить их в камере?'''
    },
    "chap_19": {
        "text": '''Где наилучшим образом начать искать - в тумбочке, на полу или в кровати?''',
        "tts": '''Где наилучшим образом начать искать - в тумбочке, на полу или в кровати?'''
    },
    "chap_19_1": {
        "text": '''В тумбочке вы находите кошелек Михаила.
 Взять его с собой или продолжить искать на полу либо в кровати?''',
        "tts": '''В тумбочке вы находите кошелек Михаила. Взять его с собой или продолжить искать на полу либо в кровати?'''
    },
    "chap_19_2": {
        "text": '''На полу вы ничего не нашли.
Обыскать кровать?''',
        "tts": '''На полу вы ничего не нашли. Обыскать кровать?'''
    },
    "chap_19_3": {
        "text": '''Вы использовали железную заточку, чтобы разрезать матрас, и заметили там листок с чертежами.
Желаете вернуться в камеру?''',
        "tts": '''Вы использовали железную заточку, чтобы разрезать матрас, и заметили там листок с чертежами. Желаете вернуться в камеру?'''
    },
    "chap_19_1_1": {
        "text": '''Вы берете кошелек Михаила.
Где продолжить искать - на полу или в кровати?''',
        "tts": '''Вы берете кошелек Михаила. Где продолжить искать - на полу или в кровати?'''
    },
    "chap_20": {
        "text": '''После возвращения в камеру вы изучаете листок и осознаете, что это план побега.
Пришло время для вечерней переклички. Что лучше - спрятать предметы под одежду или оставить их в камере?''',
        "tts": '''После возвращения в камеру вы изучаете листок и осознаете, что это план побега. Пришло время для вечерней переклички. Что лучше - спрятать предметы под одежду или оставить их в камере?'''
    },
    "chap_21": {
        "text": '''Вы направляетесь на перекличку, но надзиратель замечает отсутствие Михаила. Это приводит к объявлению об обыске, после которого всех заключенных отводят обратно в камеры.
Перепрятать предметы?''',
        "tts": '''Вы направляетесь на перекличку, но надзиратель замечает отсутствие Михаила. Это приводит к объявлению об обыске, после которого всех заключенных отводят обратно в камеры. Перепрятать предметы?'''
    },
    "chap_21_1": {
        "text": '''Вы начинаете прятать предметы, но охранник замечает вас и вы отправляетесь в карцер.
Загрузить последнее сохранение?''',
        "tts": '''Вы начинаете прятать предметы, но охранник замечает вас и вы отправляетесь в карцер. Загрузить последнее сохранение?'''
    },
    "chap_21_2": {
        "text": '''Охранник мчится мимо вашей камеры, и тревога заканчивается. Вы замечаете, как Михаила уносят на носилках куда-то.
Вы ошеломлены произошедшим, хотите лечь спать?''',
        "tts": '''Охранник мчится мимо вашей камеры, и тревога заканчивается. Вы замечаете, как Михаила уносят на носилках куда-то. Вы ошеломлены произошедшим, хотите лечь спать?'''
    },
    "chap_22": {
        "text": '''Вы не выспались и бодрствовали всю ночь из-за кошмаров. Однако, вы понимаете, что это ваш последний день в тюрьме, и принимаете решение сбежать сегодня.
Начать побег сейчас или во время обеда?''',
        "tts": '''Вы не выспались и бодрствовали всю ночь из-за кошмаров. Однако, вы понимаете, что это ваш последний день в тюрьме, и принимаете решение сбежать сегодня. Начать побег сейчас или во время обеда?'''
    },
    "chap_22_1": {
        "text": '''В обеденное время вы отправляетесь к месту, указанному на плане. К вашему удивлению, вы обнаруживаете, что тайная комната, вырытая Михаилом, находится в самом заметном месте, за картиной.
Войти в комнату?''',
        "tts": '''В обеденное время вы отправляетесь к месту, указанному на плане. К вашему удивлению, вы обнаруживаете, что тайная комната, вырытая Михаилом, находится в самом заметном месте, за картиной. Войти в комнату?'''
    },
    "chap_22_2": {
        "text": '''Просматривая план побега, вы понимаете, что тайная комната, прорытая Михаилом, находится за картиной, которая выставлена на самом видном месте. Вы приходите к месту входа в комнату.
Осмотреться или войти в комнату?''',
        "tts": '''Просматривая план побега, вы понимаете, что тайная комната, прорытая Михаилом, находится за картиной, которая выставлена на самом видном месте. Вы приходите к месту входа в комнату. Осмотреться или войти в комнату?'''
    },
    "chap_23": {
        "text": '''Вы осматриваетесь и не замечаете охранников.
Войти в комнату или вернуться в обед?''',
        "tts": '''Вы осматриваетесь и не замечаете охранников. Войти в комнату или вернуться в обед?'''
    },
    "chap_23_1": {
        "text": '''В обеденное время вы вернулись к месту, указанному на плане.
Войти в комнату?''',
        "tts": '''В обеденное время вы вернулись к месту, указанному на плане. Войти в комнату?'''
    },
    "chap_23_2": {
        "text": '''Вы решаете отодвинуть картину, но к сожалению, охранник замечает вас и сажает в карцер.
Загрузить последнее сохранение?''',
        "tts": '''Вы решаете отодвинуть картину, но к сожалению, охранник замечает вас и сажает в карцер. Загрузить последнее сохранение?'''
    },
    "chap_24": {
        "text": '''Вы заходите в комнату и находите решетку в канализацию. Используя железную заточку, веревку и рукоятку, создаете инструмент.''',
        "tts": '''Вы заходите в комнату и находите решетку в канализацию. Используя железную заточку, веревку и рукоятку, создаете инструмент.
               Список
               Самодельный топор Хорош для всех рубящих ударов
               Самодельная кирка Хорошо подходит для копания шахт
                Необходимо определить, что изготовить - самодельный топор или самодельную кирку
               '''
    },
    "chap_24_1": {
        "text": '''Вы изготовили кирку и принимаетесь ломать решетку. Однако, сразу после первого удара веревка, держащая железную затычку, рвется. Вы быстро связываете концы веревок и изготавливаете топор.
Продолжить ломать решетку?''',
        "tts": '''Вы изготовили кирку и принимаетесь ломать решетку. Однако, сразу после первого удара веревка, держащая железную затычку, рвется. Вы быстро связываете концы веревок и изготавливаете топор. Продолжить ломать решетку?'''
    },
    "chap_24_2": {
        "text": '''Изготовленный топор отлично подойдет для разрушения решетки.
Начать ломать решетку?''',
        "tts": '''Изготовленный топор отлично подойдет для разрушения решетки. Начать ломать решетку?'''
    },
    "chap_25": {
        "text": '''Вы начинаете бить решетку самодельным топором, звук постепенно усиливается. После нескольких ударов прутья решетки ломаются, вы их загибаете и пролезаете в канализационный тоннель.
Звук ломающейся решетки привлек внимание охраны, и вы услышали звук сирены. Стоит ли бежать из города?''',
        "tts": '''Вы начинаете бить решетку самодельным топором, звук постепенно усиливается. После нескольких ударов прутья решетки ломаются, вы их загибаете и пролезаете в канализационный тоннель. Звук ломающейся решетки привлек внимание охраны, и вы услышали звук сирены. Стоит ли бежать из города?'''
    },
    "chap_25_1": {
        "text": '''Вы вылезаете из канализации и бежите к воротам города, но они оказываются тщательно запертыми.
Подождать пока ворота откроют или попробовать сломать замок самодельным топором?''',
        "tts": '''Вы вылезаете из канализации и бежите к воротам города, но они оказываются тщательно запертыми. Подождать пока ворота откроют или попробовать сломать замок самодельным топором?'''
    },
    "chap_25_2": {
        "text": '''Вы решаете остаться в городе, но из-за вашей формы заключенного вас замечает житель и сообщает полиции. Вас задерживают и осуждают на казнь.
Хотите ли вы загрузить последнее сохранение?''',
        "tts": '''Вы решаете остаться в городе, но из-за вашей формы заключенного вас замечает житель и сообщает полиции. Вас задерживают и осуждают на казнь. Хотите ли вы загрузить последнее сохранение?'''
    },
    "chap_25_1_1": {
        "text": '''Вы начинаете ломать замок своим самодельным топором, но вас замечает полиция и приговаривает к казни.
Загрузить последнее сохранение?''',
        "tts": '''Вы начинаете ломать замок своим самодельным топором, но вас замечает полиция и приговаривает к казни. Загрузить последнее сохранение?'''
    },
    "chap_25_1_2": {
        "text": '''Вы прячетесь в кустах. Внезапно ворота открываются и в город заезжает какой-то разбойник. Это ваш шанс сбежать. Вы быстро выходите из кустов и убегаете из города в неизвестном направлении.
Сохранить игру?''',
        "tts": '''Вы прячетесь в кустах. Внезапно ворота открываются и в город заезжает какой-то разбойник. Это ваш шанс сбежать. Вы быстро выходите из кустов и убегаете из города в неизвестном направлении. Сохранить игру?'''
    },
    "2_chap":{
        "text":'''Добро пожаловать во вторую главу "Приключения только начинаются!".
Неизвестно, сколько часов вы уже бежите.
Хотите остановиться?''',
        "tts":'''Добро пожаловать во вторую главу "Приключения только начинаются!". Неизвестно, сколько часов вы уже бежите. Хотите остановиться?'''

        },
    "2_chap_1_1x":{
        "text":'''Вы продолжили бежать, но запнулись об сучек и упали в грязь лицом.
Похоже, что за вами никто не гонится, и вы находитесь в безопасности.
Для просмотра своих характеристик, скажите "Осмотреть себя".''',
        "tts":'''Вы продолжили бежать, но запнулись об суч+ёк и упали в грязь лицом.
                 Похоже, что за вами никто не гонится, и вы находитесь в безопасности.
                 Для просмотра своих характеристик, скажите "Осмотреть себя".'''
        },
    "2_chap_1_x":{
        "text":'''Похоже, что за вами никто не гонится, и вы находитесь в безопасности.
Для просмотра своих характеристик, скажите "Осмотреть себя".''',
        "tts":'''Похоже, что за вами никто не гонится, и вы находитесь в безопасности.
                 Для просмотра своих характеристик, скажите "Осмотреть себя".'''
        },
    "2_chap_2":{
        "text":'''Дорога потрепала вас, маленькие веточки и кусты порезали вашу кожу. Вам нужно срочно укрыться.''',
        "tts":'''Вы ели д+ержитесь на ногах. Ваша кожа порезана от маленьких кустов и веток, которые встречались на вашем пути. Вам срочно нужно какое-то убежище.
                 Список
                 Здоровье: 7
                 Сила: 4
                 Мана: 0
                 Перед вами 3 неизвестных дороги. Куда решите пойти: "Вперед", "Влево", "Вправо".'''
        },
    "2_chap_3_1x":{
        "text":'''Вы идете по дороге и вдруг слышите, как хрустит ветка. Похоже, что кто-то наблюдает за вами.
Хотите осмотреться или продолжить идти?''',
        "tts":'''Вы идете по дороге и вдруг слышите, как хрустит ветка. Похоже, что кто-то наблюдает за вами.
                 Хотите осмотреться или продолжить идти?'''
        },
    "2_chap_3_1_1x":{
        "text":'''Вы продолжаете идти по дороге, но вдруг кто-то резко нападает на вас. У вас не хватает сил, чтобы отбиться, и вы погибаете.
Хотите загрузить последнее сохранение?''',
        "tts":'''Вы продолжаете идти по дороге, но вдруг кто-то резко нападает на вас. У вас не хватает сил, чтобы отбиться, и вы погибаете.
                 Хотите загрузить последнее сохранение?'''
        },
    "2_chap_3_1_2x":{
        "text":'''Вы оборачиваетесь, чтобы посмотреть, кто это был, но вдруг кто-то резко нападает на вас. У вас не хватает сил, чтобы отбиться.
Желаете загрузить последнее сохранение?''',
        "tts":'''Вы оборачиваетесь, чтобы посмотреть, кто это был, но вдруг кто-то резко нападает на вас. У вас не хватает сил, чтобы отбиться.
                 Желаете загрузить последнее сохранение?'''
        },
    "2_chap_3_2x":{
        "text":'''Вы идете по заболоченной местности и замечаете перед собой какое-то неопознанное существо. Неизвестный монстр напоминает огромного, покрытого чешуей ящера, с темными глазами и острыми когтями.
Хотите сразиться с монстром или аккуратно пройти мимо?''',
        "tts":'''Вы идете по заболоченной местности и замечаете перед собой какое-то неопознанное существо. Неизвестный монстр напоминает огромного, покрытого чешуей ящера, с темными глазами и острыми когтями.
                 Хотите сразиться с монстром или аккуратно пройти мимо?'''
        },
    "2_chap_3_2_1x":{
        "text":'''Вы принимаете решение сразиться с монстром.
Чтобы выбрать оружие, скажите Взять "Предмет". Чтобы посмотреть, какие предметы у вас есть, скажите "Открыть инвентарь".''',
        "tts":'''Вы принимаете решение сразиться с монстром.
                 Чтобы выбрать оружие, скажите Взять "Предмет". Чтобы посмотреть, какие предметы у вас есть, скажите "Открыть инвентарь".'''
        },
    "2_chap_3_2_1_1":{
        "text":'''Чтобы взять предмет скажите взять "Название предмета".''',
        "tts":'''Чтобы взять предмет скажите взять "Название предмета".
                 Список: Самодельный топор: Хорош для всех рубящих ударов.'''
        },
    "2_chap_3_2_1_2":{
        "text":'''Вы берете топор в руки и направляетесь на ящера, но тот одним мощным движением хвоста кидает вас в дерево.
Вы теряете 5 единиц здоровья.
Притвориться мертвым или продолжить нападать?''',
        "tts":'''Вы берете топор в руки и направляетесь на ящера, но тот одним мощным движением хвоста кидает вас в дерево.
                 Вы теряете 5 единиц здоровья. Притвориться мертвым или продолжить нападать?'''
        },
    "2_chap_3_2_1_2_1x":{
        "text":'''Огромный ящер бьет вас лапой, и вы погибаете.
Загрузить последнее сохранение?''',
        "tts":'''Огромный ящер бьет вас лапой, и вы погибаете. Загрузить последнее сохранение?'''
        },
    "2_chap_3_2_1_2_x":{
        "text":'''Вы притворяетесь мертвым, ящер медленно подходит к вам, внимательно обнюхивает, затем разворачивается и уходит.
Продолжить лежать неподвижно или встать и пойти дальше?''',
        "tts":'''Вы притворяетесь мертвым, ящер медленно подходит к вам, внимательно обнюхивает, затем разворачивается и уходит.
                 Продолжить лежать неподвижно или встать и пойти дальше?'''
        },
    "2_chap_3_2_1_2_1":{
        "text":'''Лежа на земле, вы не замечаете ничего необычного вокруг.
Хотите встать и продолжить путь дальше?''',
        "tts":'''Лежа на земле, вы не замечаете ничего необычного вокруг.
                 Хотите встать и продолжить путь дальше?'''
        },
    "2_chap_3_2_1_2_2":{
        "text":'''Вы поднимаетесь и продолжаете путь дальше, но  чувствуете себя обессиленным и двигаетесь с трудом.
Лечь спать и восстановить силы или продолжить идти?''',
        "tts":'''Вы поднимаетесь и продолжаете путь дальше, но  чувствуете себя обессиленным и двигаетесь с трудом.
                 Лечь спать и восстановить силы или продолжить идти?'''
        },
    "2_Chap_3_2_1_2_2_1x":{
        "text":'''Вы не смогли пережить эту ночь.
Загрузить последнее сохранение?''',
        "tts":'''Вы не смогли пережить эту ночь.
                 Загрузить последнее сохранение?'''
        },
    "2_chap_3_2_1_2_2_x":{
        "text":'''Из-за бессилия вы потеряли сознание.
Очнуться?''',
        "tts":'''Из-за бессилия вы потеряли сознание.
                 Очнуться?'''
        },
    "2_chap_3_0":{
        "text":'''Вы просыпаетесь на земле, ощущая слабость и головную боль. Вокруг вас все выглядит странным и незнакомым. Вскоре вы слышите голос старика, который приближается к вам.
"Ну вот, наконец-то ты проснулся," говорит старик. "Меня зовут Гаврил. Ты, кажется, потерял сознание, и я нашел тебя здесь. Как ты себя чувствуешь?"
Вы с трудом поднимаете голову и пытаетесь оглядеться. Гаврил смотрит на вас с интересом.
Встать и познакомиться с Гаврилом?''',
        "tts":'''Вы просыпаетесь на земле, ощущая слабость и головную боль. Вокруг вас все выглядит странным и незнакомым. Вскоре вы слышите голос старика, который приближается к вам.
                 <speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/31fb3a51-d8d8-4aca-949f-ca18f93ddde2.opus">
                 Вы с трудом поднимаете голову и пытаетесь оглядеться. Гаврил смотрит на вас с интересом.
                 Встать и познакомиться с Гаврилом?'''
        },
    "2_chap_3_2_x":{
        "text":'''Обойдя монстра, вы видите реку и шлюпку, привязанную к берегу.
Спустить шлюпку на воду?''',
        "tts":'''Обойдя монстра, вы видите реку и шлюпку, привязанную к берегу.
                 Спустить шлюпку на воду?'''
        },
    "2_chap_3_2_2":{
        "text":'''Вы спускаете шлюпку на воду, садитесь в нее и отправляетесь по течению реки.
Обыскать шлюпку или лечь спать?''',
        "tts":'''Вы спускаете шлюпку на воду, садитесь в нее и отправляетесь по течению реки.
                 Обыскать шлюпку или лечь спать?'''
        },
    "2_chap_3_2_2_2_1_0":{
        "text":'''Вы проснулись от громкого шума. Шлюпка столкнулась с упавшим деревом.
Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".''',
        "tts":'''Вы проснулись от громкого шума. Шлюпка столкнулась с упавшим деревом.
                 Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".'''
        },
    "2_chap_3_2_2_2":{
        "text":'''При обыске шлюпки вы находите небольшой запас провизии, а именно - буханку хлеба и солонку соли.
Лечь спать или перекусить?''',
        "tts":'''При обыске шлюпки вы находите небольшой запас провизии, а именно - буханку хлеба и солонку соли.
                 Лечь спать или перекусить?'''
        },
    "2_chap_3_2_2_2_1":{
        "text":'''Вы кушаете хлеб с солью и внимательно следите за окружающими событиями. Вдруг замечаете, что впереди падает дерево.
Выпрыгнуть или остаться в шлюпке?''',
        "tts":'''Вы кушаете хлеб с солью и внимательно следите за окружающими событиями. Вдруг замечаете, что впереди падает дерево.
                 Выпрыгнуть или остаться в шлюпке?'''
        },
    "2_chap_3_2_2_2_1_x":{
        "text":'''Впереди шлюпки падает дерево. Шлюпка сталкивается с бревном.
Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".''',
        "tts":'''Впереди шлюпки падает дерево. Шлюпка сталкивается с бревном.
                 Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".'''
        },
    "2_chap_3_2_2_2_1_1x":{
        "text":'''Выпрыгивая со шлюпки, вы ударяетесь об сучек и теряете сознание. В следствии чего погибаете
Загрузить последнее сохранение?''',
        "tts":'''Выпрыгивая со шлюпки, вы ударяетесь об сучек и теряете сознание. В следствии чего погибаете
                 Загрузить последнее сохранение?'''
        },
    "2_chap_3_2_2_2_1_1":{
        "text":'''Чтобы взять предмет скажите взять "Название предмета".''',
        "tts":'''Чтобы взять предмет скажите взять "Название предмета".
                 Список: Самодельный топор: Хорош для всех рубящих ударов'''
        },
    "2_chap_3_2_2_2_1_2":{
        "text":'''Вырубив дерево топором, вы садитесь в лодку.
Желаете восстановить силы и лечь спать?''',
        "tts":'''Вырубив дерево топором, вы садитесь в лодку.
                 Желаете восстановить силы и лечь спать?'''
        },
    "2_chap_3_3x":{
        "text":'''Вы пробираетесь через тину и водоросли, идя по болоту, но внезапно начинаете тонуть.
Как лучше всего выбраться - резко или медленно?''',
        "tts":'''Вы пробираетесь через тину и водоросли, идя по болоту, но внезапно начинаете тонуть.
                 Как лучше всего выбраться - резко или медленно?'''
        },
    "2_chap_3_3_1x":{
        "text":'''Попытка выбраться резко привела к еще большему углублению в болото.
Желаете загрузить последнее сохранение?''',
        "tts":'''Попытка выбраться резко привела к еще большему углублению в болото.
                 Желаете загрузить последнее сохранение?'''
        },
    "2_chap_3_3_x":{
        "text":'''Вы медленно отходите назад в безопасное место.
Как лучше пересечь болото - поплыть на спине или использовать длинную палку для прощупывания дна?''',
        "tts":'''Вы медленно отходите назад в безопасное место.
                 Как лучше пересечь болото - поплыть на спине или использовать длинную палку для прощупывания дна?'''
        },
    "2_chap_3_3_1":{
        "text":'''Промокши, весь в грязи и тине вы пересекаете болото.
Продолжить идти дальше?''',
        "tts":'''Промокши, весь в грязи и тине вы пересекаете болото.
                 Продолжить идти дальше?'''
        },
    "2_chap_3_3_2":{
        "text":'''Пробираясь через лес вы видите огромную расщелину.
Сделать мост из дерева или попытаться допрыгнуть до другой стороны расщелины?''',
        "tts":'''Пробираясь через лес вы видите огромную расщелину.
                 Сделать мост из дерева или попытаться допрыгнуть до другой стороны расщелины?'''
        },
    "2_chap_3_3_2_1x":{
        "text":'''Разбежавшись, вы попытались перепрыгнуть через пропасть, но не долетели и разбились.
Загрузить последнее сохранение?''',
        "tts":'''Разбежавшись, вы попытались перепрыгнуть через пропасть, но не долетели и разбились.
                 Загрузить последнее сохранение?'''
        },
    "2_chap_3_3_2_x":{
        "text":'''Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".''',
        "tts":'''Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".'''
        },
    "2_chap_3_3_2_1":{
        "text":'''Чтобы взять предмет скажите взять "Название предмета"''',
        "tts":'''Чтобы взять предмет скажите взять "Название предмета"
                 Список: Самодельный топор: Хорош для всех рубящих ударов'''
        },
    "2_chap_3_3_2_2":{
        "text":'''Вы срубили дерево, и оно упало на расщелину с громким шумом, создавая импровизированный мост.
Вы готовы отправиться по нему?''',
        "tts":'''Вы срубили дерево, и оно упало на расщелину с громким шумом, создавая импровизированный мост.
                 Вы готовы отправиться по нему?'''
        },
    "2_chap_3_3_2_2_1x":{
        "text":'''На шум сбежались монстры.
Загрузить последнее сохранение?''',
        "tts":'''На шум сбежались монстры.
                 Загрузить последнее сохранение?'''
        },
    "2_chap_3_3_2_2_x":{
        "text":'''Когда вы добрались до другого конца расщелины, на вас напал монстр, и вы покатились с обрыва.
Минус 4 единицы здоровья.
Очнуться?''',
        "tts":'''Когда вы добрались до другого конца расщелины, на вас напал монстр, и вы покатились с обрыва.
                 Минус 4 единицы здоровья.
                 Очнуться?'''
        },
    "2_chap_4":{
        "text":'''"Вижу, что ты крепкий малый. Мог бы ты помочь мне с небольшой проблемой? Я уже много лет живу в своей пещере за водопадом, но недавно пришли разбойники и выселили меня. С тех пор я вынужден жить на улице, и мне очень нужна твоя помощь, чтобы вернуть свою пещеру и имущество. В замен я предлагаю тебе жить у меня в пещере. Что скажешь?".
Выбора у вас нет, так же как и места, где можно было бы переночевать. Помочь Гаврилу?''',
        "tts":'''<speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/c3a6c4ac-0055-42d4-8bb3-3e45651fbb6b.opus">.
                  Выбора у вас нет, так же как и места, где можно было бы переночевать. Помочь Гаврилу?'''
        },
    "2_chap_5":{
        "text":'''"Отлично! Я знал, что на тебя можно положиться. Вижу, ты совсем не готов к битве", - сказал Гаврил, отодвигая булыжник и доставая потрепанные доспехи и потрескавшийся меч. "Мне эти доспехи уже не нужны, а тебе они точно понадобятся", - добавил он, передавая вам доспехи.
Чтобы проверить, какие предметы у вас есть в инвентаре, скажите "Открыть инвентарь".''',
        "tts":'''<speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/8581e195-6b37-4d04-aba1-c7372a6b0f5b.opus">, - сказал Гаврил, отодвигая булыжник и доставая потрепанные доспехи и потрескавшийся меч. <speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/36ca54c4-dd56-44c1-85ac-1246fa065540.opus">, - добавил он, передавая вам доспехи.
                 Чтобы проверить, какие предметы у вас есть в инвентаре, скажите "Открыть инвентарь".'''
        },
    "2_chap_6":{
        "text":'''Для экипировки брони скажите надеть "Название доспеха"''',
        "tts":'''Список:
                 Потрепанный шлем
                 Потрепанный нагрудник
                 Потрепанные поножи
                 Потрепанные ботинки
                 Самодельный топор:
                 Хорош для всех рубящих ударов
                 Потрескавшийся меч
                 Для экипировки брони скажите надеть "Название доспеха"'''
        },
    "2_chap_7":{
        "text": '''"Отлично выглядишь! Ты готов победить разбойников?".''',
        "tts": '''<speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/7c2c8e4e-fe82-4227-84c2-0130c0a38e79.opus">.'''
        },
    "2_chap_7_1":{
        "text":'''"Не волнуйся, я пойду с тобой и, если что, помогу. Готов отправляться?".''',
        "tts":'''<speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/2fe4058d-8cef-4ecc-b3c3-c7b4c18673fe.opus">.'''
        },
    "2_chap_7_2":{
        "text":'''Вы прибываете в логово Гаврила, где вас встречает один из разбойников, который сразу же нападает на вас!
Ваши характеристики:
Здоровье: число
Сила: число
Выносливость: 100
Характеристики разбойника:
Здоровье: 15
Сила: 5
У вас есть два варианта атаки: "Мощная" - она наносит больший урон, но требует много выносливости, и "Слабая" - она наносит меньший урон, но требует меньше выносливости. Чтобы восстановить свою выносливость, скажите "Отдохнуть".''',
        "tts":'''Вы прибываете в логово Гаврила, где вас встречает один из разбойников, который сразу же нападает на вас!
                 Ваши характеристики:
                 Здоровье: число
                 Сила: число
                 Выносливость: 100
                 Характеристики разбойника:
                 Здоровье: 15
                 Сила: 5
                 У вас есть два варианта атаки: "Мощная" - она наносит больший урон, но требует много выносливости, и "Слабая" - она наносит меньший урон, но требует меньше выносливости. Чтобы восстановить свою выносливость, скажите "Отдохнуть".'''
        },
    "2_chap_8":{
        "text":'''Разбойник атакует вас, но вы успеваете поставить блок. Однако ваш меч ломается, и вы получаете серьезный ущерб. Вы падаете на землю, но в этот момент Гаврила поднимает руку, и из ее ладони появляется светящийся шар, окруженный пламенем. Шар начинает вращаться быстрее, пока не превращается в огненный шар. Гаврила метает шар в сторону разбойника, который успевает лишь слабо увернуться, а шар врезается ему в плечо. Огненный шар прожигает броню разбойника и наносит ему значительный урон. Разбойник ощутил огненную боль и упал на землю, оставаясь без сознания.
Вы в шоке от происходящего. Остальные разбойники, увидев это, сразу же убежали. Расспросить Гаврилу?''',
        "tts":'''Разбойник атакует вас, но вы успеваете поставить блок. Однако ваш меч ломается, и вы получаете серьезный ущерб. Вы падаете на землю, но в этот момент Гаврила поднимает руку, и из ее ладони появляется светящийся шар, окруженный пламенем. Шар начинает вращаться быстрее, пока не превращается в огненный шар. Гаврила метает шар в сторону разбойника, который успевает лишь слабо увернуться, а шар врезается ему в плечо. Огненный шар прожигает броню разбойника и наносит ему значительный урон. Разбойник ощутил огненную боль и упал на землю, оставаясь без сознания.
                 Вы в шоке от происходящего. Остальные разбойники, увидев это, сразу же убежали. Расспросить Гаврилу?'''
        },
    "2_chap_9":{
        "text":'''"Спокойнее. Прежде всего, необходимо убраться здесь. Если хочешь узнать секреты магии, приступай к работе."''',
        "tts":'''<speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/6eee3e62-8106-408f-865c-63675fc4002e.opus">'''
        },
    "2_chap_10":{
        "text":'''Вы взяли в руки метлу и совок, чтобы приступить к уборке мусора, оставленного разбойниками. Вы тщательно просматривали каждый уголок, собирая обломки мебели в кучи. В это время, ваш компаньон Гаврила использовал свою магию, чтобы сжечь все обломки и устранить их следы.
Вы были настолько увлечены своей работой, что не заметили, как наступили сумерки. "Отличная работа! Не скучай, пока что без меня", - сказал Гаврила, и тут же исчез в магическом портале.
Лечь спать?''',
        "tts":'''Вы взяли в руки метлу и совок, чтобы приступить к уборке мусора, оставленного разбойниками. Вы тщательно просматривали каждый уголок, собирая обломки мебели в кучи. В это время, ваш компаньон Гаврила использовал свою магию, чтобы сжечь все обломки и устранить их следы.
                 Вы были настолько увлечены своей работой, что не заметили, как наступили сумерки. <speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/5d4db31e-9e32-4a4a-b421-7b56420627c6.opus">, - сказал Гаврила, и тут же исчез в магическом портале.
                 Лечь спать?'''
        },
    "2_chap_11":{
        "text":'''После всех приключений, наконец-то наступило время для спокойного и безопасного отдыха. Вы легли на пол и заснули. Во сне время пролетело быстро, и вы проснулись только около полудня.ЗВУК УРЧАНИЯ ЖИВОТА, похоже вы проголодались.
Здоровье: 10
Сила: 
Мана: 0''',
        "tts":'''После всех приключений, наконец-то наступило время для спокойного и безопасного отдыха. Вы легли на пол и заснули. Во сне время пролетело быстро, и вы проснулись только около полудня.ЗВУК УРЧАНИЯ ЖИВОТА, похоже вы проголодались.
                 Здоровье: 10
                 Сила:
                 Мана: 0'''
        },
    "2_chap_12":{
        "text":'''Когда вы вышли из пещеры через водопад, струи холодной воды оживили вас. Рядом с пещерой вы заметили водоем с рыбой и кусты с ягодами.''',
        "tts":'''Когда вы вышли из пещеры через водопад, струи холодной воды оживили вас. Рядом с пещерой вы заметили водоем с рыбой и кусты с ягодами.'''
        },
    "2_chap_13_1":{
        "text":'''После перекуса ягодами, вы вернулись в пещеру. Желаете осмотреться?''',
        "tts":'''После перекуса ягодами, вы вернулись в пещеру. Желаете осмотреться?'''
        },
    "2_chap_13_2":{
        "text":'''Когда вы подошли к водоему, вы ловко поймали рыбу руками. Пожарить ее?''',
        "tts":'''Когда вы подошли к водоему, вы ловко поймали рыбу руками. Пожарить ее?'''
        },
    "2_chap_13_2_2":{
        "text":'''Вы начинаете есть сырую рыбу, почувствовав себя подобно неандертальцу. После сырого обеда вы возвращаетесь в пещеру. Желаете осмотреться?''',
        "tts":'''Вы начинаете есть сырую рыбу, почувствовав себя подобно неандертальцу. После сырого обеда вы возвращаетесь в пещеру. Желаете осмотреться?'''
        },
    "2_chap_13_2_1":{
        "text":'''Звук разжигания костра. Вы находите в лесу хворост, разжигаете костер и жарите рыбу. После вкусного обеда вы возвращаетесь в пещеру. Хотите осмотреться?''',
        "tts":'''Звук разжигания костра. Вы находите в лесу хворост, разжигаете костер и жарите рыбу. После вкусного обеда вы возвращаетесь в пещеру. Хотите осмотреться?'''
        },
    "2_chap_14":{
        "text":'''Вы замечаете на одной из стен странные рисунки, напоминающие руны. Стряхнув пыль со стены, вы замечаете, что всю стену украшают руны. Вам кажется, что эта стена зовет вас. Желаете прикоснуться к ней?''',
        "tts":'''Вы замечаете на одной из стен странные рисунки, напоминающие руны. Стряхнув пыль со стены, вы замечаете, что всю стену украшают руны. Вам кажется, что эта стена зовет вас. Желаете прикоснуться к ней?'''
        },
    "2_chap_15_1x":{
        "text":'''Продолжая рассматривать стену, вы заметили, что руны на ней содержат символы огня, воды, земли и воздуха. Подуть на стену?''',
        "tts":'''Продолжая рассматривать стену, вы заметили, что руны на ней содержат символы огня, воды, земли и воздуха. Подуть на стену?'''
        },
    "2_chap_15_x":{
        "text":'''Прикоснувшись к стене, вы не ощутили никаких изменений. Рассмотрев руны, вы смогли распознать символы огня, воды, земли и воздуха. Хотите попробовать подуть на стену?''',
        "tts":'''Прикоснувшись к стене, вы не ощутили никаких изменений. Рассмотрев руны, вы смогли распознать символы огня, воды, земли и воздуха. Хотите попробовать подуть на стену?'''
        },
    "2_chap_15_x_1x":{
        "text":'''Вы решаете оставить стену в покое и ждать прибытия Гаврилы. Через час, скучая, вы решаете подуть на стену. Когда вы делаете это, символы воздуха вспыхивают ярко-желтым светом. Вы осознаете, что разбойники, возможно, приходили сюда по какой-то важной причине. Какую руну использовать далее - "Воды", "Земли" или "Огня"?''',
        "tts":'''Вы решаете оставить стену в покое и ждать прибытия Гаврилы. Через час, скучая, вы решаете подуть на стену. Когда вы делаете это, символы воздуха вспыхивают ярко-желтым светом. Вы осознаете, что разбойники, возможно, приходили сюда по какой-то важной причине. Какую руну использовать далее - "Воды", "Земли" или "Огня"?'''
        },
    "2_chap_15_x_x":{
        "text":'''Подув на стену, символы воздуха загорелись ярко-желтым светом. Вы понимаете, что разбойники пришли сюда не просто так. Какую руну использовать далее - "Воды", "Земли" или "Огня".''',
        "tts":'''Подув на стену, символы воздуха загорелись ярко-желтым светом. Вы понимаете, что разбойники пришли сюда не просто так. Какую руну использовать далее - "Воды", "Земли" или "Огня".'''
        },
    "2_chap_16_1x": {
        "text": '''Вы выбегаете из пещеры и набираете в ладони горсть земли. Затем возвращаетесь в пещеру и бросаете землю в стену. Стена начинает трястись, и зажигаются руны земли.''',
        "tts": '''Вы выбегаете из пещеры и набираете в ладони горсть земли. Затем возвращаетесь в пещеру и бросаете землю в стену. Стена начинает трястись, и зажигаются руны земли.''',

        "text1": '''Все руны загораются, но никаких изменений не происходит. Прикоснуться к стене?''',
        "tts1": '''Все руны загораются, но никаких изменений не происходит. Прикоснуться к стене?''',

        "text2": '''Зажжешь руну огня?''',
        "tts2": '''Зажжешь руну огня?''',

        "text3": '''Зажжешь руну воды?''',
        "tts3": '''Зажжешь руну воды?''',

        "text4": '''Вторая руна зажжена! Использовать "Воду" или "Огонь".''',
        "tts4": '''Вторая руна зажжена! Использовать "Воду" или "Огонь".'''
    },
    "2_chap_16_2x": {
        "text": '''Снимая шлем, вы набираете в него воды и проливаете на стену. Стена начинает трястись, и зажигаются руны воды.''',
        "tts": '''Снимая шлем, вы набираете в него воды и проливаете на стену. Стена начинает трястись, и зажигаются руны воды.''',

        "text1": '''Все руны загораются, но никаких изменений не происходит. Прикоснуться к стене?''',
        "tts1": '''Все руны загораются, но никаких изменений не происходит. Прикоснуться к стене?''',

        "text2": '''Зажжешь руну огня?''',
        "tts2": '''Зажжешь руну огня?''',

        "text3": '''Зажжешь руну земли?''',
        "tts3": '''Зажжешь руну земли?''',

        "text4": '''Вторая руна зажжена! Использовать "Землю" или "Огонь".''',
        "tts4": '''Вторая руна зажжена! Использовать "Землю" или "Огонь".'''
    },
    "2_chap_16_3x": {
        "text": '''Вы побежали в лес за хворостом, когда заметили что-то странное - огненное существо, напоминающее скелет, покрытый пламенем. Внезапно оно повернулось и устремилось в вашу сторону.
                  Убежать в пещеру или сразиться с монстром?''',
        "tts": '''Вы побежали в лес за хворостом, когда заметили что-то странное - огненное существо, напоминающее скелет, покрытый пламенем. Внезапно оно повернулось и устремилось в вашу сторону.
                 Убежать в пещеру или сразиться с монстром?'''
    },
    "2_chap_16_3x_1x": {
        "text": '''Вы засучиваете рукава и сосредоточенно бежите на скелета, замахиваясь правой рукой, вы сносите ему челюсть. Однако, это явно не понравилось скелету, и он протянул руку, выбросив на вас струю пламени.
Доспехи недостаточно защитили вас от атаки. Хотите загрузить последнее сохранение?''',
        "tts": '''Вы засучиваете рукава и сосредоточенно бежите на скелета, замахиваясь правой рукой, вы сносите ему челюсть. Однако, это явно не понравилось скелету, и он протянул руку, выбросив на вас струю пламени.
                 Доспехи недостаточно защитили вас от атаки. Хотите загрузить последнее сохранение?'''
    },
    "2_chap_16_3x_x": {
        "text": '''Вы бежали со всех ног к пещере, но скелет не отставал и бросал огненную плазму в вашу сторону. Она попала в ваш нагрудник, но пройдя через водопад, огонь не потух. Оглянувшись, вы увидели, что скелет стоит перед водой и не отводит от вас взгляда, возможно, его сдерживает вода. В то время как вы смотрели на скелета, огненная плазма прожгла вам нагрудник, отнимая у вас одну единицу здоровья. Вы быстро снимаете нагрудник и откидываете его, но он попадает в стену, которая начинает трястись, а руны огня зажигаются.''',
        "tts": '''Вы бежали со всех ног к пещере, но скелет не отставал и бросал огненную плазму в вашу сторону. Она попала в ваш нагрудник, но пройдя через водопад, огонь не потух. Оглянувшись, вы увидели, что скелет стоит перед водой и не отводит от вас взгляда, возможно, его сдерживает вода. В то время как вы смотрели на скелета, огненная плазма прожгла вам нагрудник, отнимая у вас одну единицу здоровья. Вы быстро снимаете нагрудник и откидываете его, но он попадает в стену, которая начинает трястись, а руны огня зажигаются.''',

        "text1": '''Все руны загораются, но никаких изменений не происходит. Прикоснуться к стене?''',
        "tts1": '''Все руны загораются, но никаких изменений не происходит. Прикоснуться к стене?''',

        "text2": '''Зажжешь руну воды?''',
        "tts2": '''Зажжешь руну воды?''',

        "text3": '''Зажжешь руну земли?''',
        "tts3": '''Зажжешь руну земли?''',

        "text4": '''Вторая руна зажжена! Использовать "Землю" или "Воду".''',
        "tts4": '''Вторая руна зажжена! Использовать "Землю" или "Воду".'''
    },
    "2_chap_17": {
        "text": '''Прикоснувшись к стене, она начала трястись. Руны на ней загорелись еще ярче, ослепляя вас. Тряска усиливается, продолжить держать руку?''',
        "tts": '''Прикоснувшись к стене, она начала трястись. Руны на ней загорелись еще ярче, ослепляя вас. Тряска усиливается, продолжить держать руку?'''
    },
    "2_chap_18_1": {
        "text": '''Вы продолжаете держать руку, но внезапно происходит взрыв, который отбрасывает вас в другую сторону. Вы ударяетесь головой и теряете сознание.
Очнуться?''',
        "tts": '''Вы продолжаете держать руку, но внезапно происходит взрыв, который отбрасывает вас в другую сторону. Вы ударяетесь головой и теряете сознание.
                 Очнуться?'''
    },
    "2_chap_18": {
        "text": '''"Вы пытаетесь убрать руку, но внезапно происходит взрыв, который отбрасывает вас в другую сторону. Вы ударяетесь головой и теряете сознание.
Очнуться?''',
        "tts": '''"Вы пытаетесь убрать руку, но внезапно происходит взрыв, который отбрасывает вас в другую сторону. Вы ударяетесь головой и теряете сознание.
                  Очнуться?'''
    },
    "2_chap_19": {
        "text": '''"Эх, молодежь! Вот бы я так мог еще лежать на земле". Это был ваш знакомый старик Гаврила, который появился из портала, что внезапно открылся в пещере. Он подошел к вам и попробовал вас разбудить: "Эй, парень, ты в порядке?"
Вы медленно открываете глаза, и замечаете, что Гаврила стоит над вами, держа в руках свой посох. Из-за головной боли вы не способны произнести ни слова. "Похоже, ты получил неплохой удар. Ладно, давай подниматься, ты же вроде хотел обучиться магии?"
Вы медленно встаете и оглядываетесь вокруг. Спросить Гаврилу про стену?''',
        "tts": '''<speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/f102c4af-b8e8-47c9-b853-0350a2ba011a.opus">. Это был ваш знакомый старик Гаврила, который появился из портала, что внезапно открылся в пещере. Он подошел к вам и попробовал вас разбудить: <speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/cdedc805-b936-4e8b-a75a-f975255719b7.opus">
                  Вы медленно открываете глаза, и замечаете, что Гаврила стоит над вами, держа в руках свой посох. Из-за головной боли вы не способны произнести ни слова. <speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/2af98df1-018e-407c-b0e5-3fab6fff7ae5.opus">
                  Вы медленно встаете и оглядываетесь вокруг. Спросить Гаврилу про стену?'''
    },
    "2_chap_20_1": {
        "text": '''"Потрясающе, что ты остался жив! Тебе еще рано знать, что там. Начнем обучение Магии!".''',
        "tts": '''"Потрясающе, что ты остался жив! Тебе еще рано знать, что там. Начнем обучение Магии!".'''
    },
    "2_chap_20": {
        "text": '''"Начнем обучение магии?".''',
        "tts": '''<speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/cd168ef2-ca1f-49c1-aaaf-8c55787df6ef.opus">.'''
    },
    "2_chap_21_1": {
        "text": '''"Отказы не принимаются!"
"Открытие магического потенциала требует осознанности и сосредоточенности. Важно научиться контролировать свои мысли и эмоции, чтобы не допустить их разрушительного влияния на магические практики.
Вдохи играют важную роль в открытии магического потенциала, так как они помогают контролировать энергию в теле. Начни с глубокого дыхания, вдыхая и выдыхая медленно и равномерно. Сосредоточься на своем дыхании, постепенно осознавая свое тело.
Глаза являются важным инструментом при открытии магического потенциала. Закрой глаза и представь себе живую картину, используя свою воображение. Визуализируй, как магическая энергия проникает в твои руки и тело. Руками ты можешь контролировать магическую энергию. Сосредоточься на своих руках, представив их как инструмент для магической работы. Попробуй выполнить медитативные движения, используя свои руки, чтобы улучшить свою концентрацию и контроль над энергией."
"Повтори за мной: глубоко вдохни, закрой глаза и представь, как магическая энергия проникает в твои руки и тело, выдыхай. Сделай вдох и сосредоточься на своих руках, представив их как инструмент для магической работы, выдыхай."''',
        "tts": '''"Отказы не принимаются!"
                 "Открытие магического потенциала требует осознанности и сосредоточенности. Важно научиться контролировать свои мысли и эмоции, чтобы не допустить их разрушительного влияния на магические практики.
                  Вдохи играют важную роль в открытии магического потенциала, так как они помогают контролировать энергию в теле. Начни с глубокого дыхания, вдыхая и выдыхая медленно и равномерно. Сосредоточься на своем дыхании, постепенно осознавая свое тело.
                  Глаза являются важным инструментом при открытии магического потенциала. Закрой глаза и представь себе живую картину, используя свою воображение. Визуализируй, как магическая энергия проникает в твои руки и тело. Руками ты можешь контролировать магическую энергию. Сосредоточься на своих руках, представив их как инструмент для магической работы. Попробуй выполнить медитативные движения, используя свои руки, чтобы улучшить свою концентрацию и контроль над энергией."
                 "Повтори за мной: глубоко вдохни, закрой глаза и представь, как магическая энергия проникает в твои руки и тело, выдыхай. Сделай вдох и сосредоточься на своих руках, представив их как инструмент для магической работы, выдыхай."'''
    },
    "2_chap_21": {
        "text": '''"Открытие магического потенциала требует осознанности и сосредоточенности. Важно научиться контролировать свои мысли и эмоции, чтобы не допустить их разрушительного влияния на магические практики.
Вдохи играют важную роль в открытии магического потенциала, так как они помогают контролировать энергию в теле. Начни с глубокого дыхания, вдыхая и выдыхая медленно и равномерно. Сосредоточься на своем дыхании, постепенно осознавая свое тело.
Глаза являются важным инструментом при открытии магического потенциала. Закрой глаза и представь себе живую картину, используя свою воображение. Визуализируй, как магическая энергия проникает в твои руки и тело. Руками ты можешь контролировать магическую энергию. Сосредоточься на своих руках, представив их как инструмент для магической работы. Попробуй выполнить медитативные движения, используя свои руки, чтобы улучшить свою концентрацию и контроль над энергией."
"Повтори за мной: глубоко вдохни, закрой глаза и представь, как магическая энергия проникает в твои руки и тело, выдыхай. Сделай вдох и сосредоточься на своих руках, представив их как инструмент для магической работы, выдыхай."''',
        "tts": '''"Открытие магического потенциала требует осознанности и сосредоточенности. Важно научиться контролировать свои мысли и эмоции, чтобы не допустить их разрушительного влияния на магические практики.
                  Вдохи играют важную роль в открытии магического потенциала, так как они помогают контролировать энергию в теле. Начни с глубокого дыхания, вдыхая и выдыхая медленно и равномерно. Сосредоточься на своем дыхании, постепенно осознавая свое тело.
                  Глаза являются важным инструментом при открытии магического потенциала. Закрой глаза и представь себе живую картину, используя свою воображение. Визуализируй, как магическая энергия проникает в твои руки и тело. Руками ты можешь контролировать магическую энергию. Сосредоточься на своих руках, представив их как инструмент для магической работы. Попробуй выполнить медитативные движения, используя свои руки, чтобы улучшить свою концентрацию и контроль над энергией."
                 "Повтори за мной: глубоко вдохни, закрой глаза и представь, как магическая энергия проникает в твои руки и тело, выдыхай. Сделай вдох и сосредоточься на своих руках, представив их как инструмент для магической работы, выдыхай."'''
    },
    "2_chap_22": {
        "text": '''После часа повторения упражнений. "На сегодня хватит. Не переусердствуй с упражнениями, они могут негативно повлиять на тебя!".
Поздравляем, с прохождением прелога! Открыта новая команда "Меню", тут ты сможешь посмотреть свои квесты и открытые способности и многое другое! Для продолжения скажи "Меню". ''',
        "tts": '''После часа повторения упражнений. "На сегодня хватит. Не переусердствуй с упражнениями, они могут негативно повлиять на тебя!".
                 Поздравляем, с прохождением прелога! Открыта новая команда "Меню", тут ты сможешь посмотреть свои квесты и открытые способности и многое другое! Для продолжения скажи "Меню". '''
    },
    "2_chap_23": {
        "text": '''Глава II. Приключения только начинаются!
Чтобы узнать команды навыка, скажи "Посмотреть команды".
Для просмотра списка квестов, скажите "Открыть книгу квестов"
Список:
Текущие квесты:
Отправиться на поиски приключений
Захватывающие приключения ждут вас!
Открыть магический потенциал
Магия - это очень круто
Для подробного описания квеста, произнесите его название!''',
        "tts": '''Глава II. Приключения только начинаются! Чтобы узнать команды навыка, скажи "Посмотреть команды".
                 Для просмотра списка квестов, скажите "Открыть книгу квестов".
                 Список: Текущие квесты: Отправиться на поиски приключений
                 Захватывающие приключения ждут вас! Открыть магический потенциал
                 Магия - это очень круто. Для подробного описания квеста, произнесите его название!'''
    },

}

