from pickle import TRUE


main_data = {
    "start_1": {
        "text": 'Вы фермер, живущий на ферме, которую наследовали от своих предков. Для продолжения просто скажите "Отправиться на рынок".',
        "tts": 'Вы фермер, живущий на ферме, которую наследовали от своих предков. Для продолжения просто скажите "Отправиться на рынок".',
        "buttons": [
            {
                "title": 'Отправиться на рынок',
                "hide": True
            }
        ]
    },
    "start_2": {
        "text": 'К вам пришла полиция. Для продолжения вы можете попробовать сбежать от полиции сказав "Сбежать" или проследовать за полицией, сказав "Проследовать за полицией".',
        "tts": 'К вам пришла полиция. Для продолжения вы можете попробовать сбежать от полиции сказав "Сбежать" или проследовать за полицией, сказав "Проследовать за полицией".',
        "buttons": [
            {
                "title": 'Проследовать за полицией',
                "hide": True
            },
            {
                "title": 'Сбежать',
                "hide": True
            }
        ]
    },
    "start_3": {
        "text": 'Вас посадили в тюрьму. Для продолжения просто скажите "Мотать срок".',
        "tts": 'Вас посадили в тюрьму. Для продолжения просто скажите "Мотать срок".',
        "buttons": [
            {
                "title": 'Мотать срок',
                "hide": True
            }
        ]
    },
    "start_3_1": {
        "text": 'Вас посадили в тюрьму. Для продолжения просто скажите "Мотать срок".',
        "tts": 'Вас посадили в тюрьму. Для продолжения просто скажите "Мотать срок".',
        "buttons": [
            {
                "title": 'Мотать срок',
                "hide": True
            }
        ]
    },
    "chap": {
        "text": 'Вы находитесь в тюрьме, и вам доступны всего два варианта занятий: "Заняться спортом" или "Поспать". Чтобы продолжить, выберите одно из этих занятий.',
        "tts": 'Вы находитесь в тюрьме, и вам доступны всего два варианта занятий: "Заняться спортом" или "Поспать". Чтобы продолжить, выберите одно из этих занятий.',
        "buttons": [
            {
                "title": 'Заняться спортом',
                "hide": True
            },
            {
                "title": 'Поспать',
                "hide": True
            }
        ]
    },
    "chap_1": {
        "text": 'Вы занялись спортом, для продолжения скажите "Мотать срок".',
        "tts": 'Вы занялись спортом, для продолжения скажите "Мотать срок".',
        "buttons": [
            {
                "title": 'Мотать срок',
                "hide": True
            }
        ]
    },
    "chap_1_1": {
        "text": 'Вы выспались, для продолжения скажите "Мотать срок".',
        "tts": 'Вы выспались, для продолжения скажите "Мотать срок".',
        "buttons": [
            {
                "title": 'Мотать срок',
                "hide": True
            }
        ]
    },
    "chap_2": {
        "text": 'Вам достается работа в мастерской. Для продолжения скажите "Начать работать".',
        "tts": 'Вам достается работа в мастерской. Для продолжения скажите "Начать работать".',
        "buttons": [
            {
                "title": 'Начать работать',
                "hide": True
            }
        ]
    },
    "chap_3": {
        "text": 'До вас докопался какой-то заключенный. Чтобы продолжить, соврите ему или откажитесь от его предложения.',
        "tts": 'До вас докопался какой-то заключенный. Чтобы продолжить, соврите ему или откажитесь от его предложения.',
        "buttons": [
            {
                "title": 'Соврать',
                "hide": True
            },
            {
                "title": 'Отказаться',
                "hide": True
            }
        ]
    },
    "chap_4": {
        "text": 'Произошедшее сильно утомило вас. Чтобы завершить работу, скажите "Закончить работу".',
        "tts": 'Произошедшее сильно утомило вас. Чтобы завершить работу, скажите "Закончить работу".',
        "buttons": [
            {
                "title": 'Закончить работу',
                "hide": True
            }
        ]
    },
    "chap_4_1_1": {
        "text": 'Ой-ой, похоже, вам сейчас не поздоровиться. Для продолжения выберите одно из вариантов действий: "Закричать", "Ударить заключенного", "Бежать".',
        "tts": 'Ой-ой, похоже, вам сейчас не поздоровиться. Для продолжения выберите одно из вариантов действий: "Закричать", "Ударить заключенного", "Бежать".',
        "buttons": [
            {
                "title": 'Закричать',
                "hide": True
            },
            {
                "title": 'Ударить заключенного',
                "hide": True
            },
            {
                "title": 'Бежать',
                "hide": True
            }
        ]
    },
    "chap_4_1_0": {
        "text": 'Вы лежите без сознания, чтобы очнуться скажите "Очнуться".',
        "tts": 'Вы лежите без сознания, чтобы очнуться скажите "Очнуться".',
        "buttons": [
            {
                "title": 'Очнуться',
                "hide": True
            }
        ]
    },
    "chap_4_1_3": {
        "text": 'Здорово вы его отделали! Теперь вам нужно что-то сделать с телом. Для продолжения выберите действие: "Оставить в камере", "Позвать охрану", "Убрать в соседнюю камеру".',
        "tts": 'Здорово вы его отделали! Теперь вам нужно что-то сделать с телом. Для продолжения выберите действие: "Оставить в камере", "Позвать охрану", "Убрать в соседнюю камеру".',
        "buttons": [
            {
                "title": 'Оставить в камере',
                "hide": True
            },
            {
                "title": 'Позвать охрану',
                "hide": True
            },
            {
                "title": 'Убрать в соседнюю камеру',
                "hide": True
            }
        ]
    },
    "chap_4_1_3_0": {
        "text": 'Похоже вы в карцере, для того чтобы продолжить скажите "Начать сначала".',
        "tts": 'Похоже вы в карцере, для того чтобы продолжить скажите "Начать сначала".',
        "buttons": [
            {
                "title": 'Начать сначала',
                "hide": True
            }
        ]
    },
    "chap_4_2_1": {
        "text": 'Вы очень устали, вам нужно поспать, для этого скажите "Лечь спать".',
        "tts": 'Вы очень устали, вам нужно поспать, для этого скажите "Лечь спать".',
        "buttons": [
            {
                "title": 'Лечь спать',
                "hide": True
            }
        ]
    },
     "chap_4_2": {
        "text": 'Произошедшее сильно утомило вас. Чтобы завершить работу, скажите "Закончить работу".',
        "tts": 'Произошедшее сильно утомило вас. Чтобы завершить работу, скажите "Закончить работу".',
        "buttons": [
            {
                "title": 'Закончить работу',
                "hide": True
            }
        ]
    },
    "chap_4_1_3_3": {
        "text": 'Вы очень устали, вам нужно поспать, для этого скажите "Лечь спать".',
        "tts": 'Вы очень устали, вам нужно поспать, для этого скажите "Лечь спать".',
        "buttons": [
            {
                "title": 'Лечь спать',
                "hide": True
            }
        ]
    },
    "chap_5": {
        "text": 'Здорово вас покалечили, вам следует восстановить силы, для этого скажите "Лечь спать".',
        "tts": 'Здорово вас покалечили, вам следует восстановить силы, для этого скажите "Лечь спать".',
        "buttons": [
            {
                "title": 'Лечь спать',
                "hide": True
            }
        ]
    },
    "chap_5_1": {
        "text": 'Хорошо, что держитесь от заключенных подальше. Для продолжения скажите "Мотать срок".',
        "tts": 'Хорошо, что держитесь от заключенных подальше. Для продолжения скажите "Мотать срок".',
        "buttons": [
            {
                "title": 'Мотать срок',
                "hide": True
            }
        ]
    },
    "chap_6": {
        "text": 'Что это за ужасные крики? Чтобы посмотреть, что происходит, скажите "Посмотреть". Если не хотите смотреть, просто скажите "Продолжить работать".',
        "tts": 'Что это за ужасные крики? Чтобы посмотреть, что происходит, скажите "Посмотреть". Если не хотите смотреть, просто скажите "Продолжить работать".',
        "buttons": [
            {
                "title": 'Посмотреть',
                "hide": True
            },
            {
                "title": 'Продолжить работать',
                "hide": True
            }
        ]
    },
    "chap_6_1": {
        "text": 'Вы видите, что двое других заключенных избивают третьего. Для продолжения вы можете помочь либо продолжить работать.',
        "tts": 'Вы видите, что двое других заключенных избивают третьего. Для продолжения вы можете помочь либо продолжить работать.',
        "buttons": [
            {
                "title": 'Помочь',
                "hide": True
            },
            {
                "title": 'Продолжить работать',
                "hide": True
            }
        ]
    },
    "chap_6_2": {
        "text": 'Крик усиливается. Для продолжения вы можете помочь либо продолжить работать.',
        "tts": 'Крик усиливается. Для продолжения вы можете помочь либо продолжить работать.',
        "buttons": [
            {
                "title": 'Помочь',
                "hide": True
            },
            {
                "title": 'Продолжить работать',
                "hide": True
            }
        ]
    },
    "chap_6_0": {
        "text": 'Вы спасли торговца. Для продолжения скажите "Мотать срок".',
        "tts": 'Вы спасли торговца. Для продолжения скажите "Мотать срок".',
        "buttons": [
            {
                "title": 'Мотать срок',
                "hide": True
            }
        ]
    },
    "chap_6_0_1": {
        "text": 'Крик прекратился. Для продолжения скажите "Мотать срок".',
        "tts": 'Крик прекратился. Для продолжения скажите "Мотать срок".',
        "buttons": [
            {
                "title": 'Мотать срок',
                "hide": True
            }
        ]
    },
    "chap_7": {
        "text": 'Вы видите, как избивают одного заключенного. Для продолжения скажите "Помочь" или "Продолжить смотреть".',
        "tts": 'Вы видите, как избивают одного заключенного. Для продолжения скажите "Помочь" или "Продолжить смотреть".',
        "buttons": [
            {
                "title": 'Помочь',
                "hide": True
            },
            {
                "title": 'Продолжить смотреть',
                "hide": True
            }
        ]
    },
    "chap_7_0": {
        "text": 'Карцер сломал все ваши мечты на лучшую жизнь. Для продолжения скажите "Начать сначала".',
        "tts": 'Карцер сломал все ваши мечты на лучшую жизнь. Для продолжения скажите "Начать сначала".',
        "buttons": [
            {
                "title": 'Начать сначала',
                "hide": True
            }
        ]
    },
    "chap_7_1": {
        "text": 'Вас сильно избили, для продолжения скажите "Отправиться в лазарет".',
        "tts": 'Вас сильно избили, для продолжения скажите "Отправиться в лазарет".',
        "buttons": [
            {
                "title": 'Отправиться в лазарет',
                "hide": True
            }
        ]
    },
    "chap_8": {
        "text": 'Успешное сохранение! Для продолжения скажите "Продолжить".',
        "tts": 'Успешное сохранение! Для продолжения скажите "Продолжить".',
        "buttons": [
            {
                "title": 'Продолжить',
                "hide": True
            }
        ]
    },
    "chap_9": {
        "text": 'С вами хочет познакомиться заключенный, которого вы спасли. Придумайте и скажите ему свое имя.',
        "tts": 'С вами хочет познакомиться заключенный, которого вы спасли. Придумайте и скажите ему свое имя.',
    },
    "chap_10": {
        "text": 'Михаил предлагает вам план побега. Для продолжения выберите один из вариантов ответа: "Почему ты хочешь помочь мне?", "И как же?".',
        "tts": 'Михаил предлагает вам план побега. Для продолжения выберите один из вариантов ответа: "Почему ты хочешь помочь мне?", "И как же?".',
        "buttons": [
            {
                "title": 'Почему ты хочешь помочь мне?',
                "hide": True
            },
            {
                "title": 'И как же?',
                "hide": True
            }
        ]
    },
    "chap_10_0": {
        "text": 'Михаил дал вам задание принести веревку, железную заточку и рукоятку. Для продолжения вы можете отправиться в столовую или на работу.',
        "tts": 'Михаил дал вам задание принести веревку, железную заточку и рукоятку. Для продолжения вы можете отправиться в столовую или на работу.',
        "buttons": [
            {
                "title": 'Пойти в столовую',
                "hide": True
            },
            {
                "title": 'Пойти на работу',
                "hide": True
            }
        ]
    },
    "chap_10_1": {
        "text": 'Михаил дал вам задание принести веревку, железную заточку и рукоятку. Для продолжения вы можете отправиться в столовую или на работу.',
        "tts": 'Михаил дал вам задание принести веревку, железную заточку и рукоятку. Для продолжения вы можете отправиться в столовую или на работу.',
        "buttons": [
            {
                "title": 'Пойти в столовую',
                "hide": True
            },
            {
                "title": 'Пойти на работу',
                "hide": True
            }
        ]
    },
    "chap_10_2": {
        "text": 'Михаил дал вам задание принести веревку, железную заточку и рукоятку. Для продолжения вы можете отправиться в столовую или на работу.',
        "tts": 'Михаил дал вам задание принести веревку, железную заточку и рукоятку. Для продолжения вы можете отправиться в столовую или на работу.',
        "buttons": [
            {
                "title": 'Пойти в столовую',
                "hide": True
            },
            {
                "title": 'Пойти на работу',
                "hide": True
            }
        ]
    },
    "chap_11": {
        "text": 'Вы пришли в мастерскую. Для продолжения скажите один из вариантов ответа: "Сделать рукоятку", "Осмотреться".',
        "tts": 'Вы пришли в мастерскую. Для продолжения скажите один из вариантов ответа: "Сделать рукоятку", "Осмотреться".',
        "buttons": [
            {
                "title": 'Сделать рукоятку',
                "hide": True
            },
            {
                "title": 'Осмотреться',
                "hide": True
            }
        ]
    },
    "chap_11_1": {
        "text": 'Вы встретили торговца. Для продолжения скажите "Подойти к торговцу".',
        "tts": 'Вы встретили торговца. Для продолжения скажите "Подойти к торговцу".',
        "buttons": [
            {
                "title": 'Подойти к торговцу',
                "hide": True
            }
        ]
    },
    "chap_13_3": {  # то же самое что chap_11_1
        "text": 'Вы встретили торговца. Для продолжения скажите "Подойти к торговцу".',
        "tts": 'Вы встретили торговца. Для продолжения скажите "Подойти к торговцу".',
        "buttons": [
            {
                "title": 'Подойти к торговцу',
                "hide": True
            }
        ]
    },
    "chap_11_0": {
        "text": 'У вас нет другого варианта, чтобы получить заточку. Для продолжения скажите "Купить заточку".',
        "tts": 'У вас нет другого варианта, чтобы получить заточку. Для продолжения скажите "Купить заточку".',
        "buttons": [
            {
                "title": 'Купить заточку',
                "hide": True
            }
        ]
    },
    "chap_11_2": {
        "text": 'У вас нет другого варианта, чтобы получить заточку. Для продолжения скажите "Купить заточку".',
        "tts": 'У вас нет другого варианта, чтобы получить заточку. Для продолжения скажите "Купить заточку".',
        "buttons": [
            {
                "title": 'Купить заточку',
                "hide": True
            }
        ]
    },
    "chap_12": {
        "text": 'Вы сделали рукоятку. Для продолжения скажите "Осмотреться".',
        "tts": 'Вы сделали рукоятку. Для продолжения скажите "Осмотреться".',
        "buttons": [
            {
                "title": 'Осмотреться',
                "hide": True
            }
        ]
    },
    "chap_12_1": {
        "text": 'Вы подобрали веревку. Для продолжения скажите "Сделать рукоятку".',
        "tts": 'Вы подобрали веревку. Для продолжения скажите "Сделать рукоятку".',
        "buttons": [
            {
                "title": 'Сделать рукоятку',
                "hide": True
            }
        ]
    },
    "chap_13_0": {
        "text": 'Все предметы собраны. Для продолжения скажите "Отправиться к Михаилу".',
        "tts": 'Все предметы собраны. Для продолжения скажите "Отправиться к Михаилу".',
        "buttons": [
            {
                "title": 'Отправиться к Михаилу',
                "hide": True
            }
        ]
    },
    "chap_13_4": {  # то же самое что chap_13_0
        "text": 'Все предметы собраны. Для продолжения скажите "Отправиться к Михаилу".',
        "tts": 'Все предметы собраны. Для продолжения скажите "Отправиться к Михаилу".',
        "buttons": [
            {
                "title": 'Отправиться к Михаилу',
                "hide": True
            }
        ]
    },
    "chap_13_2": {
        "text": 'Вы собрали рукоятку и веревку. Для продолжения скажите "Пойти в столовую".',
        "tts": 'Вы собрали рукоятку и веревку. Для продолжения скажите "Пойти в столовую".',
        "buttons": [
            {
                "title": 'Пойти в столовую',
                "hide": True
            }
        ]
    },
    "chap_14": {
        "text": 'Вы получили железную заточку. Для продолжения скажите "Осмотреться" или "Пойти на работу".',
        "tts": 'Вы получили железную заточку. Для продолжения скажите "Осмотреться" или "Пойти на работу".',
        "buttons": [
            {
                "title": 'Осмотреться',
                "hide": True
            },
            {
                "title": 'Пойти на работу',
                "hide": True
            }
        ]
    },
    "chap_15": {
        "text": 'Осмотревшись, вы ничего не нашли. Для продолжения скажите "Пойти на работу".',
        "tts": 'Осмотревшись, вы ничего не нашли. Для продолжения скажите "Пойти на работу".',
        "buttons": [
            {
                "title": 'Пойти на работу',
                "hide": True
            }
        ]
    },
    "chap_16": {
        "text": 'Вы собрали рукоятку и веревку. Для продолжения скажите "Пойти в столовую".',
        "tts": 'Вы собрали рукоятку и веревку. Для продолжения скажите "Пойти в столовую".',
        "buttons": [
            {
                "title": 'Пойти в столовую',
                "hide": True
            }
        ]
    },
    "chap_18": {
        "text": 'Михаил лежит на полу без сознания. Для продолжения скажите "Проверить пульс" или "Убежать".',
        "tts": 'Михаил лежит на полу без сознания. Для продолжения скажите "Проверить пульс" или "Убежать".',
        "buttons": [
            {
                "title": 'Проверить пульс',
                "hide": True
            },
            {
                "title": 'Убежать',
                "hide": True
            }
        ]
    },
    "chap_18_0": {
        "text": 'Все предметы собраны. Для продолжения скажите "Отправиться к Михаилу".',
        "tts": 'Все предметы собраны. Для продолжения скажите "Отправиться к Михаилу".',
        "buttons": [
            {
                "title": 'Отправиться к Михаилу',
                "hide": True
            }
        ]
    },
    "chap_18_1": {
        "text": 'Михаил мертв. Для продолжения скажите "Осмотреть комнату" или "Убежать".',
        "tts": 'Михаил мертв. Для продолжения скажите "Осмотреть комнату" или "Убежать".',
        "buttons": [
            {
                "title": 'Осмотреть комнату',
                "hide": True
            },
            {
                "title": 'Убежать',
                "hide": True
            }
        ]
    },
    "chap_18_2": {
        "text": 'Вы получили план побега. Для продолжения спрячьте предметы сказав "Спрятать в камере" или "Спрятать под одеждой".',
        "tts": 'Вы получили план побега. Для продолжения спрячьте предметы сказав "Спрятать в камере" или "Спрятать под одеждой".',
        "buttons": [
            {
                "title": 'Спрятать в камере',
                "hide": True
            },
            {
                "title": 'Спрятать под одеждой',
                "hide": True
            }
        ]
    },
    "chap_19": {
        "text": 'Для продолжения вы должны обыскать комнату Михаила. Сказав "Искать в тумбочке", "Искать на полу" или "Искать в кровати".',
        "tts": 'Для продолжения вы должны обыскать комнату Михаила. Сказав "Искать в тумбочке", "Искать на полу" или "Искать в кровати".',
        "buttons": [
            {
                "title": 'Искать в тумбочке',
                "hide": True
            },
            {
                "title": 'Искать на полу',
                "hide": True
            },
            {
                "title": 'Искать в кровати',
                "hide": True
            }
        ]
    },
    "chap_19_1": {
        "text": 'Вы нашли деньги. Для продолжения скажите "Взять кошелек", "Искать на полу" или "Искать в кровати".',
        "tts": 'Вы нашли деньги. Для продолжения скажите "Взять кошелек", "Искать на полу" или "Искать в кровати".',
        "buttons": [
            {
                "title": 'Взять кошелек',
                "hide": True
            },
            {
                "title": 'Искать на полу',
                "hide": True
            },
            {
                "title": 'Искать в кровати',
                "hide": True
            }
        ]
    },
    "chap_19_2": {
        "text": 'На полу вы ничего не нашли. Для продолжения скажите "Искать в кровати".',
        "tts": 'На полу вы ничего не нашли. Для продолжения скажите "Искать в кровати".',
        "buttons": [
            {
                "title": 'Искать в кровати',
                "hide": True
            }
        ]
    },
    "chap_19_3": {
        "text": 'Вы нашли какой-то листок с чертежами. Для продолжения вернитесь в камеру, сказав "Вернуться в камеру".',
        "tts": 'Вы нашли какой-то листок с чертежами. Для продолжения вернитесь в камеру, сказав "Вернуться в камеру".',
        "buttons": [
            {
                "title": 'Вернуться в камеру',
                "hide": True
            }
        ]
    },
    "chap_19_1_1": {
        "text": 'Вы взяли кошелек. Для продолжения скажите "Искать на полу" или "Искать в кровати".',
        "tts": 'Вы взяли кошелек. Для продолжения скажите "Искать на полу" или "Искать в кровати".',
        "buttons": [
            {
                "title": 'Искать на полу',
                "hide": True
            },
            {
                "title": 'Искать в кровати',
                "hide": True
            }
        ]
    },
    "chap_20": {
        "text": 'Вы получили план побега. Для продолжения спрячьте предметы сказав "Спрятать в камере" или "Спрятать под одеждой".',
        "tts": 'Вы получили план побега. Для продолжения спрячьте предметы сказав "Спрятать в камере" или "Спрятать под одеждой".',
        "buttons": [
            {
                "title": 'Спрятать в камере',
                "hide": True
            },
            {
                "title": 'Спрятать под одеждой',
                "hide": True
            }
        ]
    },
    "chap_21": {
        "text": 'Объявляется обыск. Для продолжения ответьте на вопрос: нужно ли перепрятать предметы?',
        "tts": 'Объявляется обыск. Для продолжения ответьте на вопрос: нужно ли перепрятать предметы?',
        "buttons": [
            {
                "title": 'Да',
                "hide": True
            },
            {
                "title": 'Нет',
                "hide": True
            }
        ]
    },
    "chap_21_1": {
        "text": 'Вас заметил охранник и отправил в карцер. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts": 'Вас заметил охранник и отправил в карцер. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons": [
            {
                "title": 'Загрузить последнее сохранение',
                "hide": True
            }
        ]
    },
    "chap_21_2": {
        "text": 'Тревога закончилась. Для продолжения скажите "Сохранить игру".',
        "tts": 'Тревога закончилась. Для продолжения скажите "Сохранить игру".',
        "buttons": [
            {
                "title": 'Сохранить игру',
                "hide": True
            }
        ]
    },
    "chap_22": {
        "text": 'Пора подумать, когда лучше всего начать побег. Для продолжения скажите "Начать побег в обед" или "Начать побег сейчас".',
        "tts": 'Пора подумать, когда лучше всего начать побег. Для продолжения скажите "Начать побег в обед" или "Начать побег сейчас".',
        "buttons": [
            {
                "title": 'Начать побег в обед',
                "hide": True
            },
            {
                "title": 'Начать побег сейчас',
                "hide": True
            }
        ]
    },
    "chap_22_1": {
        "text": 'Вы на пороге в тайную комнату. Для продолжения скажите "Войти в комнату".',
        "tts": 'Вы на пороге в тайную комнату. Для продолжения скажите "Войти в комнату".',
        "buttons": [
            {
                "title": 'Войти в комнату',
                "hide": True
            }
        ]
    },
    "chap_23_1": {  # то же что chap_22_1
        "text": 'Вы на пороге в тайную комнату. Для продолжения скажите "Войти в комнату".',
        "tts": 'Вы на пороге в тайную комнату. Для продолжения скажите "Войти в комнату".',
        "buttons": [
            {
                "title": 'Войти в комнату',
                "hide": True
            }
        ]
    },
    "chap_22_2": {
        "text": 'Вы на пороге в тайную комнату. Для продолжения скажите "Осмотреться" или "Войти в комнату".',
        "tts": 'Вы на пороге в тайную комнату. Для продолжения скажите "Осмотреться" или "Войти в комнату".',
        "buttons": [
            {
                "title": 'Осмотреться',
                "hide": True
            },
            {
                "title": 'Войти в комнату',
                "hide": True
            }
        ]
    },
    "chap_23": {
        "text": 'Вы на пороге в тайную комнату. Для продолжения скажите "Войти в комнату" или "Вернуться в обед".',
        "tts": 'Вы на пороге в тайную комнату. Для продолжения скажите "Войти в комнату" или "Вернуться в обед".',
        "buttons": [
            {
                "title": 'Войти в комнату',
                "hide": True
            },
            {
                "title": 'Вернуться в обед',
                "hide": True
            }
        ]
    },
    "chap_23_2": {
        "text": 'Вас замечает охранник и отправляет в карцер. Для продолжения скажите "Загрузить последнее сохранение".',
        "tts": 'Вас замечает охранник и отправляет в карцер. Для продолжения скажите "Загрузить последнее сохранение".',
        "buttons": [
            {
                "title": 'Загрузить последнее сохранение',
                "hide": True
            }
        ]
    },
    "chap_24": {
        "text": 'Вам нужно сделать топор или кирку. Для этого скажите "Сделать топор" или "Сделать кирку".',
        "tts": 'Вам нужно сделать топор или кирку. Для этого скажите "Сделать топор" или "Сделать кирку".',
        "buttons": [
            {
                "title": 'Сделать топор',
                "hide": True
            },
            {
                "title": 'Сделать кирку',
                "hide": True
            }
        ]
    },
    "chap_24_1": {
        "text": 'Вы сломали кирку и решили сделать топор. Для продолжения скажите "Продолжить ломать решетку".',
        "tts": 'Вы сломали кирку и решили сделать топор. Для продолжения скажите "Продолжить ломать решетку".',
        "buttons": [
            {
                "title": 'Продолжить ломать решетку',
                "hide": True
            }
        ]
    },
    "chap_24_2": {
        "text": 'Вы сделали топор. Для продолжения скажите "Начать ломать решетку".',
        "tts": 'Вы сделали топор. Для продолжения скажите "Начать ломать решетку".',
        "buttons": [
            {
                "title": 'Начать ломать решетку',
                "hide": True
            }
        ]
    },
    "chap_25": {
        "text": 'Вы совершили побег. Для продолжения ответьте на вопрос: нужно ли покидать город?',
        "tts": 'Вы совершили побег. Для продолжения ответьте на вопрос: нужно ли покидать город?',
        "buttons": [
            {
                "title": 'Да',
                "hide": True
            },
            {
                "title": 'Нет',
                "hide": True
            }
        ]
    },
    "chap_25_1": {
        "text": 'Ворота из города заперты. Для продолжения вы можете сломать замок, сказав "Сломать замок" или подождать, пока откроют ворота, сказав "Ждать".',
        "tts": 'Ворота из города заперты. Для продолжения вы можете сломать замок, сказав "Сломать замок" или подождать, пока откроют ворота, сказав "Ждать".',
        "buttons": [
            {
                "title": 'Сломать замок',
                "hide": True
            },
            {
                "title": 'Ждать',
                "hide": True
            }
        ]
    },
    "chap_25_2": {
        "text": 'Вас поймала полиция. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts": 'Вас поймала полиция. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons": [
            {
                "title": 'Загрузить последнее сохранение',
                "hide": True
            }
        ]
    },
    "chap_25_1_1": {  # то же что chap_25_2
        "text": 'Вас поймала полиция. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts": 'Вас поймала полиция. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons": [
            {
                "title": 'Загрузить последнее сохранение',
                "hide": True
            }
        ]
    },
    "chap_25_1_2": {
        "text": 'Вы успешно сбежали из города. Для продолжения скажите "Сохранить игру".',
        "tts": 'Вы успешно сбежали из города. Для продолжения скажите "Сохранить игру".',
        "buttons": [
            {
                "title": 'Сохранить игру',
                "hide": True
            }
        ]
    },
    "2_chap":{
        "text": 'Вы уже бежите несколько часов. Чтобы продолжить, ответьте на вопрос: "Остановиться?"',
        "tts":'Вы уже бежите несколько часов. Чтобы продолжить, ответьте на вопрос: "Остановиться?"',
        "buttons":[
            {
                "title":'Нет',
                "hide": True
            },
            {
                "title":'Да',
                "hide" :True
            }
        ]
    },
    "2_chap_1_x":{
        "text":'Вы находитесь в безопасности. Чтобы продолжить, посмотрите свои характеристики, сказав: "Осмотреть себя".',
        "tts":'Вы находитесь в безопасности. Чтобы продолжить, посмотрите свои характеристики, сказав: "Осмотреть себя".',
        "buttons":[
            {
                "title":'Осмотреть себя',
                "hide": True
                
            }
        ] 
    },
    "2_chap_2":{
        "text":'Вы находитесь на распутье. Перед вами 3 неизвестных дороги. Куда решите пойти: "Вперед", "Влево", "Вправо".',
        "tts":'Вы находитесь на распутье. Перед вами 3 неизвестных дороги. Куда решите пойти: "Вперед", "Влево", "Вправо".',
        "buttons":[
            {
            "title":'Вперед',
            "hide": True
            },
            {
            "title":'Влево',
            "hide":True
            },
            {
            "title":'Вправо',
            "hide": True
            }
            ]
        },
    "2_chap_3_1x":{
        "text":'Вы услышали хруст ветки. Похоже, что кто-то наблюдает за вами. Для продолжения осмотритесь или продолжите идти, сказав "Осмотреться" или "Продолжить идти".',
        "tts":'Вы услышали хруст ветки. Похоже, что кто-то наблюдает за вами. Для продолжения осмотритесь или продолжите идти, сказав "Осмотреться" или "Продолжить идти".',
        "buttons":[
            {
            "title":'Продолжить идти',
            "hide":True
            },
            {
            "title":'Осмотреться',
            "hide": True
            }
            ]
        },
    "2_chap_3_1_x":{
        "text":'Вы погибли. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts":'Вы погибли. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons":[
            {
            "title":'Загрузить последнее сохранение',
            "hide":True
            }
            ]
        },
    "2_chap_3_2x":{
        "text":'Перед вами огромный монстр. Для продолжения скажите: "Сразиться с монстром" или "Аккуратно пройти мимо".',
        "tts":'Перед вами огромный монстр. Для продолжения скажите: "Сразиться с монстром" или "Аккуратно пройти мимо".',
        "buttons":[
            {
            "title":'Аккуратно пройти мимо',
            "hide":True
            },
            {
            "title":'Сразиться с монстром',
            "hide": True
            }
            ]
        },
    "2_chap_3_2_1x":{
        "text":'Чтобы выбрать оружие, скажите Взять "Предмет". Чтобы посмотреть, какие предметы у вас есть, скажите "Открыть инвентарь".',
        "tts":'Чтобы выбрать оружие, скажите Взять "Предмет". Чтобы посмотреть, какие предметы у вас есть, скажите "Открыть инвентарь".',
        "buttons":[
            {
            "title":'Предмет',
            "hide": True
            },
            {
            "title":'Открыть инвентарь',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_x":{
        "text":'Обойдя монстра, вы видите реку и шлюпку, привязанную к берегу. Для продолжения скажите "Спустить шлюпку на воду".',
        "tts":'Обойдя монстра, вы видите реку и шлюпку, привязанную к берегу. Для продолжения скажите "Спустить шлюпку на воду".',
        "buttons":[
            {
            "title":'Спустить шлюпку на воду' ,
            "hide":True
            }
            ]
        },
    "2_chap_3_2_1_1":{
        "text":'Для продолжения возьмите топор, сказав "Взять самодельный топор".',
        "tts":'Для продолжения возьмите топор, сказав "Взять самодельный топор".',
        "buttons":[
            {
            "title":'Взять самодельный топор',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_1_2":{
        "text":'Мощным ударом ящер кидает вас дерево. Для продолжения скажите "Притвориться мертвым" или "Продолжить нападать".',
        "tts":'Мощным ударом ящер кидает вас дерево. Для продолжения скажите "Притвориться мертвым" или "Продолжить нападать".',
        "buttons":[
            {
            "title":'Притвориться мертвым',
            "hide":True
            },
            {
            "title":'Продолжить нападать',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_1_2_1x":{
        "text":'Вы погибли. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts":'Вы погибли. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons":[
            {
            "title":'Загрузить последнее сохранение',
            "hide": True
            }
            ]
        },
    "2_chap_3_2_1_2_x":{
        "text":'Ящер уходит. Для продолжения вы можете "Продолжить лежать" или "Пойти дальше".',
        "tts":'Ящер уходит. Для продолжения вы можете "Продолжить лежать" или "Пойти дальше".',
        "buttons":[
            {
            "title":'Пойти дальше',
            "hide":True
            },
            {
            "title":'Продолжить лежать',
            "hide": True
            }
            ]
        },
    "2_chap_3_2_1_2_1":{
        "text":'Лежа на земле, вы не замечаете ничего необычного вокруг. Для продолжения скажите: "Продолжить идти".',
        "tts":'Лежа на земле, вы не замечаете ничего необычного вокруг. Для продолжения скажите: "Продолжить идти".',
        "buttons":[
            {
            "title":'Продолжить идти',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_1_2_2":{
        "text":'Вы очень устали. Для продолжения вы можете "Лечь спать" или "Продолжить идти".',
        "tts":'Вы очень устали. Для продолжения вы можете "Лечь спать" или "Продолжить идти".',
        "buttons":[
            {
            "title":'Продолжить идти',
            "hide": True
            },
            {
            "title":'Лечь спать',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_1_2_2_1x":{
        "text":'Вы не смогли пережить эту ночь. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts":'Вы не смогли пережить эту ночь. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons":[
            {
            "title":'Загрузить последнее сохранение',
            "hide": True
            }
            ]
        },
    "2_chap_3_2_1_2_2_x":{
        "text":'Вы лежите без сознания. Для продолжения скажите "Очнуться".',
        "tts":'Вы лежите без сознания. Для продолжения скажите "Очнуться".',
        "buttons":[
            {
            "title":'Очнуться',
            "hide": True
            }
            ]
        },
    "2_chap_3_2_1_2_2_1":{
        "text":'Вас охранял старик Гаврила, будет невежливо с ним не поздороваться. Для продолжения скажите "Поздороваться с Гаврилой".',
        "tts":'Вас охранял старик Гаврила, будет невежливо с ним не поздороваться. Для продолжения скажите "Поздороваться с Гаврилой".',
        "buttons":[
            {
            "title":'Поздороваться с Гаврилой',
            "hide": True
            }
            ]
        },
    "2_chap_3_2_2":{
        "text":'Вы плывете по реке на шлюпке. Для продолжения вы можете, обыскать шлюпку сказав "Обыскать шлюпку" или лечь спать.',
        "tts":'Вы плывете по реке на шлюпке. Для продолжения вы можете, обыскать шлюпку сказав "Обыскать шлюпку" или лечь спать.',
        "buttons":[
            {
            "title":'Обыскать шлюпку',
            "hide":True
            },
            {
            "title":'Лечь спать',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_2_2_1_1":{ 
        "text":'Вы проснулись от громкого шума. Шлюпка столкнулась с упавшим деревом.\n'/
                'Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".',
        "tts":'Вы проснулись от громкого шума. Шлюпка столкнулась с упавшим деревом. Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".',
        "buttons":[
            {
            "title":'Инвентарь',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_2_2":{
        "text":'В шлюпке вы нашли провизию. Для продолжения вы можете ее съесть, сказав "Перекусить" или Лечь спать.',
        "tts":'В шлюпке вы нашли провизию. Для продолжения вы можете ее съесть, сказав "Перекусить" или Лечь спать.',
        "buttons":[
            {
            "title":'Лечь спать',
            "hide":True
            },
            {
            "title":'Перекусить',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_2_2_1":{
        "text":'Впереди падает дерево. Для продолжения вы можете выпрыгнуть из шлюпки, сказав "Выпрыгнуть из шлюпки" или Остаться в шлюпке.',
        "tts":'Впереди падает дерево. Для продолжения вы можете выпрыгнуть из шлюпки, сказав "Выпрыгнуть из шлюпки" или Остаться в шлюпке.',
        "buttons":[
            {
            "title":'Выпрыгнуть из шлюпки',
            "hide":True
            },
            {
            "title":'Остаться в шлюпке',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_2_2_1_x":{
        "text":'Впереди шлюпки падает дерево. Шлюпка сталкивается с бревном.\n'/
            'Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".',
        "tts":'Впереди шлюпки падает дерево. Шлюпка сталкивается с бревном. Чтобы срубить дерево, вам понадобится подходящий инструмент из вашего инвентаря. Для просмотра, предметов в вашем инвентаре, просто скажите "Инвентарь".',
        "buttons":[
            {
            "title":'Инвентарь',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_2_2_1_1x":{
        "text":'Вы потеряли сознание. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts":'Вы потеряли сознание. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons":[
            {
            "title":'Загрузить последнее сохранение',
            "hide": True
            }
            ]
        },
    "2_chap_3_2_2_2_1_1":{
        "text":'Для продолжения возьмите топор, сказав "Взять самодельный топор".',
        "tts":'Для продолжения возьмите топор, сказав "Взять самодельный топор".',
        "buttons":[
            {
            "title":'Взять самодельный топор',
            "hide":True
            }
            ]
        },
    "2_chap_3_2_2_2_1_2":{
        "text":'Для продолжения восстановите силы, сказав "Лечь спать".',
        "tts":'Для продолжения восстановите силы, сказав "Лечь спать".',
        "buttons":[
            {
            "title":'Лечь спать',
            "hide": True
            }
            ]
        },
    "2_chap_3_2_2_2_1_3":{
        "text":'Вас охранял старик Гаврила, будет невежливо с ним не поздороваться. Для продолжения скажите "Поздороваться с Гаврилой".',
        "tts":'Вас охранял старик Гаврила, будет невежливо с ним не поздороваться. Для продолжения скажите "Поздороваться с Гаврилой".',
        "buttons":[
            {
            "title":'Поздороваться с Гаврилой',
            "hide":True
            }
            ]
        },
    "2_chap_3_3x":{
        "text":'Вы начинаете тонуть в болоте. Для продолжения ответьте на вопрос: Как лучше всего выбраться из болота - резко или медленно?',
        "tts":'Вы начинаете тонуть в болоте. Для продолжения ответьте на вопрос: Как лучше всего выбраться из болота - резко или медленно?',
        "buttons":[
            {
            "title":'Медленно',
            "hide": True
            },
            {
            "title":'Резко',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_1x":{
        "text":'Вы погибли. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts":'Вы погибли. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons":[
            {
            "title":'Загрузить последнее сохранение',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_1":{
        "text":'Промокший, весь в грязи и тине вы пересекаете болото.\n'/
                'Для продолжения скажите "Идти дальше".',
        "tts":'Промокший, весь в грязи и тине вы пересекаете болото. Для продолжения скажите "Идти дальше".',
        "buttons":[
            {
            "title":'Идти дальше',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_2":{
        "text":'Перед вами расщелина. Для продолжения вы можете попробовать перепрыгнуть ее, сказав "Перепрыгнуть" или построить импровизированный мост, сказав "Построить мост".',
        "tts":'Перед вами расщелина. Для продолжения вы можете попробовать перепрыгнуть ее, сказав "Перепрыгнуть" или построить импровизированный мост, сказав "Построить мост".',
        "buttons":[
            {
            "title":'Перепрыгнуть',
            "hide":True
            },
            {
            "title":'Построить мост',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_2_1x":{
        "text":'Вы не сумели перепрыгнуть расщелину. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts":'Вы не сумели перепрыгнуть расщелину. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons":[
            {
            "title":'Загрузить последнее сохранение',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_2_x":{
        "text":'Вам нужно срубить дерево. Для продолжения скажите "Инвентарь".',
        "tts":'Вам нужно срубить дерево. Для продолжения скажите "Инвентарь".',
        "buttons":[
            {
            "title":'Инвентарь',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_2_1":{
        "text":'Возьмите топор из инвентаря, сказав "Взять самодельный топор".',
        "tts":'Возьмите топор из инвентаря, сказав "Взять самодельный топор".',
        "buttons":[
            {
            "title":'Взять самодельный топор',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_2_2":{
        "text":'Вы срубили дерево, и оно упало на расщелину с громким шумом, создавая импровизированный мост. Для продолжения ответьте на вопрос: "Отправиться по упавшему дереву?".',
        "tts":'Вы срубили дерево, и оно упало на расщелину с громким шумом, создавая импровизированный мост. Для продолжения ответьте на вопрос: "Отправиться по упавшему дереву?".',
        "buttons":[
            {
            "title":'Да',
            "hide":True
            },
            {
            "title":'Нет',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_2_2_1x":{
        "text":'На шум сбежались монстры. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "tts":'На шум сбежались монстры. Для продолжения загрузите последнее сохранение, сказав "Загрузить последнее сохранение".',
        "buttons":[
            {
            "title":'Загрузить последнее сохранение',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_2_2_x":{
        "text":'Вы лежите без сознания. Для продолжения скажите "Очнуться".',
        "tts":'Вы лежите без сознания. Для продолжения скажите "Очнуться".',
        "buttons":[
            {
            "title":'Очнуться',
            "hide":True
            }
            ]
        },
    "2_chap_3_3_2_2_1":{
        "text":'Вас охранял старик Гаврила, будет невежливо с ним не поздороваться. Для продолжения скажите "Поздороваться с Гаврилой".',
        "tts":'Вас охранял старик Гаврила, будет невежливо с ним не поздороваться. Для продолжения скажите "Поздороваться с Гаврилой".',
        "buttons":[
            {
            "title":'Поздороваться с Гаврилой',
            "hide":True
            }
            ]
        },
    "2_chap_4":{
        "text":'Вряд ли вы найдете какое-то другое убежище. Для продолжения скажите "Помочь".',
        "tts":'Вряд ли вы найдете какое-то другое убежище. Для продолжения скажите "Помочь".',
        "buttons":[
            {
            "title":'Помочь',
            "hide":True
            }
            ]
        },
    "2_chap_5":{
        "text":'Чтобы проверить, какие предметы у вас есть в инвентаре, скажите "Открыть инвентарь".',
        "tts":'Чтобы проверить, какие предметы у вас есть в инвентаре, скажите "Открыть инвентарь".',
        "buttons":[
            {
            "title":'Открыть инвентарь',
            "hide":True
            }
            ]
        },
    "2_chap_6":{
        "text":'''Список:\n
                  Потрепанный шлем\n
                  Потрепанный нагрудник\n
                  Потрепанные поножи\n
                  Потрепанные ботинки\n
                  Самодельный топор\n
                  Хорош для всех рубящих ударов\n
                  Потрескавшийся меч\n\n
                  Для экипировки брони скажите надеть "Название доспеха"''',
        "tts":'''Список:\n
                  Потрепанный шлем\n
                  Потрепанный нагрудник\n
                  Потрепанные поножи\n
                  Потрепанные ботинки\n
                  Самодельный топор\n
                  Хорош для всех рубящих ударов\n
                  Потрескавшийся меч\n\n
                  Для экипировки брони скажите надеть "Название доспеха"''',
        "buttons":[
            {
            "title":'Потрепанный шлем',
            "hide":True
            },
            {
            "title":'Потрепанный нагрудник',
            "hide":True
            },
            {
            "title":'Потрепанные поножи',
            "hide":True
            },
            {
            "title":'Потрепанные ботинки',
            "hide":True
            },
            {
            "title":'Самодельный топор',
            "hide":True
            },
            {
            "title":'Потрескавшийся меч',
            "hide":True
            }
            ]
        },
    "2_chap_7":{
        "text":'''Для продолжения ответьте на вопрос Гаврилы: "Отлично выглядишь! Ты готов победить разбойников?''',
        "tts":'''Для продолжения ответьте на вопрос Гаврилы: "Отлично выглядишь! Ты готов победить разбойников?"''',
        "buttons":[
            {
            "title":'Да',
            "hide":True
            },
            {
            "title":'Нет',
            "hide":True
            }
            ]
        },
    "2_chap_7_1":{
        "text":'''Вы должны победить разбойников! Для продолжения скажите Отправиться в пещеру.''',
        "tts":'''Вы должны победить разбойников! Для продолжения скажите Отправиться в пещеру.''',
        "buttons":[
            {
            "title":'Отправиться в пещеру',
            "hide":True
            }
            ]
        },
    "2_chap_7_2":{
        "text":'''У вас есть два варианта атаки: "Мощная" - она наносит больший урон, но требует много выносливости, и "Слабая" - она наносит меньший урон, но требует меньше выносливости. Чтобы восстановить свою выносливость, скажите "Отдохнуть".''',
        "tts":'''У вас есть два варианта атаки: "Мощная" - она наносит больший урон, но требует много выносливости, и "Слабая" - она наносит меньший урон, но требует меньше выносливости. Чтобы восстановить свою выносливость, скажите "Отдохнуть".''',
        "buttons":[
            {
            "title":'Отдохнуть',
            "hide":True
            },
            {
            "title":'Мощная атака',
            "hide":True
            },
            {
            "title":'Слабая атака',
            "hide":True
            }
            ]
        },
    "2_chap_8":{
        "text":'''Вы поражены способностями Гаврилы. Для продолжения скажите "Расспросить Гаврилу".''',
        "tts":'''Вы поражены способностями Гаврилы. Для продолжения скажите "Расспросить Гаврилу".''',
        "buttons":[
            {
            "title":'Расспросить Гаврилу',
            "hide":True
            }
            ]        
        },
    "2_chap_9":{
        "text":'''Чтобы продолжить уберитесь в пещере, сказав "Убраться в пещере".''',
        "tts":'''Чтобы продолжить уберитесь в пещере, сказав "Убраться в пещере".''',
        "buttons":[
            {
            "title":'Убраться в пещере',
            "hide":True
            }
            ]
        },
    "2_chap_10":{
        "text":'''Вы очень устали, для продолжения скажите "Лечь спать".''',
        "tts":'''Вы очень устали, для продолжения скажите "Лечь спать".''',
        "buttons":[
            {
            "title":'Лечь спать',
            "hide":True
            }
            ]
        },
    "2_chap_11":{
        "text":'''Вы голодны. Для продолжения скажите "Найти еду".''',
        "tts":'''Вы голодны. Для продолжения скажите "Найти еду".''',
        "buttons":[
            {
            "title":'Найти еду',
            "hide":True
            }
            ]
        },
    "2_chap_12":{
        "text":'''Выберите, что хотите покушать. Рыбу или Ягоды.''',
        "tts":'''Выберите, что хотите покушать. Рыбу или Ягоды.''',
        "buttons":[
            {
            "title":'Рыба',
            "hide":True
            },
            {
            "title":'Ягоды',
            "hide":True
            }
            ]   
    },
    "2_chap_13_1":{
        "text":'''Вы вернулись в пещеру. Для продолжения скажите "Осмотреться".''',
        "tts":'''Вы вернулись в пещеру. Для продолжения скажите "Осмотреться".''',
        "buttons":[
            {
            "title":'Осмотреться',
            "hide":True
            }
            ]
        },
    "2_chap_13_2":{
        "text":'''Вы поймали рыбу, для продолжения вы можете пожарить ее, сказав "Пожарить" или скушать сырую, сказав "Кушать".''',
        "tts":'''Вы поймали рыбу, для продолжения вы можете пожарить ее, сказав "Пожарить" или скушать сырую, сказав "Кушать".''',
        "buttons":[
            {
            "title":'Кушать',
            "hide":True
            },
            {
            "title":'Пожарить',
            "hide":True
            }
            ]
        },
    "2_chap_13_2_1":{
        "text":'''Вы вернулись в пещеру. Для продолжения скажите "Осмотреться".''',
        "tts":'''Вы вернулись в пещеру. Для продолжения скажите "Осмотреться".''',
        "buttons":[
            {
            "title":'Осмотреться',
            "hide":True
            }
            ]
        },
    "2_chap_13_2_2":{
        "text":'''Вы вернулись в пещеру. Для продолжения скажите "Осмотреться".''',
        "tts":'''Вы вернулись в пещеру. Для продолжения скажите "Осмотреться".''',
        "buttons":[
            {
            "title":'Осмотреться',
            "hide":True
            }
            ]
        },
    "2_chap_14":{
        "text":'''Вы нашли какую-то странную стену. Вы чувствуете, что она зовет вас. Для продолжения скажите "Прикоснуться к стене".''',
        "tts":'''Вы нашли какую-то странную стену. Вы чувствуете, что она зовет вас. Для продолжения скажите "Прикоснуться к стене".''',
        "buttons":[
            {
            "title":'Прикоснуться к стене',
            "hide":True
            }
            ]
        },
    "2_chap_15_x":{
        "text":'''Вы смогли понять изображенные руны на стене. Для продолжения проверьте гипотезу о рунах, сказав "Подуть на стену".''',
        "tts":'''Вы смогли понять изображенные руны на стене. Для продолжения проверьте гипотезу о рунах, сказав "Подуть на стену".''',
        "buttons":[
            {
            "title":'Подуть на стену',
            "hide":True
            }
            ]
        },
    "2_chap_15_x_x":{
        "text":'''Ваша гипотеза сработала. Теперь вам нужно активировать остальные руны. Какую руну использовать далее - "Воды", "Земли" или "Огня"?''',
        "tts":'''Ваша гипотеза сработала. Теперь вам нужно активировать остальные руны. Какую руну использовать далее - "Воды", "Земли" или "Огня"?''',
        "buttons":[
            {
            "title":'Земля',
            "hide":True
            },
            {
            "title":'Вода',
            "hide":True
            },
            {
            "title":'Огонь',
            "hide":True
            }
            ]
        },
    "2_chap_16_3x":{
        "text":'''В лесу вы увидели огненного скелета. Для продолжения вы можете "Убежать в пещеру" или "Сразиться с монстром".''',
        "tts":'''В лесу вы увидели огненного скелета. Для продолжения вы можете "Убежать в пещеру" или "Сразиться с монстром".''',
        "buttons":[
            {
            "title":'Сразиться с монстром',
            "hide":True
            },
            {
            "title":'Убежать в пещеру',
            "hide":True
            }
            ]
        },
    "2_chap_16_3x_1x":{
        "text":'''Вы очень разозлили скелета! Для продолжения скажите "Загрузить последнее сохранение".''',
        "tts":'''Вы очень разозлили скелета! Для продолжения скажите "Загрузить последнее сохранение".''',
        "buttons":[
            {
            "title":'Загрузить последнее сохранение',
            "hide":True
            }
            ]
        },
    "2_chap_17":{
        "text":'''Из-за вашего прикосновения к стене, все затряслось.\n
                  Продолжить держать руку?''',
        "tts":'''Из-за вашего прикосновения к стене, все затряслось.\n
                 Продолжить держать руку?''',
        "buttons":[
            {
            "title":'Да',
            "hide":True
            },
            {
            "title":'Нет',
            "hide":True
            }
            ]
        },
    "2_chap_18":{
        "text":'''Вы сильно ударились головой и потеряли сознание. Для продолжения скажите "Очнуться".''',
        "tts":'''Вы сильно ударились головой и потеряли сознание. Для продолжения скажите "Очнуться".''',
        "buttons":[
            {
            "title":'Очнуться',
            "hide":True
            }
            ]
        },
    "2_chap_19":{
        "text":'''Гаврила вернулся! Для продолжения, ответьте на вопрос: "Спросить у Гаврилы про стену?"''',
        "tts":'''Гаврила вернулся! Для продолжения, ответьте на вопрос: "Спросить у Гаврилы про стену?"''',
        "buttons":[
            {
            "title":'Да',
            "hide":True
            },
            {
            "title":'Нет',
            "hide":True
            }
            ]
        },
    "2_chap_20":{
        "text":'''Для того, чтобы продолжить, скажите "Начать обучение магии".''',
        "tts":'''Для того, чтобы продолжить, скажите "Начать обучение магии".''',
        "buttons":[
            {
            "title":'Начать обучение магией',
            "hide":True
            }
            ]
        },
    "2_chap_22":{
        "text":'''Поздравляем, с прохождением прелога! Открыта новая команда "Меню", тут ты сможешь посмотреть свои квесты и открытые способности и многое другое! Для продолжения скажи "Меню".''',
        "tts":'''Поздравляем, с прохождением прелога! Открыта новая команда "Меню", тут ты сможешь посмотреть свои квесты и открытые способности и многое другое! Для продолжения скажи "Меню".''',
        "buttons":[
            {
            "title":'Меню',
            "hide":True
            }
            ]
        }





}
