Quest_says = {
    "quest": {
        "text": '''Вы жаждите новых приключений и отправляетесь в темный лес рядом с убежищем.\n
                  Начать квест?''',
        "tts": '''Вы жаждите новых приключений и отправляетесь в темный лес рядом с убежищем.
                 Начать квест?'''
    },
    "quest_2": {
        "text": '''Прибыв в лес, вы начинаете свой путь. Лес мрачный и устрашающий, но вы не теряете решимости продолжать свое путешествие. Через некоторое время вы замечаете следы животных и слышите звуки, которые заставляют вас быть настороже.\n
                  Продолжить идти или сбавить темп?''',
        "tts": '''Прибыв в лес, вы начинаете свой путь. Лес мрачный и устрашающий, но вы не теряете решимости продолжать свое путешествие. Через некоторое время вы замечаете следы животных и слышите звуки, которые заставляют вас быть настороже.
                 Продолжить идти или сбавить темп?'''
    },
    "quest_3": {
        "text": '''Вы натыкаетесь на ловушку и осознаёте, что в этом лесу вы не одни. Продолжить идти или деактивировать ловушку?''',
        "tts": '''Вы натыкаетесь на ловушку и осознаёте, что в этом лесу вы не одни. Продолжить идти или деактивировать ловушку?'''
    },
    "quest_4_x": {
        "text": '''При обходе ловушки вы по неосторожности попадаете в другую. Вас поднимает в воздух, и теперь вы висите вверх ногами. Звать на помощь или попытаться выбраться?''',
        "tts": '''При обходе ловушки вы по неосторожности попадаете в другую. Вас поднимает в воздух, и теперь вы висите вверх ногами. Звать на помощь или попытаться выбраться?'''
    },
    "quest_4_1x": {
        "text": '''Пытаясь деактивировать ловушку, вы по неосторожности попадаете в нее. Вас бросает в воздух и теперь вы висите вверх ногами. Звать на помощь или попытаться выбраться?''',
        "tts": '''Пытаясь деактивировать ловушку, вы по неосторожности попадаете в нее. Вас бросает в воздух и теперь вы висите вверх ногами. Звать на помощь или попытаться выбраться?'''
    },
    "quest_5_1x": {
        "text": '''Доспехи, которые вы надели, слишком тяжелы для того, чтобы вы могли встать. Вы чувствуете отчаяние и решаете звать на помощь. Через несколько часов к вам приходит некий разбойник, вы сразу узнаете его - это тот самый разбойник, которому Гаврила попал огненным шаром в плечо. Разбойник молча связывает вас и уносит в неизвестном направлении.\n
                  Вас тащат по земле, как мешок, и в один момент вы зацепляетесь за сучок, в результате чего веревка рвется. Выбраться?''',
        "tts": '''Доспехи, которые вы надели, слишком тяжелы для того, чтобы вы могли встать. Вы чувствуете отчаяние и решаете звать на помощь. Через несколько часов к вам приходит некий разбойник, вы сразу узнаете его - это тот самый разбойник, которому Гаврила попал огненным шаром в плечо. Разбойник молча связывает вас и уносит в неизвестном направлении.
                 Вас тащат по земле, как мешок, и в один момент вы зацепляетесь за сучок, в результате чего веревка рвется. Выбраться?'''
    },
    "quest_5_x": {
        "text": '''Через несколько часов взывания о помощи к вам приходит некий разбойник, вы сразу узнаете его - это тот самый разбойник, которому Гаврила попал огненным шаром в плечо. Разбойник молча связывает вас и уносит в неизвестном направлении.\n
                  Вас тащат по земле, как мешок, и в один момент вы зацепляетесь за сучок, в результате чего веревка рвется. Выбраться?''',
        "tts": '''Через несколько часов взывания о помощи к вам приходит некий разбойник, вы сразу узнаете его - это тот самый разбойник, которому Гаврила попал огненным шаром в плечо. Разбойник молча связывает вас и уносит в неизвестном направлении.
                 Вас тащат по земле, как мешок, и в один момент вы зацепляетесь за сучок, в результате чего веревка рвется. Выбраться?'''
    },
    "quest_6_x": {
        "text": '''Разбойник остановился и начал смотреть в карту. Вы воспользовались моментом и выбрались. Куда лучше всего нанести удар: "По голове", "По ногам" или "По плечу"?''',
        "tts": '''Разбойник остановился и начал смотреть в карту. Вы воспользовались моментом и выбрались. Куда лучше всего нанести удар: "По голове", "По ногам" или "По плечу"?'''
    },
    "quest_6_1x": {
        "text": '''Разбойник остановился, посмотрел на карту и обернулся, заметив порванную веревку. Он нанес вам сильный удар, который ошеломил вас. Загрузить последнее сохранение?''',
        "tts": '''Разбойник остановился, посмотрел на карту и обернулся, заметив порванную веревку. Он нанес вам сильный удар, который ошеломил вас. Загрузить последнее сохранение?'''
    },
    "quest_7_x": {
        "text": '''Вы с большой силой бьете разбойника по плечу, и он падает на землю, потеряв сознание от сильной боли.\n
                  Плюс 10 очков опыта.\n
                  Связать и обыскать или просто обыскать разбойника?''',
        "tts": '''Вы с большой силой бьете разбойника по плечу, и он падает на землю, потеряв сознание от сильной боли.
                 Плюс 10 очков опыта.
                 Связать и обыскать или просто обыскать разбойника?'''
    },
    "quest_7_1x": {
        "text": '''Разбойник ничего не почувствовав, резко оборачивается и бьет вас, вы падаете на землю. Загрузить последнее сохранение?''',
        "tts": '''Разбойник ничего не почувствовав, резко оборачивается и бьет вас, вы падаете на землю. Загрузить последнее сохранение?'''
    },
    "quest_8_1x": {
        "text": '''Вы туго связываете оставшуюся веревкой разбойника. Затем обыскиваете его и находите ржавый меч и карту.\n
                  Продолжить?''',
        "tts": '''Вы туго связываете оставшуюся веревкой разбойника. Затем обыскиваете его и находите ржавый меч и карту.
                 Продолжить?'''
    },
    "quest_8_x": {
        "text": '''Вы обыскиваете разбойника и находите ржавый меч и карту. Продолжить?''',
        "tts": '''Вы обыскиваете разбойника и находите ржавый меч и карту. Продолжить?'''
    },
    "quest_9": {
        "text": '''Поздравляем с прохождением 1 квеста! Теперь вам доступна карта, чтобы открыть карту, скажите "Открыть карту". Для того чтобы вернуть в убежище, скажите "Вернуться в убежище".''',
        "tts": '''Поздравляем с прохождением 1 квеста! Теперь вам доступна карта, чтобы открыть карту, скажите "Открыть карту". Для того чтобы вернуть в убежище, скажите "Вернуться в убежище".'''
    },

    "quest2": {
        "text": '''Чтобы развить магические способности, Гаврила посоветовал вам медитировать.\n
                  Начать квест?''',
        "tts": '''Чтобы развить магические способности, Гаврила посоветовал вам медитировать.
                 Начать квест?'''
    },
    "quest2_1": {
        "text": '''"Глубоко вдохнуть, закрыть глаза и представить, как магическая энергия проникает в руки и тело, выдохнуть. Сделать вдох и сосредоточиться на своих руках, представив их как инструмент для магической работы, выдохнуть."\n
                   Продолжить?''',
        "tts": '''"Глубоко вдохнуть, закрыть глаза и представить, как магическая энергия проникает в руки и тело, выдохнуть. Сделать вдох и сосредоточиться на своих руках, представив их как инструмент для магической работы, выдохнуть."
                  Продолжить?'''
    },
    "quest2_1_1": {
        "text": '''После медитации магические силы так и не появились. Вернуться в убежище?''',
        "tts": '''После медитации магические силы так и не появились. Вернуться в убежище?'''
    },
    "quest2_2": {
        "text": '''"Я вижу, что ты до сих пор не освоил магию. В таком случае остаётся только один вариант: тебе нужно отправиться в Башню Магов. Однако будь осторожен, там часто бродят опасные "Нечестивые"."\n
                   Отправиться в Башню Магов?''',
        "tts": '''"<speaker audio="dialogs-upload/b2735f27-2dcf-4c5a-ad8c-a08d78959ad0/d2cb1537-c7db-4d9e-9b52-6fe56a5c0a80.opus">."
                  Отправиться в Башню Магов?'''
    },
    "quest2_3": {
        "text": '''Вы открываете карту и идете в Магическую Башню. Через несколько часов вы доходите до очень высокой башни. Перед входом стоит человек в черной мантии.\n
                  Сразиться с Нечестивым?''',
        "tts": '''Вы открываете карту и идете в Магическую Башню. Через несколько часов вы доходите до очень высокой башни. Перед входом стоит человек в черной мантии.
                 Сразиться с Нечестивым?'''
    },
    "quest2_4_x": {
        "text": '''Вы разворачиваетесь и направляетесь обратно, но внезапно Нечестивый окликнул вас и готовится к бою, если вы не остановитесь. Вы осознаёте, что возвращаться уже нельзя. Начать битву?''',
        "tts": '''Вы разворачиваетесь и направляетесь обратно, но внезапно Нечестивый окликнул вас и готовится к бою, если вы не остановитесь. Вы осознаёте, что возвращаться уже нельзя. Начать битву?'''
    },
    "quest2_4_1x": {
        "text": '''Вы приближаетесь к башне и извлекаете ржавый меч из ножен. Нечестивый издает насмешливый смех. Чтобы атаковать его, скажите "Легкая атака" или "Тяжелая атака". Внимательно следите за своей выносливостью!''',
        "tts": '''Вы приближаетесь к башне и извлекаете ржавый меч из ножен. Нечестивый издает насмешливый смех. Чтобы атаковать его, скажите "Легкая атака" или "Тяжелая атака". Внимательно следите за своей выносливостью!'''
    },
    "quest2_5_x": {
        "text": '''Нечестивый упал на землю. Вы осторожно переступаете через него и направляетесь в башню. Открыв дверь башни, вы замечаете длинную винтовую лестницу.\n
                  Подняться по лестнице?''',
        "tts": '''Нечестивый упал на землю. Вы осторожно переступаете через него и направляетесь в башню. Открыв дверь башни, вы замечаете длинную винтовую лестницу.
                 Подняться по лестнице?'''
    },
    "quest2_5_1x": {
        "text": '''Нечестивый оказался сильнее вас, может в следующий раз повезет. Загрузить последнее сохранение?''',
        "tts": '''Нечестивый оказался сильнее вас, может в следующий раз повезет. Загрузить последнее сохранение?'''
    },
    "quest2_6": {
        "text": '''Через несколько десятков минут подъема по башне, спотыкаясь и падая, вы добираетесь до вершины. На кафедре вы замечаете огромную, толстую книгу с замком. Однако, при попытке сбить замок с книги, вы почувствовали жгучую боль от огня. Начать медитировать?''',
        "tts": '''Через несколько десятков минут подъема по башне, спотыкаясь и падая, вы добираетесь до вершины. На кафедре вы замечаете огромную, толстую книгу с замком. Однако, при попытке сбить замок с книги, вы почувствовали жгучую боль от огня. Начать медитировать?'''
    },
    "quest2_7": {
        "text": '''В центре башни, вы сделали глубокий вдох и сели в позу лотоса. В вашей памяти всплыли слова Гаврилы.\n
                  Вы сосредоточились и начали визуализировать, как магическая энергия заполняет ваше тело, протекая через ваши руки и пальцы. Вдохнув еще раз, вы начали сосредоточиваться на своих руках, представляя их как мощный инструмент для магических действий.\n
                  Внезапно, окна башни распахнулись, и вы почувствовали, как какая-то неописуемая сила протекла по вашим венам. Чувства были невероятными - вы почувствовали магическую энергию, которая проникла в ваше тело, и ощущали, как она теперь принадлежит вам. Это было чудесное ощущение, и вы понимали, что теперь вы готовы использовать свои новые магические силы для достижения своих целей. Продолжить?''',
        "tts": '''В центре башни, вы сделали глубокий вдох и сели в позу лотоса. В вашей памяти всплыли слова Гаврилы.
                 Вы сосредоточились и начали визуализировать, как магическая энергия заполняет ваше тело, протекая через ваши руки и пальцы. Вдохнув еще раз, вы начали сосредоточиваться на своих руках, представляя их как мощный инструмент для магических действий.
                 Внезапно, окна башни распахнулись, и вы почувствовали, как какая-то неописуемая сила протекла по вашим венам. Чувства были невероятными - вы почувствовали магическую энергию, которая проникла в ваше тело, и ощущали, как она теперь принадлежит вам. Это было чудесное ощущение, и вы понимали, что теперь вы готовы использовать свои новые магические силы для достижения своих целей. Продолжить?'''
    },
    "quest2_8": {
        "text": '''Теперь в ваших венах течет магическая энергия, которую можно использовать для произнесения заклинаний.\n
                  Чувствуя мощь этой энергии, вы готовы к изучению заклинаний.\n
                  Вернуться в убежище?''',
        "tts": '''Теперь в ваших венах течет магическая энергия, которую можно использовать для произнесения заклинаний.
                 Чувствуя мощь этой энергии, вы готовы к изучению заклинаний.
                 Вернуться в убежище?'''
    }
}